Repository: pgRouting/workshop
Catalog: locale/*/LC_MESSAGES/basic/appendix.po
Languages: es

source: Appendix: Basic workshop solutions
es: Apéndice: Soluciones básicas para el taller

source: Solutions to :doc:`pedestrian`
es: Soluciones a :doc:`pedestrian`

source: **Exercise**: 1 (**Chapter:** Pedestrian)
es: **Ejercicio**: 1 (**Capítulo:** Peatón)

source: **Exercise**: 2 (**Chapter:** Pedestrian)
es: **Ejercicio**: 2 (**Capítulo:** Peatón)

source: **Exercise**: 3 (**Chapter:** Pedestrian)
es: **Ejercicio**: 3 (**Capítulo:** Peatón)

source: **Exercise**: 4 (**Chapter:** Pedestrian)
es: **Ejercicio**: 4 (**Capítulo:** Peatón)

source: **Exercise**: 5 (**Chapter:** Pedestrian)
es: **Ejercicio**: 5 (**Capítulo:** Peatón)

source: :ref:`basic/pedestrian:Exercise 5: Many Pedestrians going to different destinations returning aggregate costs`
es: :ref:`basic/pedestrian:Ejercicio 5: Muchos Peatones que van a diferentes destinos devolviendo costos agregados`

source: **Exercise**: 6 (**Chapter:** Pedestrian)
es: **Ejercicio**: 6 (**Capítulo:** Peatón)

source: Solutions to :doc:`vehicle`
es: Soluciones a :doc:`vehicle`

source: **Exercise**: 1 (**Chapter:** Vehicle)
es: **Ejercicio**: 1 (**Capítulo:** vehículo)

source: **Exercise**: 2 (**Chapter:** Vehicle)
es: **Ejercicio**: 2 (**Capítulo:** Vehículo)

source: **Exercise**: 3 (**Chapter:** Vehicle)
es: **Ejercicio**: 3 (**Capítulo:** Vehículo)

source: **Exercise**: 4 (**Chapter:** Vehicle)
es: **Ejercicio**: 4 (**Capítulo:** Vehículo)

source: **Exercise**: 5 (**Chapter:** Vehicle)
es: **Ejercicio**: 5 (**Capítulo:** Vehículo)

source: Solutions to :doc:`sql_function`
es: Soluciones a :doc:`sql_function`

source: **Exercise**: 1 (**Chapter:** SQL)
es: **Ejercicio**: 1 (**Capítulo:** SQL)

source: **Exercise**: 2 (**Chapter:** SQL)
es: **Ejercicio**: 2 (**Capítulo:** SQL)

source: **Exercise**: 3 (**Chapter:** SQL)
es: **Ejercicio**: 3 (**Capítulo:** SQL)

source: **Exercise**: 4 (**Chapter:** SQL)
es: **Ejercicio**: 4 (**Capítulo:** SQL)

source: **Exercise**: 5 (**Chapter:** SQL)
es: **Ejercicio**: 5 (**Capítulo:** SQL)

source: **Exercise**: 6 (**Chapter:** SQL)
es: **Ejercicio**: 6 (**Capítulo:** SQL)

source: **Exercise**: 7 (**Chapter:** SQL)
es: **Ejercicio**: 7 (**Capítulo:** SQL)

source: **Exercise**: 8 (**Chapter:** SQL)
es: **Ejercicio**: 8 (**Capítulo:** SQL)

source: **Exercise**: 9 (**Chapter:** SQL)
es: **Ejercicio**: 9 (**Capítulo:** SQL)

source: **Exercise**: 10 (**Chapter:** SQL)
es: **Ejercicio**: 10 (**Capítulo:** SQL)

source: **Exercise**: 11 (**Chapter:** SQL)
es: **Ejercicio**: 11 (**Capítulo:** SQL)

source: Solutions to :doc:`plpgsql_function`
es: Soluciones a :doc:`plpgsql_function`

source: **Exercise**: 1 (**Chapter:** pl/pgsql)
es: **Ejercicio**: 1 (**Capítulo:** pl/pgsql)

source: For ``ways_vertices_pgr``:
es: Para ``ways_vertices_pgr``:

source: For ``vehicle_net``:
es: Para ``vehicle_net``:

source: For ``taxi_net``:
es: Para ``taxi_net``:

source: For ``walk_net``:
es: Para ``walk_net``:

source: **Exercise**: 2 (**Chapter:** pl/pgsql)
es: **Ejercicio**: 2 (**Capítulo:** pl/pgsql)

source: **Exercise**: 3 (**Chapter:** pl/pgsql)
es: **Ejercicio**: 3 (**Capítulo:** pl/pgsql)

source: For ``vehicle_net_vertices_pgr``:
es: Para``vehicle_net_vertices_pgr``:

source: For ``taxi_net_vertices_pgr``:
es: Para ``taxi_net_vertices_pgr``:

source: For ``walk_net_vertices_pgr``:
es: Para ``walk_net_vertices_pgr``:

source: **Exercise**: 4 (**Chapter:** pl/pgsql)
es: **Ejercicio**: 4 (**Capítulo:** pl/pgsql)

source: **Exercise**: 5 (**Chapter:** pl/pgsql)
es: **Ejercicio**: 5 (**Capítulo:** pl/pgsql)

source: **Exercise**: 6 (**Chapter:** pl/pgsql)
es: **Ejercicio**: 6 (**Capítulo:** pl/pgsql)

source: **Exercise**: 7 (**Chapter:** pl/pgsql)
es: **Ejercicio**: 7 (**Capítulo:** pl/pgsql)

source: For ``vehicle_net``
es: Para ``vehicle_net``

source: For ``taxi_net``
es: Para ``taxi_net``

source: The ``WARNING`` message:
es: El mensaje ``ADVERTENCIA``:

source: The query results:
es: Los resultados de la consulta:

source: For ``walk_net``
es: Para ``walk_net``
