Repository: pgRouting/workshop
Catalog: locale/*/LC_MESSAGES/basic/data.po
Languages: es

source: Prepare Data
es: Preparar Datos

source: To be able to use pgRouting, data has to be imported into a database.
es: Para poder usar pgRouting, los datos deben importarse a una base de datos.

source: Chapter Contents
es: Contenido del Capítulo

source: Prepare the database
es: Preparar la base de datos

source: pgRouting is installed as extension. This requires:
es: pgRouting se instala como extensión. Esto requiere:

source: These requirements are met on OSGeoLive. When the required software is installed, open a terminal window by pressing :code:`ctrl-alt-t` and follow the instructions.
es: Estos requisitos se cumplen en OSGeoLive. Cuando se instale el software necesario, abrir una ventana de terminal presionando :code:`ctrl-alt-t` y siguir las instrucciones.

source: Information about installing OSGeoLive can be found on :doc:`../general-intro/osgeolive`.
es: Puede encontrar información sobre la instalación de OSGeoLive en :doc:`../general-intro/osgeolive`.

source: If OSGeoLive is not being used, please refer to the chapter's appendix to set up the user ``user``.
es: Si OSGeoLive no se está utilizando, consulte el apéndice del capítulo para configurar el usuario ``user``.

source: Create a pgRouting compatible database
es: Crear una base de datos compatible con pgRouting

source: Depending on the postgres configuration :code:`-U <user>` is needed on :code:`psql` commands
es: Dependiendo de la configuración de postgres :code:`-U <user>` es necesario en los comandos

source: To exit the database use ``\q``
es: Para salir de la base de datos utilizar ``\q``

source: Get the Workshop Data
es: Obtenga los Datos del Taller

source: The pgRouting workshop will make use of OpenStreetMap data, which is already available on `OSGeoLive <https://live.osgeo.org>`_. This workshop will use the ``Belém`` city data and is a snapshot of Sep 2024.
es: El taller pgRouting hará uso de los datos de OpenStreetMap, que ya están disponibles en `OSGeoLive <https://live.osgeo.org>`_. Este taller utilizará los datos de la ciudad de ``Belém`` y es una instantánea de Sep 2024.

source: Getting the data
es: Obtención de los datos

source: Option 1) When using OSGeoLive
es: Opción 1) Cuando esté usando OSGeoLive

source: OSGeoLive comes with OSM data from the city of Belém.
es: OSGeoLive viene con datos de OSM de la ciudad de Belém.

source: Option 2) Download data form OSGeoLive website
es: Opción 2) Descargar datos de sitio web de OSGeoLive

source: The exact same data can be found on the OSGeoLive download page.
es: Los mismos datos exactos se pueden encontrar en la página de descarga de OSGeoLive.

source: Option 3) Download using Overpass XAPI
es: Opción 3) Descargar usando Overpass XAPI

source: The following downloads the latest OSM data on using the same area. Using this data in the workshop can generate variations in the results, due to changes since Sep 2024.
es: A continuación se descargan los datos de OSM más recientes sobre el uso de la misma área. El uso de estos datos en el taller puede generar variaciones en los resultados, debido a los cambios desde Septiembre de 2024.

source: More information about how to download OpenStreetMap data can be found in https://wiki.openstreetmap.org/wiki/Downloading_data
es: Puede encontrar más información sobre cómo descargar datos de OpenStreetMap en https://wiki.openstreetmap.org/wiki/Downloading_data

source: An alternative for very large areas is to use the download services of `Geofabrik <https://download.geofabrik.de>`_.
es: Una alternativa para zonas muy grandes es utilizar los servicios de descarga de `Geofabrik <http://download.geofabrik.de>`_.

source: Upload data to the database
es: Cargar datos en la base de datos

source: The next step is to run ``osm2pgrouting`` converter, which is a command line tool that inserts the data in the database, "ready" to be used with pgRouting. Additional information about ``osm2pgrouting`` can be found at the :doc:`../appendix/appendix-3`
es: El siguiente paso es ejecutar el convertidor ``osm2pgrouting'', que es una herramienta de línea de comandos que inserta los datos en la base de datos, "listo" para ser utilizado con pgRouting. Puede encontrar información adicional sobre ``osm2pgrouting :doc:`../appendix/appendix-3`

source: For this step:
es: Para este paso:

source: the osm2pgrouting default ``mapconfig.xml`` configuration file is used
es: se utiliza el archivo de configuración predeterminado de osm2pgrouting ``mapconfig.xml``

source: and the ``~/Desktop/workshop/BELEM_BR.osm`` data
es: y los datos de ``~/Desktop/workshop/BELEM_BR.osm``

source: with the ``city_routing`` database
es: con la base de datos ``city_routing``

source: From a terminal window :code:`ctrl-alt-t`.
es: Desde una ventana de terminal :code:`ctrl-alt-t`.

source: Run the osm2pgrouting converter
es: Ejecute el convertidor osm2pgrouting

source: Depending on the osm2pgrouting version `-W password` is needed
es: Dependiendo de la versión osm2pgrouting `-W password` es necesario

source: Output:
es: Salida:

source: Tables on the database
es: Tablas en la base de datos

source: If everything went well the result should look like this:
es: Si todo salió bien el resultado debería verse así:

source: Chapter: Appendix
es: Capítulo: Apéndice

source: OSGeoLive's account name on the database is ``user``. To easily use the workshop when not using OSGeoLive this extra steps are needed:
es: El nombre de cuenta de OSGeoLive en la base de datos es ``user``. Para utilizar fácilmente el taller cuando no se utiliza OSGeoLive se necesitan estos pasos adicionales:
