Repository: pgRouting/workshop
Catalog: locale/*/LC_MESSAGES/basic/graphs.po
Languages: es, sv

source: Graph views
es: Vistas de grafos
sv: Diagramvyer

source: Chapter Contents
es: Contenido del Capítulo
sv: Kapitelinnehåll

source: Different application require different graphs. This chapter covers how to discard disconnected segments and different approaches to create graphs.
es: Diferentes aplicaciones requieren diferentes gráficos. En este capítulo se explica cómo descartar segmentos desconectados y los distintos métodos para crear gráficos.
sv: Olika applikationer kräver olika grafer. I det här kapitlet beskrivs hur man tar bort segment som inte är sammankopplade och olika sätt att skapa grafer.

source: The graph requirements
es: Requisitos del grafo
sv: Kraven för grafen

source: In this chapter there are three graph requirements. It consists on three graphs based on a **fully connected** graph derived from ``ways``: two for different types of vehicles and one for pedestrian, the source and the target in all of them are based on the ``source_osm`` and ``target_osm``.
es: En este capítulo hay tres requisitos gráficos. Se trata de tres grafos derivados de un grafo **completamente conectado** extraído de ``ways``: dos para distintos tipos de vehículos y uno para peatones. En todos ellos, el origen y el destino se basan en ``source_osm`` y el ``target_osm``.
sv: I det här kapitlet finns det tre grafkrav. Det består av tre grafer baserade på en **fullständigt sammanhängande** graf som härrör från ``vägar``: två för olika typer av fordon och en för fotgängare, källan och målet i dem alla är baserade på ``källans_osm`` och ``målets_osm``.

source: The description of the graphs:
es: La descripción de los grafos:
sv: Beskrivning av graferna:

source: Particular vehicle:
es: Vehículo particular:
sv: Särskilt fordon:

source: Circulate on the whole Belém area.
es: Circular por toda la zona de Belém.
sv: Cirkulera i hela Belém-området.

source: Do not use `steps`, `footway`, `path`, `cycleway`.
es: No usar `steps`, `footway`, `path`, `cycleway`.
sv: Använd inte `steps`, `footway`, `path`, `cycleway`.

source: Speed is the default speed from OSM information.
es: La velocidad es la velocidad predeterminada de la información de OSM.
sv: Speed är standardhastigheten från OSM-informationen.

source: Taxi vehicle:
es: Vehículo Taxi:
sv: Taxifordon:

source: Circulate on a smaller area:
es: Circula en un área más pequeña:
sv: Cirkulera på en mindre yta:

source: Bounding box: ``(-48.52,-1.46,-48.45,-1.41)``
es: Caja delimitadora: ``(-48.52,-1.46,-48.45,-1.41)``
sv: Avgränsningsruta: ``(-48.52,-1.46,-48.45,-1.41)``

source: Speed is 10% slower than that of the particular vehicles.
es: La velocidad es 10% inferior a la de los vehículos particulares.
sv: Hastigheten är 10% långsammare än för de aktuella fordonen.

source: Pedestrians:
es: Peatones:
sv: Fotgängare:

source: Walk on the whole Belém area.
es: Caminar por toda la zona de Belém.
sv: Promenad i hela Belém-området.

source: Can not walk on exclusive vehicle ways
es: No se puede caminar por vías exclusivas para vehículos
sv: Kan inte gå på exklusiva fordonsvägar

source: `motorways` and on `primary` segments.
es: En segmentos `motorways` y `primary`.
sv: "motorways" och på "primary" segment.

source: The speed is ``2 mts/sec``.
es: La velocidad es de ``2 mts/sec``.
sv: Hastigheten är ``2 mts/sek``.

source: ``pgr_extractVertices`` compute the connected components of an undirected graph using a Depth First Search approach. A connected component of an undirected graph is a set of vertices that are all reachable from each other.
es: ``pgr_extractVertices`` calcula los componentes conectados de un grafo no dirigido utilizando el método de búsqueda en profundidad. Un componente conectado de un grafo no dirigido es un conjunto de vértices que son todos alcanzables entre sí.
sv: ``pgr_extractVertices`` beräknar de anslutna komponenterna i en odelad graf med hjälp av en djup första sökning. En ansluten komponent i en odelad graf är en uppsättning hörn som alla är nåbara från varandra.

source: Signature summary
es: Resumen de la firma
sv: Sammanfattning av signatur

source: Description of the function can be found in `pgr_extractVertices <https://docs.pgrouting.org/latest/en/pgr_connectedComponents.html>`__
es: La descripción de la función se encuentra en `pgr_extractVertices <https://docs.pgrouting.org/latest/en/pgr_connectedComponents.html>`__
sv: Beskrivning av funktionen finns i `pgr_extractVertices <https://docs.pgrouting.org/latest/en/pgr_connectedComponents.html>`__

source: Exercise 1: Create a vertices table
es: Ejercicio 1: Crear una tabla de vértices
sv: Övning 1: Skapa en vertices-tabell

source: Problem
es: Problema

source: Create the vertices table corresponding to the edges in ``ways``.
es: Crea la tabla de vértices correspondiente a las aristas en ``ways``.
sv: Skapa en tabell med toppar som motsvarar kanterna i ``ways``.

source: Solution
es: Solución
sv: Lösning

source: A graph consists of a set of vertices and a set of edges.
es: Un grafo está formado por un conjunto de vértices y un conjunto de aristas.
sv: En graf består av en uppsättning hörn och en uppsättning kanter.

source: In this case, the ``ways`` table is a set of edges.
es: En este caso, la tabla ``ways`` es un conjunto de aristas.
sv: I detta fall är tabellen ``ways`` en uppsättning kanter.

source: In order to make use of all the graph functions from pgRouting, it is required have the set of vertices defined.
es: Para poder hacer uso de todas las funciones sobre grafos de pgRouting, es necesario tener definido el conjunto de vértices.
sv: För att kunna använda alla graffunktioner i pgRouting krävs det att uppsättningen av hörnpunkter är definierad.

source: From the requirements, the graph is going to be based on OSM identifiers.
es: Según los requisitos, el grafo se basará en identificadores OSM.
sv: Enligt kraven kommer grafen att baseras på OSM-identifierare.

source: Reviewing the description of the vertices table
es: Revisando de la descripción de la tabla de vértices
sv: Granskning av beskrivningen av vertices-tabellen

source: Inspecting the information on the vertices table
es: Inspeccionando la información de la tabla de vértices
sv: Inspektera informationen i tabellen vertices

source: Exercise 2: Fill up other columns in the vertices table
es: Ejercicio 2: Llenar las otras columnas de la tabla de vértices
sv: Övning 2: Fyll i andra kolumner i vertikaltabellen

source: Fill up geometry information on the vertices table.
es: Llena la información de geometría en la tabla de vértices.
sv: Fyll i geometriinformation i tabellen Vertices.

source: Count the number of rows that need to be filled up.
es: Contar el número de filas que hay que rellenar.
sv: Räkna antalet rader som måste fyllas på.

source: Update the ``geom`` columns based on the ``source_osm`` column from ``ways`` table.
es: Actualizar la columna ``geom`` basándose en la columna ``source_osm`` de la tabla ``ways``.
sv: Uppdatera kolumnerna ``geom`` baserat på kolumnen ``ource_osm`` från tabellen ``ways``.

source: Use the start point of the geometry.
es: Utilizar el punto inicial de la geometría.
sv: Använd geometrins startpunkt.

source: Not expecting to be done due to the fact that some vertices are only dead ends.
es: No se espera haber terminado debido a que algunos vértices son sólo callejones sin salida.
sv: Förväntas inte bli gjort på grund av att vissa hörn bara är återvändsgränder.

source: Update the ``geom`` columns based on the ``target_osm`` column from ``ways`` table.
es: Actualizar las columnas ``geom`` basándose en la columna ``target_osm`` de la tabla ``ways``.
sv: Uppdatera kolumnerna ``geom`` baserat på kolumnen ``target_osm`` från tabellen ``ways``.

source: Use the end point of the geometry.
es: Utilizar el punto final de la geometría.
sv: Använd geometrins slutpunkt.

source: Expecting to be done, that is the geometry column should not have a ``NULL`` value.
es: Se espera haber terminado, es decir la columna geometría no debe tener un valor ``NULL``.
sv: Förväntar sig att det ska göras, det vill säga att geometrikolumnen inte ska ha ett ``NULL``-värde.

source: Update the ``x`` and ``y`` columns based on the ``geom`` column.
es: Actualizar las columnas ``x`` e ``y`` en función de la columna ``geom``.
sv: Uppdatera kolumnerna ``x`` och ``y`` baserat på kolumnen ``geom``.

source: ``pgr_connectedComponents`` compute the connected components of an undirected graph using a Depth First Search approach. A connected component of an undirected graph is a set of vertices that are all reachable from each other.
es: ``pgr_connectedComponents`` calcula los componentes conectados de un grafo no dirigido utilizando un método de búsqueda en profundidad. Un componente conectado de un grafo no dirigido es un conjunto de vértices que son todos alcanzables entre sí.
sv: ``pgr_connectedComponents`` beräknar de anslutna komponenterna i en odelad graf med hjälp av Depth First Search. En ansluten komponent i en odelad graf är en uppsättning hörn som alla är nåbara från varandra.

source: Description of the function can be found in `pgr_connectedComponents <https://docs.pgrouting.org/latest/en/pgr_connectedComponents.html>`__
es: La descripción de la función se encuentra en `pgr_connectedComponents <https://docs.pgrouting.org/latest/en/pgr_connectedComponents.html>`__
sv: Beskrivning av funktionen finns i `pgr_connectedComponents <https://docs.pgrouting.org/latest/en/pgr_connectedComponents.html>`__

source: Exercise 3: Set components on edges and vertices tables
es: Ejercicio 3: Establecer componentes en tablas de aristas y vértices
sv: Övning 3: Setkomponenter på kanter och hörntabeller

source: Get the information about the graph components.
es: Obtener la información sobre los componentes del grafo.
sv: Hämta information om grafens komponenter.

source: Create additional columns on the edges and vertices tables.
es: Crear columnas adicionales en las tablas de aristas y vértices.
sv: Skapa ytterligare kolumner i tabellerna för kanter och hörn.

source: Use the ``pgr_connectedComponents`` to fill up the vertices table.
es: Utilizar ``pgr_connectedComponents`` para llenar la tabla de vértices.
sv: Använd ``pgr_connectedComponents`` för att fylla i tabellen med hörnpunkter.

source: Use the results to store the component numbers on the vertices table. (**line 1**)
es: Utilizar los resultados para almacenar los números de los componentes en la tabla de vértices. (**línea 1**)
sv: Använd resultatet för att lagra komponentnumren i vertikaltabellen. (**rad 1**)

source: Use the OSM identifiers of the vertices. (**lines 4-5**)
es: Utilizar los identificadores OSM de los vértices. (**líneas 4-5**)
sv: Använd OSM-identifierarna för topparna. (**rader 4-5**)

source: Update the edges table with based on the component number of the vertex
es: Actualizar la tabla de aristas con en función del número de componente del vértice
sv: Uppdatera tabellen med kanter baserat på toppunktens komponentnummer

source: Exercise 4: Inspect the components
es: Ejercicio 4: Inspeccionar los componentes
sv: Övning 4: Inspektera komponenterna

source: Answer the following questions:
es: Responder a las siguientes preguntas:
sv: Svara på följande frågor:

source: How many components are in the vertices table?
es: ¿Cuántos componentes hay en la tabla de vértices?
sv: Hur många komponenter finns det i vertices-tabellen?

source: How many components are in the edges table?
es: ¿Cuántos componentes hay en la tabla de bordes?
sv: Hur många komponenter finns det i kantbordet?

source: List the 10 components with more edges.
es: Enumerar los 10 componentes con más aristas.
sv: Lista de 10 komponenter som har flest kanter.

source: Get the component with the maximum number of edges.
es: Obtiener el componente con el máximo número de aristas.
sv: Hämta komponenten med det maximala antalet kanter.

source: Count the distinct components.
es: Contar los componentes distintos.
sv: Räkna de olika komponenterna.

source: Count number of rows grouped by component. (**line 1**)
es: Número de filas agrupadas por componente. (**línea 1**)
sv: Räkna antal rader grupperade efter komponent. (**rad 1**)

source: Inverse order to display the top 10. (**line 2**)
es: Orden inverso para mostrar los 10 primeros. (**línea 2**)
sv: Omvänd ordning för att visa topp 10. (**rad 2**)

source: Use the query from last question to get the maximum count
es: Utilizar la consulta de la última pregunta para obtener el recuento máximo
sv: Använd frågan från förra frågan för att få det maximala antalet

source: Get the component that matches the maximum value.
es: Obtiene el componente que coincide con el valor máximo.
sv: Hämta den komponent som matchar det högsta värdet.

source: Preparing the graphs
es: Preparación de los grafos
sv: Förberedelse av graferna

source: Exercise 5: Creating a view for routing
es: Ejercicio 5: Creación de una vista para el ruteo
sv: Övning 5: Skapa en vy för routing

source: View of roads for vehicles
es: Vista de carreteras para vehículos
sv: Utsikt över vägar för fordon

source: Create a view with minimal amount of information for processing the particular vehicles.
es: Crear una vista con una cantidad mínima de información para procesar los vehículos particulares.
sv: Skapa en vy med minimal mängd information för att bearbeta de specifika fordonen.

source: Use the OSM identifiers on the vertices.
es: Utilizar los identificadores OSM en los vértices.
sv: Använd OSM-identifierarna på topparna.

source: Routing `cost` and `reverse_cost` in terms of seconds for routing calculations.
es: El `cost` y `reverse_cost` del ruteo en términos de segundos para los cálculos de ruteo.
sv: Routing `cost` och `reverse_cost` i sekunder för beräkningar av routing.

source: Exclude `steps`, `footway`, `path`, `cycleway` segments.
es: Excluye los segmentos `steps`, `footway`, `path`, `cycleway`.
sv: Utesluta segmenten `steps`, `footway`, `path`, `cycleway`.

source: Data needed in the view for further processing.
es: Datos necesarios en la vista para su posterior procesamiento.
sv: Data som behövs i vyn för vidare bearbetning.

source: `name` The name of the segment.
es: `name` El nombre del segmento.
sv: `name` Namnet på segmentet.

source: `length_m` The length in meters rename to ``length``.
es: `length_m` La longitud en metros renombrar a ``length``.
sv: `length_m` Längden i meter byter namn till ``length``.

source: `the_geom` The geometry rename to ``geom``.
es: `the_geom` El cambio de nombre de la geometría a ``geom``.
sv: `the_geom` Geometrin byter namn till ``geom``.

source: Verify the number of edges was reduced.
es: Comprobar que se ha reducido el número de aristas.
sv: Kontrollera att antalet kanter har minskats.

source: Creating the view:
es: Creación de la vista:
sv: Skapa en vy:

source: If you need to reconstruct the view, first drop it using the command on **line 1**.
es: Si necesita reconstruir la vista, primero borrarla usando el comando en línea **1**.
sv: Om du behöver rekonstruera vyn, släpp den först med hjälp av kommandot på **rad 1**.

source: Get the component with maximum number of edges (**lines 6-10**)
es: Obtener el componente con el máximo número de aristas (**líneas 6-10**)
sv: Hämta komponenten med maximalt antal kanter (**raderna 6-10**)

source: The `source` and `target` requirements for the function are to be with OSM identifiers. (line **14**)
es: Los requisitos `source` y `target` para la función deben ser con identificadores OSM. (línea **14**)
sv: Kraven på `source` och `target` för funktionen ska vara med OSM-identifierare. (rad **14**)

source: The ``cost`` and ``reverse_cost`` are in terms of seconds. (line **15**)
es: El ``coste`` y el ``reverse_cost`` se expresan en segundos. (línea **15**)
sv: Kostnaden och den omvända kostnaden anges i sekunder. (rad **15**)

source: The additional parameters ``length_m`` and ``the_geom`` are renamed, ``name`` is also included. (line **16**)
es: Los parámetros adicionales ``length_m`` y ``the_geom`` se renombran, también se incluye ``name``. (línea **16**)
sv: De ytterligare parametrarna ``length_m`` och ``the_geom`` har bytt namn, ``name`` ingår också. (rad **16**)

source: ``JOIN`` with the `configuration`:
es: ``JOIN`` con `configuration`:
sv: ``JOIN`` med `konfigurationen`:

source: Exclude `steps`, `footway`, `path`, `cycleway`. (line **18**)
es: Excluir `steps`, `footway`, `path`, `cycleway`. (línea **18**)
sv: Exkludera `steps`, `footway`, `path`, `cycleway`. (rad **18**)

source: Verification:
es: Verificación:
sv: Verifiering:

source: Count the rows on the original ``ways`` and on ``vehicle_net``.
es: Contar las filas en ``ways`` original y en ``vehicle_net``.
sv: Räkna raderna på de ursprungliga ``ways`` och på ``vehicle_net``.

source: Get the description of the view
es: Obtener la descripción de la vista
sv: Hämta beskrivningen av vyn

source: Exercise 6: Limiting the road network within an area
es: Ejercicio 6: Limitar la red de carreteras de una zona
sv: Övning 6: Begränsa vägnätet inom ett område

source: View of smaller set of roads for vehicles
es: Vista de un conjunto más pequeño de carreteras para vehículos
sv: Vy över mindre uppsättning vägar för fordon

source: Create a view ``taxi_net`` for the `taxi`:
es: Crar una vista ``taxi_net`` para el `taxi`:
sv: Skapa en vy ``taxi_net`` för `taxi`:

source: The taxi can only circulate inside this Bounding Box: ``(-48.52,-1.46,-48.45,-1.41)``
es: El taxi sólo puede circular dentro de este recuadro: ``(-48.52,-1.46,-48.45,-1.41)``
sv: Taxin kan bara cirkulera inom denna avgränsningsruta: ``(-48.52,-1.46,-48.45,-1.41)``

source: The taxi speed is 10% slower than the particular vehicle.
es: La velocidad de taxi es 10% inferior a la del vehículo particular.
sv: Taxihastigheten är 10% slägre än för det aktuella fordonet.

source: Verify the reduced number of road segments.
es: Verificar el número reducido de segmentos de carretera.
sv: Verifiera det minskade antalet vägsegment.

source: Adjust the taxi's ``cost`` and ``reverse_cost`` to be 10% slower than of the particular vehicle. (line **7**)
es: Ajustar el ``cost`` y el ``reverse_cost`` del taxi para que sean 10% más bajos que los del vehículo particular. (línea **7**)
sv: Justera taxins ``cost`` och ``reverse_cost`` så att de är 10% långsammare än för det aktuella fordonet. (rad **7**)

source: The graph for the taxi is a subset of the ``vehicle_net`` graph. (line **9**)
es: El grafo del taxi es un subconjunto del grafo ``vehicle_net``. (línea **9**)
sv: Grafen för taxin är en delmängd av grafen för ``vehicle_net``. (rad **9**)

source: Can only circulate inside the bounding box: ``(-48.52,-1.46,-48.45,-1.41)``. (line **10**)
es: Sólo puede circular dentro de la caja delimitadora: ``(-48.52,-1.46,-48.45,-1.41)``. (línea **10**)
sv: Kan bara cirkulera inom den avgränsande rutan: ``(-48.52,-1.46,-48.45,-1.41)``. (rad **10**)

source: Count the rows on ``taxi_net``.
es: Contar las filas en ``taxi_net``.
sv: Räkna raderna på ``taxi_net``.

source: Get the description.
es: Obtener la descripción.
sv: Hämta beskrivningen.

source: Exercise 7: Creating a materialized view for routing pedestrians
es: Ejercicio 7: Creación de una vista materializada para el ruteo de peatones
sv: Övning 7: Skapa en materialiserad vy för att dirigera fotgängare

source: View of roads for pedestrians
es: Vista de las carreteras para peatones
sv: Vy över vägar för fotgängare

source: Create a materialized view with minimal amount of information for processing pedestrians.
es: Crear una vista materializada con una cantidad mínima de información para procesar peatones.
sv: Skapa en materialiserad vy med minimal mängd information för bearbetning av fotgängare.

source: Routing `cost` and `reverse_cost` will be on seconds for routing calculations.
es: El costo de ruteo en `cost` y `reverse_cost` será en segundos para los cálculos de ruteo.
sv: Routing `cost` och `reverse_cost` kommer att vara på sekunder för routingsberäkningar.

source: Exclude `motorway` , `primary` and `secondary` segments.
es: Excluir segmentos `motorway` , `primary` y `secondary`.
sv: Exkludera segmenten `motorway`, `primary` och `secondary`.

source: `length_m` The length in meters.
es: `length_m` La longitud en metros.
sv: `length_m` Längden i meter.

source: `the_geom` The geometry.
es: `the_geom` La geometría.
sv: `the_geom` Geometrin.

source: Similar to `Exercise 5: Creating a view for routing`_:
es: Similar al `Ejercicio 5: Creación de una vista para el enrutamiento`_:
sv: Liknar `Övning 5: Skapa en vy för routing`_:

source: The ``cost`` and ``reverse_cost`` are in terms of seconds with speed of ``2 mts/sec``. (line **7**)
es: ``cost`` y ``reverse_cost`` se expresan en términos de segundos con velocidad de ``2 mts/sec``. (línea **7**)
sv: Kostnaden och den omvända kostnaden anges i sekunder med en hastighet av 2 mts/sek. (rad **7**)

source: Exclude `motorway`, `primary` and `secondary` . (line **11**)
es: Excluir `motorway`, `primary` y `secondary`. (línea **11**)
sv: Uteslut "motorway", "primary" och "secondary" (rad **11**)

source: Count the rows on the view ``walk_net``.
es: Contar las filas de la vista ``walk_net``.
sv: Räkna raderna på vyn ``walk_net``.

source: Exercise 8: Testing the views for routing
es: Ejercicio 8: Comprobación de las vistas para el ruteo
sv: Övning 8: Testa vyerna för routing

source: From the |ch7_place_1| to the |ch7_place_2|
es: Desde |ch7_place_1| hacia |ch7_place_2|
sv: Från |ch7_place_1| till |ch7_place_2|

source: Test the created views
es: Probar las vistas creadas
sv: Testa de skapade vyerna

source: In particular:
es: En particular:
sv: I synnerhet:

source: From the |ch7_place_1| to the "|ch7_place_2| using the OSM identifier
es: Desde "|ch7_place_1|" hacia "|ch7_place_2|" usando el identificador OSM
sv: Från "|ch7_place_1|" till "|ch7_place_2|" med hjälp av OSM-identifieraren

source: the views to be tested are:
es: las vistas a probar son:
sv: de åsikter som ska testas är:

source: Only show the following results, as the other columns are to be ignored on the function.
es: Mostrar únicamente los siguientes resultados, ya que las demás columnas deben omitirse en la función.
sv: Visa endast följande resultat, eftersom de andra kolumnerna ska ignoreras i funktionen.

source: ``edge`` with the name ``id``
es: ``edge`` con el nombre ``id``
sv: ``edge`` med namnet ``id``

source: ``cost`` with the name: ``seconds``
es: ``cost`` con el nombre: ``seconds``
sv: ``cost`` med namnet: ``seconds``

source: In general
es: En general
sv: I allmänhet

source: The departure is |ch7_place_1| with OSM identifier |ch7_osmid_1|.
es: El punto de partida es |ch7_place_1| con el identificador OSM |ch7_osmid_1|.
sv: Avgången är |ch7_place_1| med OSM-identifierare |ch7_osmid_1|.

source: The destination is |ch7_place_2| with OSM identifier |ch7_osmid_2|.
es: El destino es |ch7_place_2| con el identificador OSM |ch7_osmid_2|.
sv: Destinationen är |ch7_place_2| med OSM-identifieraren |ch7_osmid_2|.

source: For ``vehicle_net``:
es: Para ``vehicle_net``:
sv: För ``vehicle_net``:

source: ``vehicle_net`` is used.
es: Se utiliza ``vehicle_net``.
sv: ``vehicle_net`` används.

source: Selection of the columns with the corresponding names are on line **1**.
es: La selección de las columnas con los nombres correspondientes está en línea **1**.
sv: Val av kolumner med motsvarande namn finns på rad **1**.

source: The view is prepared with the column names that pgRouting use.
es: La vista se prepara con los nombres de columna que pgRouting utiliza.
sv: Vyn är förberedd med de kolumnnamn som pgRouting använder.

source: There is no need to rename columns. (line **3**)
es: No es necesario cambiar el nombre de las columnas. (línea **3**)
sv: Det finns inget behov av att byta namn på kolumner. (rad **3**)
