Repository: pgRouting/workshop
Catalog: locale/*/LC_MESSAGES/basic/graphs.po
Languages: es, sv

source: The OSM identifiers of the departure and destination are used. (line **4**)
es: Se utilizan los identificadores OSM del punto de partida y del destino. (línea **4**)
sv: OSM-identifierarna för avgång och destination används. (rad **4**)

source: For ``taxi_net``:
es: Para ``taxi_net``:
sv: För ``taxi_net``:

source: Similar as the previous one but with ``taxi_net``. (line **3**)
es: Similar al anterior pero con ``taxi_net`` (línea **3**)
sv: Liknande som den föregående men med ``taxi_net``. (rad **3**)

source: The results give the same route as with ``vehicle_net`` but ``cost`` is higher.
es: Los resultados dan la misma ruta que con ``vehicle_net`` pero ``cost`` es mayor.
sv: Resultatet ger samma rutt som med ``vehicle_net`` men ``cost`` är högre.

source: For ``walk_net``:
es: Para ``walk_net``:
sv: För ``walk_net``:

source: Similar as the previous one but with ``walk_net``. (line **3**)
es: Similar al anterior pero con ``walk_net``. (línea **3**)
sv: Liknande som den föregående men med ``walk_net``. (rad **3**)

source: The results give a different route than of the vehicles.
es: Los resultados dan una ruta diferente a la de los vehículos.
sv: Resultaten ger en annan rutt än fordonens.
