Repository: pgRouting/workshop
Catalog: locale/*/LC_MESSAGES/basic/pedestrian.po
Languages: es, sv

source: Pedestrian Routing
es: Enrutamiento peatonal
sv: Routning av fotgängare

source: **pgRouting** was first called *pgDijkstra*, because it implemented only shortest path search with *Dijkstra* algorithm. Later other functions were added and the library was renamed to pgRouting.
es: **pgRouting** se llamó por primera vez *pgDijkstra*, porque implementó sólo la búsqueda de ruta más corta con el algoritmo *Dijkstra*. Más tarde se agregaron otras funciones y se cambió el nombre de la biblioteca a pgRouting.
sv: **pgRouting** kallades först för *pgDijkstra*, eftersom det endast implementerade sökning efter kortaste vägen med *Dijkstra*-algoritmen. Senare lades andra funktioner till och biblioteket döptes om till pgRouting.

source: Chapter Contents
es: Contenido del Capítulo
sv: Kapitelinnehåll

source: Dijkstra algorithm was the first algorithm implemented in pgRouting. It doesn't require other attributes than the identifiers ``id``, ``source`` and ``target`` and the weights ``cost`` and ``reverse_cost``.
es: El algoritmo Dijkstra fue el primer algoritmo implementado en pgRouting. No requiere otros atributos más que los identificadores ``id``, ``source`` y ``target`` y los valores ``cost`` y ``reverse_cost``.
sv: Dijkstra-algoritmen var den första algoritmen som implementerades i pgRouting. Den kräver inga andra attribut än identifierarna ``id``, ``källa`` och ``mål`` samt vikterna ``kostnad`` och ``omvända_kostnader``.

source: You can specify when to consider the graph as `directed <https://en.wikipedia.org/wiki/Directed_graph>`__ or undirected.
es: Puede especificar cuándo considerar el grafo como `dirigido <https://en.wikipedia.org/wiki/Directed_graph>`__ o sin dirección.
sv: Du kan ange när grafen ska betraktas som "riktad" <https://en.wikipedia.org/wiki/Directed_graph>`__ eller "oriktad".

source: Signature Summary
es: Resumen de funciones
sv: Sammanfattning av signatur

source: Description of the function can be found in `pgr_dijkstra <https://docs.pgrouting.org/latest/en/pgr_dijkstra.html>`__.
es: La descripción de la función se puede encontrar en `pgr_dijkstra <https://docs.pgrouting.org/latest/en/pgr_dijkstra.html>`__.
sv: Beskrivning av funktionen finns i `pgr_dijkstra <https://docs.pgrouting.org/latest/en/pgr_dijkstra.html>`__.

source: Many pgRouting functions have ``sql::text`` as one of their arguments. While this may look confusing at first, it makes the functions very flexible as the user can pass a ``SELECT`` statement as function argument as long as the returned result contains the required number of attributes and the correct attribute names.
es: Muchas funciones pgRouting tienen ``sql::text`` como uno de sus argumentos. Aunque esto puede parecer confuso al principio, hace que las funciones sean muy flexibles, ya que el usuario puede pasar una instrucción ``SELECT`` como argumento de función siempre y cuando el resultado devuelto contenga el número necesario de atributos y los nombres correctos.
sv: Många pgRouting-funktioner har ``sql::text`` som ett av sina argument. Även om detta kan verka förvirrande i början gör det funktionerna mycket flexibla eftersom användaren kan skicka en ``SELECT``-sats som funktionsargument så länge det returnerade resultatet innehåller det antal attribut som krävs och de korrekta attributnamnen.

source: Most of pgRouting implemented algorithms do not require the **geometry**.
es: La mayoría de los algoritmos implementados pgRouting no requieren la **geometría**.
sv: De flesta av pgRoutings implementerade algoritmer kräver inte **geometri**.

source: The pgRouting functions **do not** return a geometry, but only an ordered list of nodes or edges.
es: Las funciones pgRouting **no** devuelven una geometría, sino solo una lista ordenada de nodos o aristas.
sv: PgRouting-funktionerna **returnerar** inte en geometri, utan endast en ordnad lista över noder eller kanter.

source: Identifiers for the Queries
es: Identificadores de las consultas
sv: Identifierare för frågorna

source: The assignment of the vertices identifiers on the source and target columns may be different, the following exercises will use the results of this query. For the workshop, some locations near of the FOSS4G event are going to be used. These locations are within this area https://www.openstreetmap.org/#map=14/-1.44228/-48.46069
es: La asignación de los identificadores de vértices en las columnas de origen y destino puede ser diferentes, los siguientes ejercicios usarán los resultados de esta consulta. Para el taller, se van a utilizar algunos lugares cercanos al evento FOSS4G. Estas ubicaciones se encuentran dentro de esta área https://www.openstreetmap.org#map=14/-1.44228/-48.46069
sv: Tilldelningen av topparnas identifierare på käll- och målkolumnerna kan vara olika, följande övningar kommer att använda resultaten av denna fråga. För workshopen kommer några platser i närheten av FOSS4G-evenemanget att användas. Dessa platser ligger inom detta område https://www.openstreetmap.org/#map=14/-1.44228/-48.46069

source: Connect to the database, if not connected:
es: Conéctese a la base de datos, si no está conectado:
sv: Anslut till databasen, om den inte är ansluten:

source: Get the vertex identifiers
es: Obtener los identificadores de vértice
sv: Hämta toppunktsidentifierare

source: The corresponding :code:`id` are shown in the following image, and a sample route from "|place_3|" to "|place_5|".
es: El correspondiente :code:`id` se muestra en la siguiente imagen y una ruta de ejemplo de "|place_3|" a "|place_5|".
sv: Motsvarande :code:`id` visas i följande bild, och ett exempel på en rutt från "|place_3|" till "|place_5|".

source: Exercise 1: Single pedestrian routing
es: Ejercicio 1: Ruteo para un solo peatón
sv: Övning 1: Routning av enstaka fotgängare

source: Problem:
es: Problema:

source: Walking
es: Caminando
sv: Går

source: from "|place_1|"
es: desde "|place_1|"
sv: från "|place_1|"

source: to "|place_3|".
es: hacia "|place_3|".
sv: till "|place_3|".

source: Calculate routes with costs in *osm2pgRouting* `length` default units.
es: Calcular rutas con costos en longitud con unidades por defecto generadoa por *osm2pgRouting*.

source: From the |place_1| to the |place_3|
es: Desde el |place_1| al |place_3|
sv: Från |place_1 till |place_3|

source: Solution:
es: Solución:
sv: Lösning:

source: The pedestrian wants to go from vertex |id_1| to vertex |id_3| (lines **9** and **10**).
es: El peatón quiere pasar del vértice |id_1| al vértice |id_3| (líneas **9** y **10**).
sv: Fotgängaren vill gå från toppunkt |id_1| till toppunkt |id_3| (raderna **9** och **10**).

source: The pedestrian's cost is in terms of length. In this case ``length`` (line **6**), which was calculated by osm2pgrouting, is in unit ``degrees``.
es: El costo del peatón es en términos de longitud. En este caso ``length`` (línea **6**), que fue calculada por osm2pgrouting, está en la unidad ``degrees``.
sv: Fotgängarens kostnad är i termer av längd. I detta fall är ``längd`` (rad **6**), som beräknades av osm2pgrouting, i enheten ``degrees``.

source: From a pedestrian perspective the graph is ``undirected`` (line **11**), that is, the pedestrian can move in both directions on all segments.
es: Desde una perspectiva peatonal, el grafo es ``no dirigido`` (línea **11**), es decir, el peatón puede moverse en ambas direcciones en todos los segmentos.
sv: Ur fotgängarens perspektiv är grafen ``undirected`` (linje **11**), det vill säga fotgängaren kan röra sig i båda riktningarna på alla segment.

source: The returned cost attribute represents the cost specified in the inner SQL query (``edges_sql::text`` argument). In this example cost is ``length`` in unit "degrees". Cost may be time, distance or any combination of both or any other attributes or a custom formula.
es: El atributo de costo devuelto representa el costo especificado en la consulta SQL interna (argumento ``edges_sql::text``). En este ejemplo, el costo es ``length`` en la unidad "grados". El costo puede ser tiempo, distancia o cualquier combinación de ambos o cualquier otro atributo o una fórmula personalizada.
sv: Det returnerade kostnadsattributet representerar den kostnad som anges i den inre SQL-frågan (argumentet ``edges_sql::text``). I detta exempel är kostnaden ``längd`` i enheten "grader". Kostnaden kan vara tid, avstånd eller en kombination av båda eller något annat attribut eller en anpassad formel.

source: ``node`` and ``edge`` results may vary depending on the assignment of the identifiers to the vertices given by osm2pgrouting.
es: Los resultados de ``node`` y ``edge`` pueden variar dependiendo de la asignación de los identificadores a los vértices dados por osm2pgrouting.
sv: resultaten för "nod" och "kant" kan variera beroende på tilldelningen av identifierare till topparna som ges av osm2pgrouting.

source: Exercise 2: Many Pedestrians going to the same destination
es: Ejercicio 2: Muchos peatones van al mismo destino
sv: Övning 2: Många fotgängare på väg till samma destination

source: from "|place_1|" and "|place_2|"
es: desde "|place_1|" y "|place_2|"
sv: från "|place_1|" och "|place_2|"

source: to the "|place_3|".
es: hacia el "|place_3|".
sv: till "|place_3|".

source: Calculate routes with costs in *osm2pgRouting* ``length_m`` which is in meters.
es: Calcula rutas con costos, provenientes de *osm2pgRouting*, en metros usando ``length_m``.
sv: Beräkna rutter med kostnader i *osm2pgRouting* ``length_m`` som är i meter.

source: From |place_1| and |place_2| to |place_3|
es: Desde |place_1| y |place_2| a |place_3|
sv: Från |place_1| och |place_2| till |place_3|

source: The pedestrians are departing at vertices |id_1| and |id_2| (line **9**).
es: Los peatones están saliendo en los vértices |id_1| y |id_2| (línea **9**).
sv: Fotgängarna avgår vid hörnen |id_1| och |id_2| (rad **9**).

source: All pedestrians want to go to vertex |id_3| (line **10**).
es: Todos los peatones quieren ir al vértice |id_3| (línea **10**).
sv: Alla fotgängare vill gå till toppunkt |id_3| (rad **10**).

source: The cost to be in meters using attribute ``length_m`` (line **6**).
es: El costo de estar en metros usando el atributo ``length_m`` (línea **6**).
sv: Kostnaden ska vara i meter med attributet ``length_m`` (rad **6**).

source: Exercise 3: Many Pedestrians departing from the same location
es: Ejercicio 3: Muchos peatones que salen de la misma ubicación
sv: Övning 3: Många fotgängare som avgår från samma plats

source: from "|place_3|"
es: desde "|place_3|"
sv: från "|place_3|"

source: to "|place_1|" and "|place_2|"
es: hacia "|place_1|" y "|place_2|"
sv: till "|place_1|" och "|place_2|"

source: Calculate routes with costs in seconds.
es: Calcular rutas con costos en segundos.
sv: Beräkna rutter med kostnader på några sekunder.

source: All pedestrians are departing from vertex |id_3| (line **9**).
es: Todos los peatones están saliendo del vértice |id_3| (línea **9**).
sv: Alla fotgängare avgår från toppunkt |id_3| (rad **9**).

source: Pedestrians want to go to locations |id_1| and |id_2| (line **10**).
es: Los peatones quieren ir a lugares |id_1| y |id_2| (línea **10**).
sv: Fotgängare vill gå till platserna |id_1| och |id_2| (rad **10**).

source: The cost to be in seconds, with a walking speed ``s = 1.3 m/s`` and ``t = d/s`` (line **6**).
es: El costo a ser en segundos, con una velocidad de marcha ``s = 1.3 m/s`` y ``t = d/s`` (línea **6**).
sv: Kostnaden ska vara i sekunder, med en gånghastighet ``s = 1,3 m/s`` och ``t = d/s`` (rad **6**).

source: Exercise 4: Many Pedestrians going to different destinations
es: Ejercicio 4: Muchos peatones que van a diferentes destinos
sv: Övning 4: Många fotgängare på väg till olika destinationer

source: to "|place_4|" and "|place_5|"
es: hacia "|place_4|" y "|place_5|"
sv: till "|place_4|" och "|place_5|"

source: Calculate routes with costs in minutes.
es: Calcular rutas con costos en minutos.
sv: Beräkna rutter med kostnader på några minuter.

source: The pedestrians depart from |id_1| and |id_2| (line **9**).
es: Los peatones parten de |id_1| y |id_2| (línea **9**).
sv: Fotgängarna avgår från |id_1| och |id_2| (rad **9**).

source: The pedestrians want to go to destinations |id_4| and |id_5| (line **10**).
es: Los peatones quieren ir a destinos |id_4| y |id_5| (línea **10**).
sv: Fotgängarna vill åka till destinationerna |id_4| och |id_5| (rad **10**).

source: The cost to be in minutes, with a walking speed ``s = 1.3 m/s`` and ``t = d/s`` (line **6**).
es: El costo a ser en minutos, con una velocidad de caminata ``s = 1.3 m/s`` y ``t = d/s`` (línea **6**).
sv: Kostnaden ska vara i minuter, med en gånghastighet ``s = 1,3 m/s`` och ``t = d/s`` (rad **6**).

source: Result adds the costs per destination.
es: El resultado suma los costes por destino.
sv: Resultat lägger till kostnaderna per destination.

source: Inspecting the results, looking for totals (edge = -1):
es: Inspección de los resultados, buscando totales (`edge = -1`):
sv: Kontrollerar resultaten och letar efter totalsummor (edge = -1):

source: From 20297 to vertex 6548 takes 92.58 minutes (seq = 147)
es: Desde 20297 al vértice 6548 toma 92.58 minutos (seq = 147)
sv: Från 20297 till toppunkt 6548 tar det 92,58 minuter (seq = 147)

source: From 20297 to vertex 12712 takes 83.18 minutes (seq = 267)
es: Desde 20297 al vértice 12712 toma 83.18 minutos (seq = 267)
sv: Från 20297 till toppunkt 12712 tar det 83,18 minuter (seq = 267)

source: From 23872 to vertex 6548 takes 76.26 minutes (seq = 385)
es: Desde 23872 al vértice 6548 toma 76.26 minutos (seq = 385)
sv: Från 23872 till toppunkt 6548 tar det 76,26 minuter (seq = 385)

source: From 23872 to vertex 12712 takes 67.76 minutes (seq = 495)
es: Desde 23872 al vértice 12712 toma 67.76 minutos (seq = 495)
sv: Från 23872 till toppunkt 12712 tar det 67,76 minuter (seq = 495)

source: Exercise 5: Combination of routes
es: Ejercicio 5: Combinación de rutas
sv: Övning 5: Kombination av rutter

source: First pedestrian goes from "|place_1|" to "|place_4|"
es: El primer peatón va desde "|place_1|" hacia "|place_4|"
sv: Den första fotgängaren går från "|place_1|" till "|place_4|"

source: Second pedestrian goes from "|place_2|" to "|place_5|"
es: El segundo peatón va de "|place_2|" hacia "|place_5|"
sv: Den andra fotgängaren går från "|place_2|" till "|place_5|"

source: First pedestrian departs from |id_1| and the destination is |id_4| (line **11**).
es: El primer peatón sale de |id_1| y el destino es |id_4| (línea **11**).
sv: Första fotgängaren avgår från |id_1| och destinationen är |id_4| (rad **11**).

source: Second pedestrian departs from |id_2| and the destination is |id_5| (line **12**).
es: El segundo peatón sale de |id_2| y el destino es |id_5| (línea **12**).
sv: Den andra fotgängaren avgår från |id_2| och destinationen är |id_5| (rad **12**).

source: The cost to be in minutes, with a walking speed ``s = 1.3 m/s`` and ``t = d/s``
es: El costo a ser en minutos, con una velocidad de caminata ``s = 1.3 m/s`` y ``t = d/s``
sv: Kostnaden ska vara i minuter, med gånghastigheten ``s = 1,3 m/s`` och ``t = d/s``

source: When the main goal is to calculate the total cost, without "inspecting" the `pgr_dijkstra` results, using ``pgr_dijkstraCost`` returns a more compact result.
es: Cuando el objetivo principal es calcular el costo total, sin "inspeccionar" los resultados de la `pgr_dijkstra` usando ``pgr_dijkstraCost`` devuelve un resultado más compacto.
sv: När huvudsyftet är att beräkna den totala kostnaden, utan att "inspektera" `pgr_dijkstra`-resultaten, ger ``pgr_dijkstraCost`` ett mer kompakt resultat.

source: Description of the parameters can be found in `pgr_dijkstraCost <https://docs.pgrouting.org/latest/en/pgr_dijkstraCost.html#description-of-the-signatures>`__
es: La descripción de los parámetros se puede encontrar en `pgr_dijkstraCost <https://docs.pgrouting.org/latest/en/pgr_dijkstraCost.html#description-of-the-signatures>`__
sv: Beskrivning av parametrarna finns i `pgr_dijkstraCost <https://docs.pgrouting.org/latest/en/pgr_dijkstraCost.html#description-of-the-signatures>`__

source: Exercise 6: Time for many Pedestrians going to different destinations
es: Ejercicio 6: Tiempo para muchos peatones que van a diferentes destinos
sv: Övning 6: Tid för många fotgängare som ska till olika destinationer

source: from "|place_1|" or "|place_2|"
es: desde "|place_1|" o "|place_2|"
sv: från "|place_1|" eller "|place_2|"

source: to "|place_4|" or "|place_5|"
es: desde "|place_4|" o "|place_5|"
sv: till "|place_4|" eller "|place_5|"

source: Get only the cost in minutes.
es: Obtener solo el costo en minutos.
sv: Få bara kostnaden på några minuter.

source: From the hotels to the |place_4| and |place_5|
es: De los hoteles a |place_4| y |place_5|
sv: Från hotellen till |place_4| och |place_5|

source: Result as aggregated costs.
es: Resultado como costos agregados.
sv: Resultat som aggregerade kostnader.

source: Compare with `Exercise 4: Many Pedestrians going to different destinations`_ 's note.
es: Compárese con las notas del `Ejercicio 4: Muchos peatones que van a diferentes destinos`_.
sv: Jämför med `Exercise 4: Many Pedestrians going to different destinations`_-anteckning.

source: Exercise 7: Many Pedestrians going to different destinations summarizing the total costs per departure
es: Ejercicio 7: Muchos peatones que van a diferentes destinos resumiendo los costos totales por salida
sv: Övning 7: Många fotgängare som ska till olika destinationer sammanfattar de totala kostnaderna per avgång

source: Summarize cost in minutes.
es: Reportar costos en minutos.
sv: Sammanfatta kostnaden i minuter.

source: The cost to be in minutes, with a walking speed s = 1.3 m/s and t = d/s (line **6**).
es: El costo a ser en minutos, con una velocidad de caminata s = 1.3 m/s y t = d/s (línea **6**).
sv: Kostnaden ska vara i minuter, med en gånghastighet s = 1,3 m/s och t = d/s (rad **6**).

source: An interpretation of the result can be: In general, it is faster to depart from "Instituto Federal do Pará, Campus Belém" than from "Hangar Convention Center"
es: Una interpretación del resultado puede ser: En general, es más rápido salir de "Instituto Federal do Pará, Campus Belém" que de "Hangar Convention Center"
sv: En tolkning av resultatet kan vara: I allmänhet är det snabbare att avgå från "Instituto Federal do Pará, Campus Belém" än från "Hangar Convention Center"

source: Dijkstra algorithm was the first algorithm implemented in pgRouting. It doesn't require other attributes than ``id``, ``source`` and ``target`` ID and ``cost`` and ``reverse_cost``.
es: El algoritmo Dijkstra fue el primer algoritmo implementado en pgRouting. No requiere otros atributos más que los identificadores ``id``, ``source`` y ``target`` y los pesos ``cost`` y ``reverse_cost``.

source: Description of the parameters can be found in `pgr_dijkstra <https://docs.pgrouting.org/latest/en/pgr_dijkstra.html#description-of-the-signatures>`__.
es: La descripción de los parámetros se puede encontrar en `pgr_dijkstra <https://docs.pgrouting.org/latest/en/pgr_dijkstra.html#description-of-the-signatures>`__.

source: The assignment of the vertices identifiers on the source and target columns may be different, the following exercises will use the results of this query. For the workshop, some locations near of the FOSS4G event are going to be used. These locations are within this area https://www.openstreetmap.org#map=15/-34.5847/-58.3970
es: La asignación de los identificadores de vértices en las columnas de origen y destino puede ser diferentes, los siguientes ejercicios usarán los resultados de esta consulta. Para el taller, se van a utilizar algunos lugares cercanos al evento FOSS4G. Estas ubicaciones se encuentran dentro de esta área https://www.openstreetmap.org#map=15/-34.5847/-58.3970

source: From 3770 to vertex 5912 takes 26.22 minutes (seq = 94)
es: Desde 3770 al vértice 5912 toma 26.22 minutos (seq = 94)

source: From 3770 to vertex 3829 takes 7.11 minutes (seq = 48)
es: Desde 3770 al vértice 3829 toma 7.11 minutos (seq = 48)

source: From 2592 to vertex 5912 takes 8.31 minutes (seq = 33)
es: Desde 2592 al vértice 5912 toma 8.31 minutos (seq = 33)

source: From 2592 to vertex 3829 takes 12.56 minutes (seq = 20)
es: Desde 2592 al vértice 3829 toma 12.56 minutos (seq = 20)

source: Exercise 5: Many Pedestrians going to different destinations returning aggregate costs
es: Ejercicio 5: Muchos peatones que van a diferentes destinos devolviendo costos agregados

source: The pedestrians depart from |id_1| and |id_2| (line **10**).
es: Los peatones parten de |id_1| y |id_2| (línea **10**).

source: The pedestrians want to go to destinations |id_4| and |id_5| (line **11**).
es: Los peatones quieren ir a destinos |id_4| y |id_5| (línea **11**).

source: The cost to be in minutes, with a walking speed ``s = 1.3 m/s`` and ``t = d/s`` (line **7**).
es: El costo a ser en minutos, con una velocidad de caminata ``s = 1.3 m/s`` y ``t = d/s`` (línea **7**).

source: Exercise 6: Many Pedestrians going to different destinations summarizing the total costs per departure
es: Ejercicio 6: Muchos peatones van a diferentes destinos resumiendo costos totales por salida

source: The cost to be in minutes, with a walking speed s = 1.3 m/s and t = d/s (line **7**).
es: El costo a ser en minutos, con una velocidad de caminata s = 1.3 m/s y t = d/s (línea **7**).

source: An interpretation of the result can be: In general, it is faster to depart from "Qendra Sprotive" than from "Nadir Xhemali Danijolli"
es: Una interpretación del resultado puede ser: En general, es más rápido salir de "Qendra Sprotive" que de "Nadir Xhemali Danijolli"

source: Calculate routes with costs in *osm2pgRouting* ``length`` default units.
sv: Beräkna rutter med kostnader i *osm2pgRouting* ``längd`` standard enheter.

source: pgr_dijkstraCost
sv: pgr_dijkstraKostnad
