Repository: pgRouting/workshop
Catalog: locale/*/LC_MESSAGES/basic/plpgsql_function.po
Languages: es, sv

source: Use with default value of ``do_debug``.
es: Utilizar con el valor predeterminado de ``do_debug``.
sv: Används med standardvärdet för ``do_debug``.

source: Use with ``do_debug`` set to ``true``.
es: Utilizar con ``do_debug`` establecido en ``true``.
sv: Använd med ``do_debug`` satt till ``true``.

source: Store results on a table.
es: Almacene los resultados en una tabla.
sv: Spara resultaten i en tabell.

source: Show the table contents.
es: Mostrar el contenido de la tabla.
sv: Visa innehållsförteckningen.

source: The function is not meant to be used with ``ways``
es: La función no está destinada a ser utilizada con ``formas``
sv: Funktionen är inte avsedd att användas med ``ways``

source: The first parameter is the table name. (line **2**)
es: El primer parámetro es el nombre de la tabla. (línea **2**)

source: The next two parameters are the latitude and longitude of the departure point. (line **3**)
es: Los dos siguientes dos parámetros son la latitud y longitud del punto de partida. (línea **3**)

source: The next two parameters are the latitude and longitude of the destination point. (line **4**)
es: Los dos siguientes dos parámetros son la latitud y longitud del punto de destino. (línea **4**)

source: Similar to previous solution, but with ``taxi_net`` (line **2**)
es: Similar a la solución anterior, pero con ``taxi_net`` (línea **2**)

source: Adding ``true`` to get the query that is executed. (line **5**)
es: Agregar ``true`` para obtener la consulta que se ejecuta. (línea **5**)

source: Similar to a previous solution, but with ``ways`` (line **4**)
es: Similar a una solución anterior, pero con ``ways`` (línea **4**)

source: Store results on a table. (line **2**)
es: Almacene los resultados en una tabla. (línea **2**)

source: Show the table contents using a ``SELECT`` clause (lines **8** and **9**).
es: Mostrar el contenido de la tabla mediante una cláusula ``SELECT`` (líneas **8** y **9**).

source: :ref:`**Exercise**: 7 (**Chapter:** pl/pgsql)`
es: :ref:`**Ejercicio**: 7 (**Capítulo:** pl/pgsql)`

source: Returns a route that includes a geometry so that if can be displayed, for example, in QGIS.
sv: Returnerar en rutt som innehåller en geometri så att den kan visas i t.ex. QGIS.

source: NUMERIC
sv: NUMERISK

source: The latitude of the `departure` point.
sv: Latitud för avgångspunkten.

source: The longitude of the `departure` point.
sv: Longitud för avgångspunkten.

source: The latitude of the `destination` point.
sv: Latitud för den punkt som är `destination`.

source: The longitude of the `destination` point.
sv: Longituden för den punkt som är `destination`.

source: The Vertices Table
sv: Tabellen Vertices

source: Graphs have a `set of edges` and a `set of vertices` associated to it. The views need their vertices table.
sv: Grafer har en "uppsättning kanter" och en "uppsättning hörn" associerade till sig. Vyerna behöver sin vertices-tabell.

source: Exercise 1: Create vertices table
sv: Övning 1: Skapa en tabell med hörnpunkter

source: Create a vertices table for the views:
sv: Skapa en vertices-tabell för vyerna:

source: Use ``pgr_extractVertices`` (explained in :doc:`graph_views`) to create the vertices table
sv: Använd ``pgr_extractVertices`` (förklaras i :doc:`graph_views`) för att skapa tabellen med hörnpunkter

source: ``JOIN`` the vertices table with ``ways_vertices`` (created in :doc:`graph_views`) to get the ``x``, ``y``, ``geom`` information.
sv: ``JOIN`` vertices tabellen med ``ways_vertices`` (skapad i :doc:`graph_views`) för att få ``x``, ``y``, ``geom`` information.

source: Modify the above queries to create the ``walk_net_vertices`` table.
sv: Modifiera ovanstående frågor för att skapa tabellen ``walk_net_vertices``.

source: It is left to the reader to remove disconected components on the views.
sv: Det är upp till läsaren att ta bort borttagna komponenter på vyerna.

source: See :doc:`graph_views`
sv: Se :doc:`graph_views`

source: Calculate the (OSM) identifier of the nearest vertex to a point.
sv: Beräkna (OSM)-identifieraren för det närmaste toppunktet till en punkt.

source: In particular use the following (lat, lon) value: ``(-1.455829, -48.446044)``.
sv: Använd i synnerhet följande (lat, lon)-värde: ``(-1,455829, -48,446044)``.

source: Remember that the ``id`` has an OSM vertex identifier on the vertices tables.
sv: Kom ihåg att ``id`` har en OSM-vertexidentifierare på vertices-tabellerna.

source: Using the Postgis distance operator `<-> <https://postgis.net/docs/geometry_distance_knn.html>`__ to order by distance.
sv: Använd Postgis distansoperator `<-> <https://postgis.net/docs/geometry_distance_knn.html>`__ för att beställa efter avstånd.

source: Get only the first row, to obtain the nearest identifier of the vertex.
sv: Hämta bara den första raden för att få den närmaste identifieraren för toppunktet.

source: For ``ways_vertices``:
sv: För ``ways_vertices``:

source: For ``vehicle_net_vertices``:
sv: För ``vehicle_net_vertices``:

source: Modify the previous query.
sv: Ändra den tidigare förfrågan.

source: For ``taxi_net_vertices``:
sv: För ``taxi_net_vertices``:

source: For ``walk_net_vertices``:
sv: För ``walk_net_vertices``:

source: Function name: ``wrk_nearest``.
sv: Funktionsnamn: ``wrk_nearest``.

source: The function returns only one ``BIGINT`` value.
sv: Funktionen returnerar endast ett ``BIGINT``-värde.

source: Using `format <https://www.postgresql.org/docs/12/functions-string.html#FUNCTIONS-STRING-FORMAT>`__ to build the query.
sv: Använda `format <https://www.postgresql.org/docs/12/functions-string.html#FUNCTIONS-STRING-FORMAT>`__ för att bygga upp frågan.

source: The structure of the query is similar to `Exercise 3: Nearest Vertex`_ solutions.
sv: Frågans struktur liknar `Exercise 3: Nearest Vertex`_ lösningar.

source: ``%1$I`` for the table name identifier.
sv: ``%1$I`` för identifieraren av tabellnamnet.

source: The point is formed with (lon/lat) ``(%3$s, %2$s)``.
sv: Punkten bildas med (lon/lat) ``(%3$s, %2$s)``.

source: Nearest Vertex in vehicle network
sv: Närmaste vertex i fordonsnätverket

source: Nearest Vertex in taxi network
sv: Närmaste toppunkt i taxinätverket

source: Nearest Vertex in walk network
sv: Närmaste vertex i promenadnätverk

source: Test the ``wrk_Nearest`` function.
sv: Testa funktionen ``wrk_Nearest``.

source: Use the following (lat,lon) values: ``(-1.455829, -48.446044)``.
sv: Använd följande (lat,lon)-värden: ``(-1.455829, -48.446044)``.

source: The point is the same as in `Exercise 3: Nearest Vertex`_ problem.
sv: Poängen är densamma som i `Övning 3: Närmaste vertex`_ problem.

source: Use the function with ``ways_vertices`` as the ``vertex_table`` parameter.
sv: Använd funktionen med ``ways_vertices`` som parameter för ``vertex_table``.

source: Pass the (lat,lon) values as second and third parameters.
sv: Skicka (lat,lon)-värdena som andra och tredje parameter.

source: For ``vehicles_net_vertices``:
sv: För ``vehicles_net_vertices``:

source: In this section, creation and testing the required function will be tackled.
sv: I detta avsnitt behandlas skapande och testning av den funktion som krävs.

source: Follow the description given at `Requirements for routing from A to B`_.
sv: Följ beskrivningen i avsnittet `Krav på rutten från A till B`_.

source: Use specialized functions:
sv: Använd specialiserade funktioner:

source: ``wrk_NearestOSM`` created on `Exercise 4: Nearest vertex function`_.
sv: ``wrk_NearestOSM`` skapad på `Övning 4: Närmaste vertexfunktion`_.

source: ``wrk_dijkstra`` created in :doc:`sql_function`
sv: ``wrk_dijkstra`` skapad i :doc:`sql_function`

source: The input parameters highlighted.
sv: Inmatningsparametrarna markeras.

source: The output columns are not highlighted.
sv: Utdatakolumnerna är inte markerade.

source: The function returns a set of values.
sv: Funktionen returnerar en uppsättning värden.

source: Call to the function ``wrk_dijkstra``
sv: Anrop till funktionen ``wrk_dijkstra``

source: Using PostgreSQL ``format`` to make substitutions
sv: Använda PostgreSQL ``format`` för att göra utbyten

source: The first parameter is the string to be replaced
sv: Den första parametern är den sträng som ska ersättas

source: The rest are the data parameters, are the strings use for replacement.
sv: Resten är dataparametrarna, det är strängarna som används för ersättning.

source: ``wrk_dijkstra`` obtains the values for the output
sv: ``wrk_dijkstra`` erhåller värdena för utdata

source: The ``edges_subset`` value will replace ``%1$I``:
sv: Värdet ``edges_subset`` kommer att ersätta ``%1$I``:

source: For the ``source`` and ``target``:
sv: För ``source`` och ``target``:

source: ``wrk_Nearest`` is used to find the identifier.
sv: ``wrk_Nearest`` används för att hitta identifieraren.

source: The vertices table name is formed with ``%1$I_vertices``.
sv: Tabellnamnet för vertices bildas med ``%1$I_vertices``.

source: ``lat1``, ``lon1`` values will replace ``%2$s, %3$s`` respectively.
sv: värdena ``lat1``, ``lon1`` kommer att ersätta ``%2$s, %3$s`` respektive.

source: ``lat2``, ``lon2`` values will replace ``%4$s, %5$s`` respectively.
sv: värdena ``lat2``, ``lon2`` kommer att ersätta ``%4$s, %5$s`` respektive.

source: The ``WARNING`` will be issued only when ``do_debug`` is true.
sv: ``WARNING`` kommer endast att utfärdas när ``do_debug`` är sant.

source: No output will be generated.
sv: Ingen utdata kommer att genereras.

source: Departure point is: (lat,lon) = ``(-1.455829, -48.446044)``
sv: Avgångspunkten är: (lat,lon) = ``(-1.455829, -48.446044)``

source: Destination point is: (lat,lon) = ``(-1.453448, -48.447142)``
sv: Destinationspunkten är: (lat,lon) = ``(-1,453448, -48,447142)``

source: The first parameter is the table name.
sv: Den första parametern är tabellnamnet.

source: The next two parameters are the latitude and longitude of the departure point.
sv: De två följande parametrarna är latitud och longitud för avgångspunkten.

source: The next two parameters are the latitude and longitude of the destination point.
sv: De två följande parametrarna är latitud och longitud för destinationspunkten.

source: Do a dry run by adding ``true`` to get the query that is executed.
sv: Gör en testkörning genom att lägga till ``true`` för att få den fråga som körs.
