Repository: pgRouting/workshop
Catalog: locale/*/LC_MESSAGES/basic/plpgsql_function.po
Languages: es, sv

source: pl/pgsql function
es: Función pl/pgsql
sv: pl/pgsql-funktion

source: Other kind of functions are `pl/pgsql <https://www.postgresql.org/docs/current/plpgsql.html>`__. As the applications requirements become more complex, using wrappers of previously defined functions becomes necessary for clarity.
es: Otro tipo de funciones son `pl/pgsql <https://www.postgresql.org/docs/current/plpgsql.html>`__. A medida que los requisitos de las aplicaciones se vuelven más complejos, el uso de contenedores de funciones previamente definidas se hace necesario para mayor claridad.
sv: Andra typer av funktioner är `pl/pgsql <https://www.postgresql.org/docs/current/plpgsql.html>`__. När applikationskraven blir mer komplexa blir det nödvändigt att använda omslag för tidigare definierade funktioner för tydlighetens skull.

source: Chapter contents
es: Contenido del capítulo
sv: Kapitelinnehåll

source: Requirements for routing from A to B
es: Requisitos para el ruteo de A a B
sv: Krav för routing från A till B

source: Chapter problem:
es: Problema del capítulo:
sv: Kapitelproblem:

source: Create a function ``wrk_fromAtoB`` that allows routing from 2 geometries.
es: Cree una función ``wrk_fromAtoB`` que permita el ruteo desde 2 geometrías.
sv: Skapa en funktion ``wrk_fromAtoB`` som tillåter routing från 2 geometrier.

source: The function takes latitude/longitude points as input parameters.
es: La función toma los puntos de latitud/longitud como parámetros de entrada.
sv: Funktionen tar latitud/longitudpunkter som inparametrar.

source: Returns a route that includes a geometry so that if can be displayed, for example, in QGIS.
es: Devuelve una ruta que incluye una geometría para que si se puede mostrar, por ejemplo, en QGIS.

source: Will also return some other attributes.
es: También devolverá algunos otros atributos.
sv: Kommer också att returnera några andra attribut.

source: The detailed description:
es: La descripción detallada:
sv: Den detaljerade beskrivningen:

source: Input parameters
es: Parámetros de entrada
sv: Parametrar för inmatning

source: Column
es: Columna
sv: Kolumn

source: type
es: tipo
sv: typ

source: Description
es: Descripción
sv: Beskrivning

source: Edge table name identifier.
es: Identificador de nombre de tabla perimetral.
sv: Identifierare för namn på kanttabell.

source: The latitude of the `departure` point.
es: La latitud del punto de `partida`.

source: The longitude of the `departure` point.
es: La longitud del punto de `partida`

source: The latitude of the `destination` point.
es: La latitud del punto de `destino`.

source: The longitude of the `destination` point.
es: La longitud del punto de `destino`.

source: Flag to create a ``WARNING`` with the query that is been executed
es: Marcar para crear una ``ADVERTENCIA`` con la consulta que se ha ejecutado
sv: Flagga för att skapa en ``WARNING`` med den fråga som körs

source: Output columns
es: Columnas de resultados
sv: Utgångskolumner

source: For ordering purposes.
es: Para fines ordenamiento
sv: För beställningsändamål.

source: The edge identifier that can be used to JOIN the results to the ``ways`` table.
es: Identificador de bordes que se puede utilizar para unir los resultados a la tabla ``ways``.
sv: Den edge-identifierare som kan användas för att JOINNA resultaten till tabellen ``ways``.

source: The street name.
es: El nombre de la calle.
sv: Gatunamnet.

source: Between start and end node of an edge.
es: Entre el nodo inicial y final de una arista.
sv: Mellan start- och slutnod för en kant.

source: In meters.
es: En metros.
sv: I meter.

source: Minutes taken to traverse the segment.
es: Minutos tomados para atravesar el segmento.
sv: Minuter det tar att korsa segmentet.

source: The road geometry with corrected directionality.
es: La geometría de la carretera con direccionalidad corregida.
sv: Väggeometri med korrigerad riktningsverkan.

source: For this chapter, the following points will be used for testing.
es: Para este capítulo, se utilizarán los siguientes puntos para las pruebas.
sv: För detta kapitel kommer följande punkter att användas för testning.

source: Saving this information on a table:
es: Guardar esta información en una tabla:

source: The ``X`` value of a geometry is the longitude.
es: El valor ``X`` de una geometría es la longitud.

source: The ``Y`` value of a geometry is the latitude.
es: El valor ``Y`` de una geometría es la latitud.

source: Natural language to form the point is ``(latitude, longitude)``.
es: El lenguaje natural para formar el punto es ``(latitud, longitud)``.

source: For geometry processing to form the point is ``(longitude, latitude)``.
es: Para que el procesamiento de geometría forme el punto es ``(longitud, latitud)``.

source: lines **4** and **6** show the inverse order of the (lat,lon) pairs.
es: líneas **4** y **6** muestran el orden inverso de los pares (lat,lon).

source: The Vertex Table
es: La Tabla de Vértices

source: Graphs have a `set of edges` and a `set of vertices` associated to it.
es: Los grafos tienen un `conjunto de aristas` y un `conjunto de vértices` asociados a él.

source: `osm2pgrouting` provides the `ways_vertices_pgr` table which is associated with the `ways` table.
es: `osm2pgrouting` proporciona la tabla `ways_vertices_pgr`, asociada a la tabla `formas`.

source: When a subset of `edges` is used like in ``vehicle_net`` or in ``taxi_net``, the set of vertices associated to each one must be used in order to, for example, locate the nearest vertex to a lat/lon location.
es: Cuando se utiliza un subconjunto de `edges` como en ``vehicle_net`` or in ``taxi_net`` se debe utilizar el conjunto de vértices asociados a cada una para, por ejemplo, localizar el vértice más cercano a una ubicación lat/lon.

source: Exercise 1: Number of vertices
es: Ejercicio 1: Número de vértices

source: Problem
es: Problema

source: Calculate the number of vertices in a graph.
es: Calcular el número de vértices en un grafo.

source: Depending on the graph calculate the number of vertices of:
es: Dependiendo del grafo calcular el número de vértices de:

source: Solution
es: Solución
sv: Lösning

source: For ``ways``:
es: Para ``ways``

source: `osm2pgrouting` automatically created the ``ways_vertices_pgr`` table that contains all the vertices in ``ways`` table.
es: `osm2pgrouting` creó automáticamente la tabla ``ways_vertices_pgr`` que contiene todos los vértices en la tabla ``ways``.

source: Using `aggregate function <https://www.postgresql.org/docs/current/functions-aggregate.html>`__ ``count``. (line **1**)
es: Uso de la `función agregada <https://www.postgresql.org/docs/current/functions-aggregate.html>`__ ``count``. (line **1**)

source: Count all the rows of ``ways_vertices_pgr`` table. (line **2**)
es: Cuente todas las filas de la tabla ``ways_vertices_pgr``. (line **2**)

source: For ``vehicle_net``:
es: Para ``vehicle_net``:
sv: För ``vehicle_net``:

source: Extract the vertices identifiers of the ``source`` column. (line **3**)
es: Extraiga los identificadores de vértices de la columna ``fuente``. (línea **3**)

source: Extract the vertices identifiers of the ``target`` column. (line **8**)
es: Extraiga los identificadores de vértices de la columna ``target``. (línea **8**)

source: `UNION <https://www.postgresql.org/docs/current/typeconv-union-case.html>`__ both results (line **6**)
es: `UNIÓN <https://www.postgresql.org/docs/current/typeconv-union-case.html>`__ de ambos resultados (línea **6**)

source: For ``taxi_net``:
es: Para ``taxi_net``:
sv: För ``taxi_net``:

source: Similar solution as in previous query but on ``taxi_net``. (lines **4** and **9**)
es: Solución similar a la de la consulta anterior pero en ``taxi_net``. (líneas **4** y **9**)

source: For ``walk_net``:
es: Para ``walk_net``:
sv: För ``walk_net``:

source: Similar solution as in previous query but on ``walk_net``. (lines **4** and **9**)
es: Solución similar a la de la consulta anterior pero en ``walk_net``. (líneas **4** y **9**)

source: :ref:`**Exercise**: 1 (**Chapter:** pl/pgsql)`
es: :ref:`**Ejercicio**: 1 (**Capítulo:** pl/pgsql)`

source: Exercise 2: Vertices on a table
es: Ejercicio 2: Vértices en una tabla

source: Create a vertices table.
es: Crear una tabla de vértices.

source: Follow the suffix naming ``_vertices_pgr``.
es: Siga el sufijo que nombra ``_vertices_pgr``.

source: Depending on the graph create a vertices table of:
es: Dependiendo del grafo cree una tabla de vértices de:

source: The vertices table should contain:
es: La tabla de vértices debe contener:

source: OSM Identifier of the vertex.
es: Identificador de OSM del vértice.

source: The geometry of the vertex.
es: La geometría del vértice.

source: The vertices are already on a table.
es: Los vértices ya se encuentran en una tabla.

source: The table suffix follows is as requested.
es: El sufijo de tabla que sigue es el solicitado.

source: There is no need to create a table.
es: No es necesario crear una tabla.

source: The source and target columns are in terms of ``id`` column of ``ways_vertices_pgr``
es: Las columnas de origen y destino son en términos de columna ``id`` de ``ways_vertices_pgr``

source: Using the query ``id_list`` from :ref:`Exercise 1: Number of vertices`. (not highlighted lines **2** to **8**)
es: Uso de la consulta ``id_list`` de :ref:`Ejercicio 1: Número de vértices`. (líneas no resaltadas **2** a **8**)

source: ``JOIN`` with ``ways_vertices_pgr`` that has the OSM identifier and the geometry information. (line **13**)
es: ``JOIN`` con ``ways_vertices_pgr`` que tiene el identificador OSM y la información de geometría. (línea **13**)

source: Extract the ``osm_id`` and ``the_geom``. (line **10**)
es: Extraer el ``osm_id`` y ``the_geom``. (línea **10**)

source: Save in table ``vehicle_net_vertices_pgr``. (line **11**)
es: Guardar en la tabla ``vehicle_net_vertices_pgr``. (línea **11**)

source: The source and target columns values have the ``osm_id`` therefore the ``id`` column of ``vehicle_net_vertices_pgr`` must also have the ``osm_id`` values
es: Los valores de las columnas de origen y destino tienen los valores ``sm_id``, por lo tanto, la columna ``id`` de ``vehicle_net_vertices_pgr`` también debe tener los valores ``osm_id``.

source: Similar solution as in previous query but on ``taxi_net``. (lines **3**, **8** and **11**)
es: Solución similar a la de la consulta anterior pero en ``taxi_net``. (líneas **3**, **8** y **11**)

source: :ref:`**Exercise**: 2 (**Chapter:** pl/pgsql)`
es: :ref:`**Ejercicio**: 2 (**Capítulo:** pl/pgsql)`

source: Exercise 3: Nearest Vertex
es: Ejercicio 3: Vértice más cercano
sv: Övning 3: Närmaste toppunkt

source: Calculate the OSM identifier of the nearest vertex to a point.
es: Calcule el identificador OSM del vértice más cercano a un punto.

source: In particular use the following (lat,lon) value: ``(-34.59, -58.4112)``.
es: En particular, utilice el siguiente valor (lat,lon): ``(-34.59, -58.4112)``.

source: calculate the nearest OSM identifier of the vertex to:
es: calcular el identificador OSM más cercano del vértice a:
sv: beräkna den närmaste OSM-identifieraren för vertexen till:

source: The ``ways`` and the ``ways_vertices_pgr`` tables are not used on the **final applications**
es: Las tablas ``ways`` y ``ways_vertices_pgr`` no se utilizan en las **aplicaciones finales**

source: The *net* views and *vertices* tables have been prepared in such a way that the ``AS`` statement is not needed any more on a pgRouting function.
es: Las vistas *net* y las tablas *vértices* se han preparado de tal manera que la instrucción ``AS`` ya no se necesita en una función pgRouting.

source: For ``ways_vertices_pgr``:
es: Para ``ways_vertices_pgr``:

source: Get the osm_id. (line **1**)
es: Obtener la osm_id. (línea **1**)

source: Using the distance operator `<-> <https://postgis.net/docs/geometry_distance_knn.html>`__ to order by distance. (line **3**)
es: Usando el operador de distancia `<-> <https://postgis.net/docs/geometry_distance_knn.html>`__ para ordenar por distancia (línea **3**)

source: Get only the first row, to obtain the nearest OSM identifier of the vertex. (line **4**)
es: Obtenga solo la primera fila para obtener el identificador de OSM más cercano del vértice. (línea **4**)

source: For ``vehicle_net_vertices_pgr``:
es: Para``vehicle_net_vertices_pgr``:

source: Similar solution as in previous query but:
es: Solución similar a la de la consulta anterior, pero:

source: Extracting the ``id`` columns. (line **1**)
es: Extracción de las columnas ``id``. (línea **1**)

source: On ``vehicle_net_vertices_pgr``. (line **2**)
es: En ``vehicle_net_vertices_pgr``. (línea **2**)

source: For ``taxi_net_vertices_pgr``:
es: Para ``taxi_net_vertices_pgr``:

source: Similar solution as in previous query but on ``taxi_net_vertices_pgr``. (line **2**)
es: Solución similar a la de la consulta anterior pero en ``taxi_net_vertices_pgr``. (línea **2**)

source: For ``walk_net_vertices_pgr``:
es: Para ``walk_net_vertices_pgr``:

source: Similar solution as in previous query but on ``walk_net_vertices_pgr``. (line **2**)
es: Solución similar a la de la consulta anterior pero en ``walk_net_vertices_pgr``. (línea **2**)

source: :ref:`**Exercise**: 3 (**Chapter:** pl/pgsql)`
es: :ref:`**Ejercicio**: 3 (**Capítulo:** pl/pgsql)`

source: Exercise 4: Nearest vertex function
es: Ejercicio 4: Función de vértice más cercano
sv: Övning 4: Funktion för närmaste toppunkt

source: When operations look similar for different tables, a function can be created.
es: Cuando las operaciones se ven similares para diferentes tablas, se puede crear una función.
sv: När operationer ser likadana ut för olika tabeller kan en funktion skapas.

source: Create a function that calculates the OSM identifier of the nearest vertex to a point.
es: Cree una función que calcule el identificador OSM del vértice más cercano a un punto.
sv: Skapa en funktion som beräknar OSM-identifieraren för det närmaste toppunktet till en punkt.

source: Function name: ``wrk_NearestOSM``.
es: Nombre de la función: ``wrk_NearestOSM``.

source: Needs to work only for the **final application** views and table.
es: Solo tiene que funcionar para las vistas y la tabla **aplicación final**.
sv: Behöver bara fungera för **slutgiltig ansökan** vyer och tabell.

source: The input parameters:
es: Los parámetros de entrada:
sv: Inmatningsparametrarna:

source: Table name identifier.
es: Identificador de nombre de tabla.
sv: Identifierare för tabellnamn.

source: The latitude of a point.
es: La latitud de un punto.
sv: Latitud för en punkt.

source: The longitude of a point.
es: La longitud de un punto
sv: Longituden för en punkt.

source: The output:
es: La salida:
sv: Utdata:

source: the OSM identifier that is nearest to (lat,lon).
es: el identificador OSM más cercano a (lat,lon).
sv: den OSM-identifierare som ligger närmast (lat,lon).

source: The function returns only one value. (line **5**)
es: La función devuelve solo un valor. (línea **5**)

source: Using `format <ihttps://www.postgresql.org/docs/12/functions-string.html#FUNCTIONS-STRING-FORMAT>`__ to build the query. (line **10**)
es: Usando `formato <ihttps://www.postgresql.org/docs/12/functions-string.html#FUNCTIONS-STRING-FORMAT>`__ para construir la consulta. (línea **10**)

source: The structure of the query is similar to :ref:`Exercise 3: Nearest Vertex` solutions. (lines **12** to **16**)
es: La estructura de la consulta es similar a las soluciones :ref:`Ejercicio 3: Vértice más cercano`. (líneas **12** a **16**)

source: ``%1$I`` for the table name identifier. (line **13**)
es: ``%1$I`` para el identificador de nombre de tabla. (línea **13**)

source: ``%2$s`` and ``%3$s`` for the latitude and longitude.
es: ``%2$s`` y ``%3$s`` para la latitud y longitud.
sv: ``%2$s`` och ``%3$s`` för latitud och longitud.

source: The point is formed with (lon/lat) ``(%3$s, %2$s)``. (line **15**)
es: El punto se forma con (lon/lat) ``(%3$s, %2$s)``. (línea **15**)

source: The additional parameters of function ``format``, are the parameters of the function we are creating. (line **19**)
es: Los parámetros adicionales de la función ``format``, son los parámetros de la función que estamos creando. (línea **19**)

source: :ref:`**Exercise**: 4 (**Chapter:** pl/pgsql)`
es: :ref:`**Ejercicio**: 4 (**Capítulo:** pl/pgsql)`

source: Exercise 5: Test nearest vertex function
es: Ejercicio 5: Prueba de la función vértice más cercano
sv: Övning 5: Testa funktionen för närmaste toppunkt

source: Test the ``wrk_NearestOSM`` function.
es: Pruebe la función ``wrk_NearestOSM``.

source: In particular use the following (lat,lon) values: ``(-34.59, -58.4112)``.
es: En particular, utilice los siguientes valores (lat,lon): ``(-34.59, -58.4112)``.

source: The point is the same as in :ref:`Exercise 3: Nearest Vertex` problem.
es: El punto es el mismo que en :ref:`Ejercicio 3: Vértice más cercano`.

source: Verify the results are the same.
es: Compruebe que los resultados son los mismos.
sv: Kontrollera att resultatet blir detsamma.

source: Use the function with ``ways_vertices_pgr`` as the ``vertex_table`` parameter. (line **2**)
es: Utilizar la función con ``ways_vertices_pgr`` como parámetro ``vertex_table``. (línea **2**)

source: Pass the (lat,lon) values as second and third parameters. (line **3**)
es: Pasar los valores (lat,lon) como segundo y tercer parámetro. (línea **3**)

source: Using the function on the original data does not return the OSM identifier.
es: El uso de la función en los datos originales no devuelve el identificador de OSM.
sv: Om du använder funktionen på originaldata returneras inte OSM-identifieraren.

source: The value stored in ``id`` column is not the OSM identifier.
es: El valor almacenado en la columna ``id`` no es el identificador de OSM.
sv: Värdet som lagras i kolumnen ``id`` är inte OSM-identifieraren.

source: For ``vehicles_net_vertices_pgr``:
es: Para ``vehicles_net_vertices_pgr``:

source: Similar solution as in previous query but on ``vehicles_net_vertices_pgr``. (lines **2**)
es: Solución similar a la de la consulta anterior pero en ``vehicles_net_vertices_pgr``. (líneas **2**)

source: Similar solution as in previous query but on ``taxi_net_vertices_pgr``. (lines **2**)
es: Solución similar a la de la consulta anterior pero en ``taxi_net_vertices_pgr``. (líneas **2**)

source: Similar solution as in previous query but on ``walk_net_vertices_pgr``. (lines **2**)
es: Solución similar a la de la consulta anterior pero en ``walk_net_vertices_pgr``. (líneas **2**)

source: :ref:`**Exercise**: 5 (**Chapter:** pl/pgsql)`
es: :ref:`**Ejercicio**: 5 (**Capítulo:** pl/pgsql)`

source: wrk_fromAtoB function
es: función wrk_fromAtoB
sv: wrk_fromAtoB funktion

source: In this section, creation and testing the requiered function will be tackled.
es: En esta sección, se abordará la creación y prueba de la función resonada.

source: Exercise 6: Creating the main function
es: Ejercicio 6: Creación de la función principal
sv: Övning 6: Skapa huvudfunktionen

source: Create the function ``wrk_fromAtoB``.
es: Crear la función ``wrk_fromAtoB``.
sv: Skapa funktionen ``wrk_fromAtoB``.

source: Follow the description given at :ref:`Requirements for routing from A to B`.
es: Siga la descripción dada en :ref:`Requisitos para el ruteo de A a B`.

source: Use specialized functions already created ``wrk_dijkstra`` and ``wrk_NearestOSM``.
es: Utilice funciones especializadas ya creadas ``wrk_dijkstra`` y ``wrk_NearestOSM``.

source: ``wrk_NearestOSM`` created on :ref:`Exercise 4: Nearest vertex function`.
es: ``wrk_NearestOSM`` creado en :ref:`Ejercicio 4: Función de vértice más cercano`.

source: It receives the point in natural language format.
es: Recibe el punto en formato de lenguaje natural.
sv: Den tar emot punkten i naturligt språkformat.

source: Obtains the OSM identifier needed by ``wrk_dijkstra``.
es: Obtiene el identificador OSM necesario por ``wrk_dijkstra``.
sv: Erhåller den OSM-identifierare som behövs av ``wrk_dijkstra``.

source: ``wrk_dijkstra`` created on Chapter 7 :ref:`Exercise 10: Function for an application`.
es: ``wrk_dijkstra`` creado en el Capítulo 7 :ref:`Ejercicio 10: Función para una aplicación`.

source: The function's signature:
es: Firma de la función:
sv: Funktionens signatur:

source: The input parameters highlited on lines **2** to **5**.
es: Los parámetros de entrada se resaltan en las líneas **2** a **5**.

source: The output columns are not higlighted on lines **7** to **13**.
es: Las columnas de salida no se resaltan en las líneas **7** a **13**.

source: The function returns a set of values. (line **15**)
es: La función devuelve un conjunto de valores. (línea **15**)

source: The function's body:
es: Cuerpo de la función:
sv: Funktionens kropp:

source: Call to the function ``wrk_dijkstra`` (line **8**)
es: Llamada a la función ``wrk_dijkstra`` (línea **8**)

source: ``wrk_dijkstra`` obtains many of the result values
es: ``wrk_dijkstra`` obtiene muchos de los valores de resultados

source: Parameters are passed on lines **9** to **13**.
es: Los parámetros se pasan en las líneas **9** a **13**.

source: The ``edges_subset``:
es: Los ``edges_subset``:

source: First parameters of the ``format`` function is the table name. (line **16**)
es: Los primeros parámetros de la función ``format`` es el nombre de la tabla. (línea **16**)

source: Is passed as ``%1$I``. (line **9**)
es: Se pasa como ``%1$I``. (línea **9**)

source: For the `departure` point:
es: Para el punto de `salida`:

source: ``wrk_NearestOSM`` is used to find the OSM identifier. (line **10**)
es: ``wrk_NearestOSM`` se utiliza para encontrar el identificador OSM. (línea **10**)

source: The vertices table name is formed with ``%1$I_vertices_pgr``. (line **11**)
es: El nombre de la tabla de vértices se forma con ``%1$I_vertices_pgr``. (línea **11**)

source: Second and third parameters of the ``format`` function are ``%2$s``, ``%3$s``. (line **17**)
es: Los parámetros segundo y tercero de la función ``formato`` son ``%2$s``, ``%3$s``. (línea **17**)

source: The latitude and longitude are given in natural language form. (line **12**)
es: La latitud y la longitud se dan en forma de lenguaje natural. (línea **12**)

source: For the `destination` point:
es: Para el punto de `destino`:

source: Similar query is constructed but with the destination information. (line **13**)
es: Se construye una consulta similar pero con la información de destino. (línea **13**)

source: Fourth and fifth parameters of the ``format`` function. (line **18**)
es: Cuarto y quinto parámetros de la función `formato`. (línea **18**)

source: To get the constructed query in form of a warning:
es: Para obtener la consulta construida en forma de advertencia:
sv: Att få den konstruerade frågan i form av en varning:

source: The ``WARNING`` will be issued only when ``do_debug`` is true. (lines **20** to **22**)
es: La ``ADVERTENCIA`` se emitirá sólo cuando ``do_debug`` sea cierto. (líneas **20** a **22**)

source: :ref:`**Exercise**: 6 (**Chapter:** pl/pgsql)`
es: :ref:`**Ejercicio**: 6 (**Capítulo:** pl/pgsql)`

source: Exercise 7: Using the main function
es: Ejercicio 7: Uso de la función principal
sv: Övning 7: Använda huvudfunktionen

source: View of roads for taxis along with source and destination
es: Vista de las calles para taxis junto con el origen y el destino
sv: Visning av vägar för taxibilar tillsammans med källa och destination

source: Use ``wrk_fromAtoB``
es: Usar ``wrk_fromAtoB``
sv: Använd ``wrk_fromAtoB``

source: Departure point is: (lat,lon) = ``(-34.59, -58.4112)``
es: El punto de partida es: (lat,lon) = ``(-34.59, -58.4112)``

source: Destination point is: (lat,lon) = ``(-34.5850, -58.4077)``
es: El punto de destino es: (lat,lon) = ``(-34.5850, -58.4077)``
