Repository: pgRouting/workshop
Catalog: locale/*/LC_MESSAGES/basic/sql_function.po
Languages: es

source: SQL function
es: Función SQL

source: Chapter Contents
es: Contenido del Capítulo

source: pgRouting functions provide `low level` interface.
es: Las funciones pgRouting proporcionan una interfaz de `bajo nivel`.

source: When developing for a `higher level` application, the requirements need to be represented in the SQL queries. As these SQL queries get more complex, it is desirable to store them in postgreSQL stored procedures or functions. Stored procedures or functions are an effective way to wrap application logic, in this case, related to routing logic and requirements.
es: Al desarrollar para una aplicación de `nivel superior`, los requisitos deben estar representados en las consultas SQL. A medida que estas consultas SQL se vuelven más complejas, es conveniente almacenarlas en funciones o procedimientos almacenados de postgreSQL. Los procedimientos o funciones almacenados son una forma eficaz de envolver la lógica de la aplicación, en este caso, relacionada con la lógica y los requisitos de ruteo.

source: The application requirements
es: Los requisitos de aplicación

source: In this chapter there are three requirements that follow the same logic. It consists on 2 types of vehicles and the pedestrian routing:
es: En este capítulo hay tres requisitos que siguen la misma lógica. Consta de 2 tipos de vehículos y el trazado peatonal:

source: Particular vehicle:
es: Vehículo en particular:

source: Circulate on the whole Buenos Aires area. - Do not use `steps`, `footway`, `path`.
es: Circular por toda la zona de Buenos Aires. - No usar `steps`, `footway`, `path`.

source: Speed is the default speed from OSM information.
es: La velocidad es la velocidad predeterminada de la información de OSM.

source: Taxi vehicle:
es: Vehículo Taxi:

source: Circulate on a smaller area near "|place_4|".
es: Circular en un área más pequeña cerca de "|place_4|".

source: Bounding box: ``(-58.41,-34.58,-58.37,-34.55)``
es: Cuadro delimitador: ``(-58.41,-34.58,-58.37,-34.55)``

source: Do not use `steps`, `footway`, `path`
es: No usar `steps`, `footway`, `path`

source: Speed is 10% slower than the Particular vehicles.
es: La velocidad es 10% más lenta que la de los vehículos Particulares.

source: Pedestrians:
es: Peatones:

source: Walk on the whole Buenos Aires area.
es: Caminar en toda el área de Buenos Aires.

source: Can not circulate on `motorways` and on `primary` segments.
es: No se puede circular en `autopistas` ni en segmentos `primarios`.

source: The speed is ``2 mts/sec``.
es: La velocidad es de ``2 mts/sec``.

source: A front end needs the following routing information:
es: Una interfaz necesita la siguiente información de ruteo:

source: seq - A unique identifier of the rows
es: seq - Un identificador único de las filas.

source: gid - The segment's identifier
es: gid - El identificador del segmento

source: name - The segment's name
es: name - El nombre del segmento

source: length - The segment's length
es: length - La longitud del segmento

source: seconds - Number of seconds to traverse the segment
es: seconds - Número de segundos para atravesar el segmento

source: azimuth - The azimuth of the segment
es: azimuth - El azimuth del segmento

source: route_geom - The routing geometry
es: route_geom - La geometría del ruteo

source: route_readable - The geometry in human readable form.
es: route_readable - La geometría en forma humanamente legible.

source: and it needs to work based on the graph, and the OSM identifiers of the vertices.
es: y necesita trabajar en función del grafo y los identificadores OSM de los vértices.

source: Design of the function
es: Diseño de la función

source: The function to be created ``wrk_dijkstra`` with the following input parameters and output columns:
es: La función ``wrk_dijkstra`` se creará con los siguientes parámetros de entrada y columnas de salida:

source: Input parameters
es: Parámetros de entrada

source: Name
es: Nombre

source: Type
es: Tipo

source: Description
es: Descripción

source: The table/view that is going to be used for processing
es: La tabla/vista que se utilizará para procesar

source: The OSM identifier of the `departure` location.
es: El identificador OSM de la ubicación de la `salida`.

source: The OSM identifier of the `destination` location.
es: El identificador OSM de la ubicación del `destino`.

source: output columns
es: columnas de salida

source: A unique number for each result row.
es: Un único número para cada fila de resultados

source: The edge identifier.
es: El identificador de arista

source: The name of the segment.
es: El nombre del segmento.

source: The number of seconds it takes to traverse the segment.
es: El número de segundos que se tarda en atravesar el segmento.

source: The azimuth of the segment.
es: El azimuth del segmento.

source: The leng in meters of the segment.
es: Longitud en metros del segmento.

source: The geometry in human readable form.
es: La geometría en forma humanamente legible.

source: The geometry of the segment in the correct direction.
es: La geometría del segmento en la dirección correcta.

source: Preparing processing graphs
es: Preparación de grafos de procesamiento

source: Exercise 1: Creating a view for routing
es: Ejercicio 1: Creación de una vista para el ruteo

source: View of roads for vehicles
es: Vista de carreteras para vehículos

source: Problem
es: Problema

source: Create a view with minimal amount of information for processing the particular vehicles.
es: Cree una vista con una cantidad mínima de información para procesar los vehículos en particular.

source: Routing `cost` and `reverse_cost` will be on seconds for routing calculations.
es: El costo de ruteo en `cost` y `reverse_cost` será en segundos para los cálculos de ruteo.

source: Exclude `steps`, `footway`, `path` segments.
es: Excluir los segmentos de `camino peatonal`, `senda`, `caminitos`

source: Data needed in the view for further prossesing.
es: Datos necesarios en la vista para su posterior procesamiento.

source: `length_m` The length in meters.
es: `length_m` La longitud en metros.

source: `the_geom` The geometry.
es: `the_geom` La geometría|.

source: Verify the number of edges was reduced.
es: Comprobar que se ha reducido el número de aristas.

source: Solution
es: Solución

source: Creating the view:
es: Creación de la vista:

source: The `source` and `target` requirements for the function are to be with OSM identifiers. (line **6**)
es: Los requisitos de `source` and `target` para la función deben ser con identificadores OSM. (línea **6**)

source: The ``cost`` and ``reverse_cost`` are in terms of seconds. (line **7**)
es: ``cost`` y ``reverse_cost`` son en términos de segundos. (línea **7**)

source: The additional parameters `length_m` and `the_geom`. (line **8**)
es: Los parámetros adicionales `length_m` y `the_geom`. (línea **8**)

source: ``JOIN`` with the `configuration`:
es: ``JOIN`` con `configuration`:

source: Exclude `steps`, `footway`, `path`. (line **11**)
es: Excluir `pasos`, `senda`, `recorrido`. (línea **11**)

source: If you need to reconstruct the view, first drop it using the command on line **1**.
es: Si necesita reconstruir la vista, primero borrarla usando el comando en línea **1**.

source: Verification:
es: Verificación:

source: Count the rows on the original ``ways`` (line **1**)
es: Contar las filas en los ``caminos`` originales (línea **1**)

source: Count the rows on the view ``vehicle_net`` (line **2**)
es: Contar las filas en la vista ``vehicle_net`` (línea **2**)

source: Exercise 2: Limiting the road network within an area
es: Ejercicio 2: Limitar la red viaria dentro de un área

source: View of smaller set of roads for vehicles
es: Vista de un conjunto más pequeño de carreteras para vehículos

source: Create a view ``taxi_net`` for the `taxi`:
es: Cree una vista ``taxi_net`` para el `taxi`:

source: The taxi can only circulate inside this Bounding Box: ``(-58.41,-34.58,-58.37,-34.55)``
es: El taxi solo puede circular dentro de este delimitador: ``(-58.41,-34.58,-58.37,-34.55)``

source: The taxi speed is 10% slower than the particular vehicle.
es: La velocidad del taxi es un 10% más lenta que el vehículo en particular.

source: Verify the reduced number of road segments.
es: Verifique el número reducido de segmentos de carretera.

source: The graph for the taxi is a subset of the ``vehicle_net`` graph. (line **9**)
es: El grafo del taxi es un subconjunto del grafo ``vehicle_net``. (línea **9**)

source: Can only circulate inside the bounding box: ``(-58.41,-34.58,-58.37,-34.55)``. (line **10**)
es: Sólo puede circular dentro del cuadro delimitador: ``(-58.41,-34.58,-58.37,-34.55)``. (línea **10**)

source: Adjust the taxi's ``cost`` and ``reverse_cost`` to be 90% of the particular vehicle. (line **7**)
es: Ajuste el ``cost`` y ``reverse_cost`` del taxi para que sea el 90% del vehículo en particular. (línea **7**)

source: Count the rows on the original ``taxi_net``
es: Cuente las filas en el ``taxi_net`` original.

source: Exercise 3: Creating a materialized view for routing pedestrians
es: Ejercicio 3: Creación de una vista materializada para ruteo de los peatones

source: Create a materialized view with minimal amount of information for processing pedestrians.
es: Crear una vista materializada con una cantidad mínima de información para procesar peatones.

source: Exclude `motorway` and `primary` segments.
es: Excluir segmentos `de autopista` y `primarios`.

source: Similar to `Exercise 1: Creating a view for routing`_:
es: Similar a `Ejercicio 1: Creación de una vista para el ruteo`_:

source: The ``cost`` and ``reverse_cost`` are in terms of seconds with speed of ``2 mts/sec``. (line **7**)
es: ``cost`` y ``reverse_cost`` se expresan en términos de segundos con velocidad de ``2 mts/sec``. (línea **7**)

source: Exclude `motorway`, `primary`. (line **11**)
es: Excluir `autopista`, `primaria`. (línea **11**)

source: Count the rows on the view ``walk_net`` (line **1**)
es: Cuente las filas de la vista ``walk_net`` (line **1**)

source: Exercise 4: Testing the views for routing
es: Ejercicio 4: Probar las vistas para el ruteo

source: From the Venue to the hotel using the osm_id.
es: Desde la sede hasta el hotel utilizando el `osm_id`.

source: Test the created views
es: Pruebe las vistas creadas

source: In particular:
es: En particular:

source: From the "|place_3|" to the "|place_1|" using the OSM identifier
es: Desde "|place_3|" hacia "|place_1|" usando el identificador OSM

source: the views to be tested are:
es: las vistas a probar son:

source: Only show the following results, as the other columns are to be ignored on the function.
es: Mostrar únicamente los siguientes resultados, ya que las demás columnas deben omitirse en la función.

source: ``edge`` with the name ``id``
es: ``edge`` con el nombre ``id``

source: ``cost`` with the name: ``seconds``
es: ``cost`` con el nombre: ``seconds``

source: In general
es: En general

source: The departure is "|place_3|" with OSM identifier |osmid_3|.
es: El punto de partida es "|place_3|" con el identificador OSM |osmid_3|.

source: The destination is "|place_1|" with OSM identifier |osmid_1|.
es: El destino es "|place_1|" con el identificador OSM |osmid_1|.

source: For ``vehicle_net``:
es: Para ``vehicle_net``:

source: ``vehicle_net`` is used.
es: Se utiliza ``vehicle_net``.

source: Selection of the columns with the corresponding names are on line **1**.
es: La selección de las columnas con los nombres correspondientes está en línea **1**.

source: The view is prepared with the column names that pgRouting use.
es: La vista se prepara con los nombres de columna que pgRouting utilizan.

source: There is no need to rename columns. (line **3**)
es: No es necesario cambiar el nombre de las columnas. (línea **3**)

source: The OSM identifiers of the departure and destination are used. (line **4**)
es: Se utilizan los identificadores OSM del punto de partida y del destino. (línea **4**)

source: For ``taxi_net``:
es: Para ``taxi_net``:

source: Similar as the previous one but with ``taxi_net``. (line **3**)
es: Similar al anterior pero con ``taxi_net`` (línea **3**)

source: The results give the same route as with ``vehicle_net`` but ``cost`` is higher
es: Los resultados dan la misma ruta que con ``vehicle_net`` pero ``cost`` es mayor

source: For ``walk_net``:
es: Para ``walk_net``:

source: Similar as the previous one but with ``walk_net``. (line **3**)
es: Similar al anterior pero con ``walk_net``. (línea **3**)

source: The results give a different route than of the vehicles.
es: Los resultados dan una ruta diferente a la de los vehículos.

source: From these queries, it can be deduced that what we design for one view will work for the other views. On the following exercises only ``vehicle_net`` will be used, but you can test the queries with the other views.
es: De estas consultas, se puede deducir que lo que diseñamos para una vista funcionará para las otras vistas. En los siguientes ejercicios solo se usará ``vehicle_net``, pero puede probar las consultas con las otras vistas.

source: Exercise 5: Get additional information
es: Ejercicio 5: Obtener información adicional

source: Route showing names
es: Ruta que muestra nombres

source: From the |place_3| to the |place_1|, using OSM identifiers.
es: Desde |place_3| hasta |place_1|, utilizando identificadores OSM.

source: additionally to the `Exercise 4: Testing the views for routing`_ results also get information found on the edges subset:
es: además de `Ejercicio 4: Probar las vistas para el ruteo`_ resultados también obtienen información que se encuentra en el subconjunto de bordes:

source: The query from `Exercise 4: Testing the views for routing`_ used as a subquery named ``results`` (not highlighted lines **5** to **9**)
es: La consulta de `Ejercicio 4: Probar las vistas para el ruteo`_ se utiliza como una subconsulta denominada ``results`` (no líneas resaltadas **5** a **9**)

source: The ``SELECT`` clause contains
es: La cláusula ``SELECT`` contiene

source: All the columns of ``results``. (line **2**)
es: Todas las columnas de ``results``. (línea **2**)

source: The ``name`` and the ``length_m`` values. (line **3**)
es: Los valores ``name`` y ``length_m``. (línea **3**)

source: A ``LEFT JOIN`` with ``vehicle_net`` is needed to get the additional information. (line **10**)
es: Se necesita un ``LEFT JOIN`` con ``vehicle_net`` para obtener la información adicional. (línea **10**)

source: Has to be ``LEFT`` because there is a row with ``id = -1`` that does not exist on ``vehicle_net``
es: Tiene que ser ``LEFT`` porque hay una fila con ``id = -1`` que no existe en ``vehicle_net``

source: Geometry handling
es: Manejo de geometría

source: Exercise 6: Route geometry (human readable)
es: Ejercicio 6: Geometría de la ruta (legible para humanos)

source: From the Venue to the Brewry
es: De la sede a la cervecería

source: From the "|place_3|" to the "|place_1|", additionally get the geometry in human readable form.
es: Desde "|place_3|" hasta "|place_1|", además, se obtiene la geometría en forma legible por humanos.

source: Additionally to the `Exercise 4: Testing the views for routing`_ results also get information found on the edges subset of:
es: Además de `Ejercicio 4: Probar las vistas para el ruteo`_ resultados también obtener información encontrada en el subconjunto de bordes de:

source: ``the_geom`` in human readable form named as ``route_readable``
es: ``the_geom`` en forma legible por humanos nombrado como ``route_readable``

source: ``WITH`` provides a way to write auxiliary statements in larger queries. It can be thought of as defining temporary tables that exist just for one query.
es: ``WITH`` proporciona una manera de escribir instrucciones auxiliares en consultas más grandes. Se puede considerar como la definición de tablas temporales que existen solo para una consulta.

source: The query from `Exercise 4: Testing the views for routing`_ used as a subquery named ``results`` this time in a WITH clause. (not highlighted lines **2** to **6**)
es: La consulta de `Ejercicio 4: Probar las vistas para el ruteo`_ se utiliza como una subconsulta denominada ``results`` esta vez en una cláusula WITH. (líneas no resaltadas **2** a **6**)

source: The ``SELECT`` clause contains:
es: La cláusula ``SELECT`` contiene:

source: All the columns of ``results``. (line **8**)
es: Todas las columnas de ``results``. (línea **8**)

source: The ``the_geom`` processed with ``ST_AsText`` to get the human readable form. (line **9**)
es: El ``the_geom`` procesado con ``ST_AsText`` para obtener la forma legible por humanos. (línea **9**)

source: Renames the result to ``route_readable``
es: Cambia el nombre del resultado a ``route_readable``

source: Like before ``LEFT JOIN`` with ``vehicle_net``. (line **11**)
es: Como antes ``LEFT JOIN`` con ``vehicle_net``. (línea **11**)

source: Exercise 7: Route geometry (binary format)
es: Ejercicio 7: Geometría de ruta (formato binario)

source: From |place_3| to the |place_1| showing arrows.
es: Desde |place_3| al |place_1| mostrando flechas.

source: From the "|place_3|" to the "|place_1|", the geometry in binary format.
es: Desde "|place_3|" hasta "|place_1|", la geometría en formato binario.

source: ``the_geom`` in binary format with the name ``route_geom``
es: ``the_geom`` en formato binario con el nombre ``route_geom``

source: The query from `Exercise 6: Route geometry (human readable)`_ used;
es: La consulta de `Ejercicio 6: Geometría de la ruta (legible para humanos)`_ utilizada;

source: The ``the_geom`` including the renaming (line **9**)
es: ``the_geom``, incluido el cambio de nombre (línea **9**)

source: Exercise 8: Route geometry directionality
es: Ejercicio 8: Direccionalidad de la geometría de la ruta

source: From |place_3| to the |place_1|
es: Desde |place_3| al |place_1|

source: Inspecting the detail image of `Exercise 7: Route geometry (binary format)`_ there are arrows that do not match the directionality of the route.
es: Inspeccionando la imagen detallada de `Ejercicio 7: Geometría de ruta (formato binario)`_ hay flechas que no coinciden con la direccionalidad de la ruta.

source: detail
es: detalle

source: Inspecting the a detail of the results of `Exercise 6: Route geometry (human readable)`_
es: Inspeccionar el detalle de los resultados de `Ejercicio 6: Geometría de la ruta (legible para humanos)`_

source: To have correct directionality, the ending point of a geometry must match the starting point of the next geometry
es: Para tener una direccionalidad correcta, el punto final de una geometría debe coincidir con el punto inicial de la geometría siguiente

source: Lines **2** and **3** do not match that criteria
es: Las líneas **2** y **3** no coinciden con ese criterio

source: From the "|place_3|" to the "|place_1|",
es: Desde "|place_3|" hasta "|place_1|",

source: Both columns must have the geometry fixed for directionality.
es: Ambas columnas deben tener la geometría corregida para la direccionalidad.

source: To get the correct direction some geometries need to be reversed:
es: Para obtener la dirección correcta, algunas geometrías deben invertirse:

source: Reversing a geometry will depend on the ``node`` column of the query to dijkstra (line **3**)
es: Invertir una geometría dependerá de la columna ``node`` de la consulta a dijkstra (línea **3**)

source: That ``node`` is not needed on the ouput of the query, so explicitly naming required columns at line **9**.
es: Ese ``nodo`` no es necesario en la salida de la consulta, por lo que se nombra explícitamente las columnas necesarias en la línea **9**.

source: A conditional ``CASE`` statement that returns the geometry in human readable form:
es: Una instrucción condicional ``CASE`` que devuelve la geometría en forma legible por humanos:

source: Of the geometry when ``node`` is the ``source`` column. (line **11**)
es: De la geometría cuando ``node`` es la columna ``source``. (línea **11**)

source: Of the reversed geometry when ``node`` is not the ``source`` column. (line **12**)
es: De la geometría invertida cuando ``node`` no es la columna ``source``. (línea **12**)

source: A conditional ``CASE`` statement that returns:
es: Una instrucción condicional ``CASE`` que devuelve:

source: The reversed geometry when ``node`` is not the ``source`` column. (line **16**)
es: La geometría invertida cuando ``node`` no es la columna ``source``. (línea **16**)

source: The geometry when ``node`` is the ``source`` column. (line **17**)
es: La geometría cuando ``node`` es la columna ``source``. (línea **17**)

source: Exercise 9: Using the geometry
es: Ejercicio 9: Uso de la geometría

source: From |place_3| to the |place_1| show azimuth
es: Desde |place_3| al |place_1| mostrar el azimut

source: There are many geometry functions in PostGIS, the workshop already covered some of them like ``ST_AsText``, ``ST_Reverse``, ``ST_EndPoint``, etc. This exercise will make use an additional function ``ST_Azimuth``.
es: Hay muchas funciones de geometría en PostGIS, el taller ya cubrió algunas de ellas como ``ST_AsText``, ``ST_Reverse``, ``ST_EndPoint``, etc. Este ejercicio hará uso de una función adicional ``ST_Azimuth``.

source: Modify the query from `Exercise 8: Route geometry directionality`_.
es: Modifique la consulta de `Ejercicio 8: Direccionalidad de la geometría de la ruta`_.

source: Aditionally obtain the azimuth of the correct geometry.
es: Además, obtenga el azimut de la geometría correcta.

source: keep the output small:
es: mantenga la salida pequeña:

source: Even that other columns are calculated only output:
es: Incluso que otras columnas se calculan solo como salida:

source: ``seq``, ``id``, ``seconds`` and the ``azimuth``
es: ``seq``, ``id``, ``seconds`` y el ``azimuth``

source: Because ``vehicle_net`` is a subgraph of ``ways``, do the ``JOIN`` with ``ways``.
es: Dado que ``vehicle_net`` es un subgrafo de ``ways``, realizar el ``JOIN`` con ``ways``.

source: Moving the query that gets the additional information into the ``WITH`` statement.
es: Mover la consulta que obtiene la información adicional en la instrucción ``WITH``.

source: Naming it ``additional``. (line **9**)
es: Asígnele el nombre ``adicional``. (línea **9**)

source: Final ``SELECT`` statements gets:
es: Las instrucciones ``SELECT`` finales obtienen:

source: The requested information. (line **25**)
es: La información solicitada. (línea **25**)

source: Calculates the azimuth of ``route_geom``. (line **26**)
es: Calcula el azimut de ``route_geom``. (línea **26**)

source: Creating the Function
es: Crear la función

source: The following function simplifies (and sets default values) when it calls the shortest path Dijkstra function.
es: La siguiente función simplifica (y establece los valores por defecto) cuando se llama a la función del camino más corto de Dijkstra.

source: pgRouting uses heavely function overloading:
es: pgRouting utiliza una gran sobrecarga de funciones:

source: Avoid creating functions with a name of a pgRouting routing function
es: Evite crear funciones con un nombre de una función de enrutamiento pgRouting

source: Avoid the name of a function to start with `pgr_`, `_pgr` or `ST_`
es: Evite el nombre de una función para comenzar con `pgr_`, `_pgr` o `ST_`

source: Exercise 10: Function for an application
es: Ejercicio 10: Función para una aplicación

source: Putting all together in a SQL function
es: Poner todo junto en una función SQL

source: function name ``wrk_dijkstra``
es: nombre de función ``wrk_dijkstra``

source: Should work for any given view.
es: Debe funcionar para cualquier vista dada.

source: Allow a view as a parameter
es: Permitir una vista como parámetro
