Repository: pgRouting/workshop
Catalog: locale/*/LC_MESSAGES/basic/sql_function.po
Languages: es

source: A table can be used if the columns have the correct names.
es: Se puede utilizar una tabla si las columnas tienen los nombres correctos.

source: ``source`` and ``target`` are in terms of ``osm_id``.
es: ``source`` y ``target`` son en términos de ``osm_id``.

source: The result should meet the requirements indicated at the begining of the chapter
es: El resultado debe cumplir los requisitos indicados al principio del capítulo

source: The signature of the function:
es: La firma de la función:

source: The input parameters are from line **4** to **6**.
es: Los parámetros de entrada son de la línea **4** a **6**.

source: The output columns are from line **7** to **14** (not highlited).
es: Las columnas de salida van de la línea **7** a **14** (sin resltar).

source: The function returns a set. (line **16**)
es: La función devuelve un conjunto. (línea **16**)

source: The body of the function:
es: El cuerpo de la función:

source: Appending the view name on line **7** in the ``SELECT`` query to ``pgr_dijkstra``.
es: Anexar el nombre de la vista en la línea **7** en la consulta ``SELECT`` a ``pgr_dijkstra``.

source: Using the data to get the route from ``source`` to ``target``. (line **8**)
es: Usar los datos para obtener la ruta de ``source`` a ``target``. (línea **8**)

source: The ``JOIN`` with ``ways`` is necessary, as the views are subset of ``ways`` (line **25**)
es: El ``JOIN`` con ``ways`` es necesario, ya que las vistas son un subconjunto de ``ways`` (línea **25**)

source: Exercise 11: Using the function
es: Ejercicio 11: Uso de la función

source: Test the function with the three views
es: Probar la función con las tres vistas

source: From the "|place_3|" to the |place_1| using the OSM identifier
es: Desde "|place_3|" hacia |place_1| utilizando el identificador OSM

source: Use the function on the ``SELECT`` statement
es: Usar la función en la instrucción ``SELECT``

source: The first parameter changes based on the view to be tested
es: El primer parámetro cambia en función de la vista que se va a probar

source: Use the function
es: Utilizar la función

source: Try the function with a combination of the interesting places:
es: Pruebe la función con una combinación de los lugares interesantes:
