Repository: pgRouting/workshop
Catalog: locale/*/LC_MESSAGES/basic/vehicle.po
Languages: es, sv

source: Vehicle Routing
es: Enrutamiento de vehículos
sv: Routning av fordon

source: Routing, is not limited to pedestrians and most of the time is used for routing vehicles.
es: Ruteo, no se limita a los peatones y la mayor parte del tiempo se utiliza para la ruta de vehículos.
sv: Routing är inte begränsat till fotgängare och används för det mesta för att dirigera fordon.

source: Chapter Contents
es: Contenido del Capítulo
sv: Kapitelinnehåll

source: Routing for vehicles
es: Ruteo para vehículos
sv: Routing för fordon

source: A query for vehicle routing generally differs from routing for pedestrians:
es: Una consulta para el enrutamiento de vehículos generalmente difiere de la ruta para los peatones:
sv: En fråga om fordonsdirigering skiljer sig i allmänhet från dirigering för fotgängare:

source: The road segments are considered `directed`
es: Los segmentos de carretera se consideran `dirigidos`
sv: Vägsegmenten anses vara `directed`

source: Costs can be:
es: Los costos pueden ser:
sv: Kostnaderna kan vara:

source: Distance
es: Distancia
sv: Avstånd

source: Time
es: Tiempo
sv: Tid

source: Dollars
es: Dólares
sv: Dollar

source: CO\ :sub:`2`\ emissions
es: CO\ :sub:`2`\ emisiones
sv: CO\ :sub:`2`\ utsläpp

source: Wear and tear on the vehicle, etc.
es: Desgaste en el vehículo, etc.
sv: Slitage på fordonet etc.

source: The ``reverse_cost`` attribute must be taken into account on two way streets.
es: El atributo ``reverse_cost`` debe tenerse en cuenta en calles de dos vías.
sv: Attributet ``reverse_cost`` måste beaktas på dubbelriktade gator.

source: The costs should have the same units as the ``cost`` attribute
es: Los costes deben tener las mismas unidades que el atributo ``cost``
sv: Kostnaderna ska ha samma enheter som attributet ``cost``

source: ``cost`` and ``reverse_cost`` values can be different
es: Los valores ``cost`` y ``reverse_cost`` pueden ser diferentes
sv: värdena ``cost`` och ``reverse_cost`` kan vara olika

source: Due to the fact that there are roads that are **one way**
es: Debido al hecho de que hay carreteras que son **de una manera**
sv: På grund av att det finns vägar som är ** enkelriktade**

source: Depending on the geometry, the valid way:
es: Dependiendo de la geometría, la forma válida:
sv: Beroende på geometrin är det giltiga sättet:

source: (``source, target``) segment ``IF cost >= 0 AND reverse_cost < 0``
es: (``source, target``) segmento ``IF cost >= 0 AND reverse_cost < 0``

source: (``target, source``) segment ``IF cost < 0 AND reverse_cost >= 0``
es: (``target, source``) segmento ``IF cost < 0 AND reverse_cost >= 0``
sv: (``mål, källa``) segment ``IF kostnad < 0 AND reverse_cost >= 0``

source: A **wrong way** is indicated with a **negative value** and is not inserted in the graph for processing.
es: Un **camino incorrecto** se indica con un **valor negativo** y no se inserta en el grafo para su procesamiento.
sv: Ett **felaktigt sätt** anges med ett **negativt värde** och förs inte in i diagrammet för bearbetning.

source: **Two way** roads - ``IF cost >= 0 AND reverse_cost >= 0`` and their values can be different. For example, it is faster going down hill on a sloped road. In general, ``cost`` and ``reverse_cost`` do not need to be length; they can be almost anything, for example - time, slope, surface, road type, etc., or they can be a combination of multiple parameters.
es: **Carreteras bidireccionales** -``IF cost >= 0 AND reverse_cost >= 0`` y sus valores pueden ser diferentes. Por ejemplo, es más rápido ir cuesta abajo en una carretera inclinada. En general, ``cost`` y ``reverse_cost`` no necesitan ser de longitud; pueden ser casi cualquier cosa, por ejemplo, tiempo, pendiente, superficie, tipo de carretera, etc., o pueden ser una combinación de múltiples parámetros.
sv: **Tvåvägsvägar** - ``IF cost >= 0 AND reverse_cost >= 0`` och deras värden kan vara olika. Det går t.ex. snabbare att åka nedför en backe på en sluttande väg. I allmänhet behöver inte ``cost`` och ``reverse_cost`` vara längder; de kan vara nästan vad som helst, t.ex. tid, lutning, yta, vägtyp etc., eller så kan de vara en kombination av flera parametrar.

source: The following queries indicate the number of road segments, where a "one way" rule applies:
es: Las siguientes consultas indican el número de segmentos de carretera, donde se aplica una regla "unidireccional":
sv: Följande frågor anger antalet vägsegment där regeln om enkelriktning gäller:

source: Number of (``source, target``) segments with ``cost < 0`` (line **3**).
es: Número de (``source, target``) segmentos con ``cost < 0`` (line **3**).
sv: Antal (``source, target``) segment med ``cost < 0`` (rad **3**).

source: Number of (``target, source``) segments with ``reverse_cost < 0`` (line **3**).
es: Número de segmentos (``target, source``) segmentos con ``reverse_cost < 0`` (line **3**).
sv: Antal (``target, source``) segment med ``reverse_cost < 0`` (rad **3**).

source: Exercise 1: Vehicle routing - going
es: Ejercicio 1: Ruteo de vehículos - ida
sv: Övning 1: Fordonsdirigering - körning

source: Problem:
es: Problema:

source: From the "|place_1|" to the "|place_3|" by car.
es: Desde "|place_1|" hacia "|place_3|" en automóvil.
sv: Från "|place_1|" till "|place_3|" med bil.

source: From |place_1| to the |place_3| by car.
es: Desde |place_1| al |place_3| en coche.
sv: Från |place_1| till |place_3| med bil.

source: Solution:
es: Solución:
sv: Lösning:

source: Use ``cost`` (line **6**) and ``reverse_cost`` (line **7**) columns, which are in unit ``degrees``.
es: Utilice las columnas ``cost`` (línea **6**) y ``reverse_cost`` (línea **7**), que están en la unidad ``grados``.
sv: Använd kolumnerna ``cost`` (rad **6**) och ``reverse_cost`` (rad **7**), som är i enheten ``degrees``.

source: The vehicle is going from vertex |id_1| (line **10**) to |id_3| (line **11**).
es: El vehículo va desde vértice |id_1| (line **10**) hacia |id_3| (line **11**).
sv: Fordonet går från toppunkt |id_1| (rad **10**) till |id_3| (rad **11**).

source: Exercise 2: Vehicle routing - returning
es: Ejercicio 2: Ruteo de vehículos - regreso
sv: Övning 2: Fordonsdirigering - återvändande

source: From "|place_3|" to the "|place_1|" by car.
es: Desde "|place_3|" hacia "|place_1|" en automóvil.
sv: Från "|place_3|" till "|place_1|" med bil.

source: From |place_3| to the |place_1| by car.
es: Desde |place_3| al |place_1| en coche.
sv: Från |place_3| till |place_1| med bil.

source: Use ``cost_s`` (line **6**) and ``reverse_cost_s`` (line **7**) columns, in units seconds.
es: Utilizar las columnas ``cost_s`` (línea **6**) y ``reverse_cost_s`` (línea **7**) que están en unidad de segundos.
sv: Använd kolumnerna ``cost_s`` (rad **6**) och ``reverse_cost_s`` (rad **7**), i enheten sekunder.

source: The vehicle is going from vertex |id_3| (line **10**) to |id_1| (line **11**).
es: El vehículo va de vértice |id_3| (línea **10**) para |id_1| (línea **11**).
sv: Fordonet går från toppunkt |id_3| (rad **10**) till |id_1| (rad **11**).

source: On a directed graph, going and coming back routes, most of the time are different.
es: En un grafo dirigido, las rutas para ir y volver, la mayoría de las veces son diferentes.
sv: I en riktad graf är rutterna dit och tillbaka för det mesta olika.

source: Exercise 3: Vehicle routing when time is money
es: Ejercicio 3: Ruteo de vehículos cuando el tiempo es dinero
sv: Övning 3: Fordonsdirigering när tid är pengar

source: From "|place_3|" to the "|place_1|" by taxi.
es: Desde "|place_3|" hacia "|place_1|" en taxi.
sv: Från "|place_3|" till "|place_1|" med taxi.

source: From |place_3| to |place_1| by taxi.
es: Desde |place_3| a |place_1| en taxi.
sv: Från |place_3| till |place_1| med taxi.

source: The cost is ``$100 per hour``.
es: El costo es de ``$100 por hora``.
sv: Kostnaden är ``$100 per timme``.

source: Using ``cost_s`` (line **6**) and ``reverse_cost_s`` (line **7**) columns, which are in unit ``seconds``.
es: Utilizar las columnas ``cost_s`` (línea **6**) y ``reverse_cost_s`` (línea **7**) que están en unidad de ``segundos``.
sv: Använda kolumnerna ``cost_s`` (rad **6**) och ``reverse_cost_s`` (rad **7**), som är i enheten ``seconds``.

source: The duration in hours is ``cost_s / 3600``.
es: La duración en horas es ``cost_s / 3600``.
sv: Varaktigheten i timmar är ``cost_s / 3600``.

source: The cost in ``dollars`` is ``cost_s / 3600 * 100``.
es: El costo en ``dollars`` es ``cost_s / 3600 * 100``.
sv: Kostnaden i ``dollars`` är ``cost_s / 3600 * 100``.

source: Comparing with `Exercise 2: Vehicle routing - returning`_:
es: Comparación con `Ejercicio 2: Ruteo de vehículos - regreso`_:
sv: Jämförs med `Övning 2: Fordonsdirigering - retur`_:

source: The total number of records are identical.
es: El número total de registros es idéntico.
sv: Det totala antalet poster är identiska.

source: The node sequence is identical.
es: La secuencia de nodos es idéntica.
sv: Nodernas sekvens är identisk.

source: The edge sequence is identical.
es: La secuencia de aristas es idéntica.
sv: Kantsekvensen är identisk.

source: The cost and agg_cost results are directly proportional.
es: El coste y los resultados agg_cost son directamente proporcionales.
sv: Resultaten för kostnad och agg_cost är direkt proportionella.

source: Cost manipulations
es: Manipulaciones de costes
sv: Kostnadsmanipulationer

source: When dealing with data, being aware of what kind of data is being used can improve results.
es: Al tratar con datos, ser consciente de qué tipo de datos se están utilizando puede mejorar los resultados.
sv: När man hanterar data kan man förbättra resultaten genom att vara medveten om vilken typ av data som används.

source: Vehicles can not circulate on pedestrian ways
es: Los vehículos no pueden circular por vías peatonales
sv: Fordon får inte köra på gågator

source: Penalizing or removal of pedestrian ways will make the results closer to reality.
es: Penalizar o eliminar las vías peatonales hará que los resultados se acerquen a la realidad.
sv: Genom att straffa eller ta bort gångvägar kommer resultaten att bli mer verklighetstrogna.

source: When converting data from OSM format using the `osm2pgrouting` tool, there is an additional table: ``configuration``.
es: Al convertir datos del formato OSM mediante la herramienta `osm2pgrouting`, hay una tabla adicional: ``configuration``.
sv: När du konverterar data från OSM-format med hjälp av verktyget `osm2pgrouting` finns det en extra tabell: ``configuration``.

source: The ``configuration`` table structure can be obtained with the following command.
es: La estructura de tabla ``configuration`` se puede obtener con el siguiente comando.
sv: Tabellstrukturen ``configuration`` kan erhållas med följande kommando.

source: tag_id values
es: valores de `tag_id`
sv: tag_id-värden

source: In the image above there is a detail of the ``tag_id`` of the roads.
es: En la imagen de arriba hay un detalle de la ``tag_id`` de las carreteras.
sv: I bilden ovan finns en detalj av ``tag_id`` för vägarna.

source: The ``OSM way`` types:
es: Los tipos ``OSM way``:
sv: Typerna för ``OSM way``:

source: Also, on the ``ways`` table there is a column that can be used to ``JOIN`` with the ``configuration`` table.
es: Además, en la tabla ``ways`` hay una columna que se puede utilizar para ``JOIN`` con la tabla ``configuration``.
sv: I tabellen ``ways`` finns det också en kolumn som kan användas för att ``JOIN`` med tabellen ``configuration``.

source: The ``ways`` types:
es: Los tipos de ``caminos``:
sv: Typerna ``ways``:

source: In this workshop, costs are going to be manipulated using the ``configuration`` table.
es: En este taller, los costes se van a manipular utilizando la tabla ``configuración``.
sv: I den här workshopen kommer kostnader att manipuleras med hjälp av tabellen ``configuration``.

source: Exercise 4: Vehicle routing without penalization
es: Ejercicio 4: Ruteo de vehículos sin penalización
sv: Övning 4: Fordonsdirigering utan bestraffning

source: From the "|place_3|" to "|place_1|"
es: Desde "|place_3|" hacia "|place_1|"
sv: Från "|place_3|" till "|place_1|"

source: From |place_3| to |place_1|
es: Desde |place_3| a |place_1|
sv: Från |place_3| till |place_1|

source: Add a penalty column
es: Agregar una columna de penalización
sv: Lägg till en straffkolumn

source: All roads have a ``penalty`` of ``1`` (line **3**).
es: Todas las carreteras tienen una ``penalización`` de ``1`` (línea **3**).
sv: Alla vägar har en ``straffavgift`` på ``1`` (rad **3**).

source: Query
es: Consulta
sv: Fråga

source: The vehicle's cost in this case will be in penalized seconds.
es: El costo del vehículo en este caso será penalizado en segundos.
sv: Fordonets kostnad i detta fall kommer att vara i straffade sekunder.

source: Costs (in seconds) are to be multiplied by :code:`penalty` (lines **12** and **13**).
es: Los costos (en segundos) deben multiplicarse por :code:`penalty` (líneas **12** y **13**).
sv: Kostnaderna (i sekunder) ska multipliceras med :code:`penalty` (raderna **12** och **13**).

source: Costs wont change (times 1 leaves the value unchanged).
es: Los costes no cambiarán (las veces 1 dejan el valor sin cambios).
sv: Kostnaderna kommer inte att förändras (gånger 1 lämnar värdet oförändrat).

source: The :code:`configuration` table is linked with the :code:`ways` table by the :code:`tag_id` field using a ``JOIN`` (lines **14** and **15**).
es: La tabla :code:`configuration` está vinculada a la tabla :code:`ways` mediante el campo :code:`tag_id` y usando un ``JOIN`` (líneas **14** y **15**).
sv: Tabellen :code:`configuration` är länkad till tabellen :code:`ways` genom fältet :code:`tag_id` med hjälp av en ``JOIN`` (raderna **14** och **15**).

source: The vehicle is going from vertex |id_3| (line **17**) to vertex |id_1| (line **18**).
es: El vehículo va desde el vértice |id_3| (línea **17**) al vértice |id_1| (línea **18**).
sv: Fordonet går från toppunkt |id_3| (rad **17**) till toppunkt |id_1| (rad **18**).

source: Exercise 5: Vehicle routing with penalization
es: Ejercicio 5: Ruteo de vehículos con penalización
sv: Övning 5: Fordonsdirigering med bestraffning

source: Concept:
es: Concepto:
sv: Koncept:

source: Change the cost values for the :code:`configuration` table, in such a way, that the
es: Cambiar los valores de coste de la tabla :code:`configuration` de forma que el
sv: Ändra kostnadsvärdena för tabellen :code:`configuration` på ett sådant sätt att

source: Pedestrian roads are not used.
es: No se utilizan carreteras peatonales.
sv: Fotgängarvägar används inte.

source: ``penalty < 0`` makes the road not to be included in the graph.
es: ``penalty < 0`` hace que el segmento no se incluya en el grafo.
sv: ``straffavgift < 0`` gör att vägen inte inkluderas i diagrammet.

source: Using residential roads is not encouraged.
es: No se fomenta el uso de carreteras residenciales.
sv: Att använda bostadsvägar uppmuntras inte.

source: ``penalty > 1`` makes the road slower for the calculations.
es: ``penalty > 1`` hace que el segmento sea más lento para los cálculos.
sv: ``penalty > 1`` gör vägen långsammare för beräkningarna.

source: Using "faster" roads is highly encouraged.
es: El uso de carreteras "más rápidas" es muy alentador.
sv: Att använda "snabbare" vägar uppmuntras starkt.

source: ``penalty < 1`` makes the road faster for the calculations.
es: ``penalty < 1`` hace que el segmento más rápido para los cálculos.
sv: ``penalty < 1`` gör vägen snabbare för beräkningarna.

source: The ``penalty`` values can be changed with ``UPDATE`` queries.
es: Los valores ``penalty`` se pueden cambiar con las consultas ``UPDATE``.
sv: Värdena för ``penalty`` kan ändras med ``UPDATE``-frågor.

source: These values are an exaggeration.
es: Estos valores son una exageración.
sv: Dessa värden är överdrivna.

source: From the "|place_3|" to "|place_1|" with penalization.
es: Desde "|place_3|" hacia "|place_1|" con la penalización.
sv: Från "|place_3|" till "|place_1|" med bestraffning.

source: Costs are to be multiplied by :code:`penalty` (lines **6** and **7**).
es: Los costos deben multiplicarse por :code:`penalty` (líneas **6** y **7**).
sv: Kostnaderna ska multipliceras med :code:`penalty` (raderna **6** och **7**).

source: The :code:`configuration` table is linked with the :code:`ways` table by the :code:`tag_id` field using a ``JOIN`` (lines **8** and **9**).
es: La tabla :code:`configuration` está vinculada a la tabla :code:`ways` por el campo:code:`tag_id` mediante un campo ``JOIN`` (líneas **8** y **9**).
sv: Tabellen :code:`configuration` är länkad till tabellen :code:`ways` genom fältet :code:`tag_id` med hjälp av en ``JOIN`` (raderna **8** och **9**).

source: The vehicle is going from vertex |id_3| (line **11**) to vertex |id_1| (line **12**).
es: El vehículo va de vértice |id_3| (línea **11**) al vértice |id_1| (línea **12**).
sv: Fordonet går från toppunkt |id_3| (rad **11**) till toppunkt |id_1| (rad **12**).

source: Comparing with `Exercise 3: Vehicle routing when time is money`_:
es: Comparando con `Ejercicio 3: Ruteo de vehículos cuando el tiempo es dinero`_:
sv: Jämförelse med `Övning 3: Fordonsdirigering när tid är pengar`_:

source: The total number of records changed.
es: El número total de registros cambió.
sv: Det totala antalet poster har ändrats.

source: The node sequence changed.
es: La secuencia de nodos cambió.
sv: Nodens sekvens har ändrats.

source: The edge sequence changed.
es: La secuencia de bordes cambió.
sv: Kantsekvensen har ändrats.

source: The route is avoiding the residential roads that have ``tag_id = 110``.
es: La ruta está evitando las carreteras residenciales que tienen ``tag_id = 110``.
sv: Rutten undviker de bostadsvägar som har ``tag_id = 110``.

source: The costs do not change proportionally.
es: Los costos no cambian proporcionalmente.
sv: Kostnaderna förändras inte proportionellt.

source: Exercise 6: Time in seconds of penalized route
es: Ejercicio 6: Tiempo en segundos de la ruta penalizada
sv: Övning 6: Tid i sekunder för den straffade rutten

source: Get the times in seconds of a penalized route
es: Obtener el tiempo en segundos de una ruta penalizada
sv: Hämta tiderna i sekunder för en straffad rutt

source: Use as inner query the penalized query joined with the ways table
es: Utilizar como consulta interna la consulta penalizada unida a la tabla ``ways``
sv: Använd som inre fråga den straffade frågan som är kopplad till tabellen ways

source: Keep the ``edge`` as ``gid`` (line **6**)
es: Mantener el ``edge`` como ``gid`` (línea **6**)
sv: Behåll ``kanten`` som ``gid`` (rad **6**)

source: Join using ``gid`` (line **18**)
es: Unir usando ``gid`` (línea **18**)
sv: Anslut med hjälp av ``gid`` (rad **18**)

source: Comparing with `Exercise 5: Vehicle routing with penalization`_:
es: Comparando con `Ejercicio 5: Ruteo de vehículos con penalización`_:
sv: Jämförs med `Övning 5: Fordonsdirigering med straff`_:

source: The total number of records is the same.
es: El número total de registros es el mismo.
sv: Det totala antalet poster är detsamma.

source: The route is the same
es: La ruta es la misma
sv: Rutten är densamma

source: The ``cost`` column have the original vales from the ways table.
es: La columna ``cost`` tiene los valores originales de la tabla ``ways``.
sv: Kolumnen ``cost`` har de ursprungliga värdena från sätttabellen.

source: Euros
sv: Euro

source: Pesos
sv: Peso
