Repository: pgRouting/workshop
Catalog: locale/*/LC_MESSAGES/interactions/chapter-11.po
Languages: es, ja

source: OpenLayers Based Routing Interface
es: Interfaz de Ruteo Basada en OpenLayers

source: The goal of this chapter is to create a simple web-based user interface to pgRouting based on OpenLayers. The user will be able to choose start and destination locations, and get the route from the start point to the destination point.
es: El objetivo de este capítulo es crear una interfaz de usuario sencilla basada en web a pgRouting basada en OpenLayers. El usuario podrá elegir ubicaciones de inicio y destino y obtener la ruta desde el punto de inicio hasta el punto de destino.

source: The start and destination points are created by the user, with simple clicks on the map. The start and destination coordinates are then sent to the WMS server (GeoServer), as parameters to a WMS ``GetMap`` request. The resulting image is added as an *image* layer to the map.
es: Los puntos de inicio y destino son creados por el usuario, con simples clics en el mapa. A continuación, las coordenadas de inicio y destino se envían al servidor WMS (GeoServer), como parámetros a una solicitud WMS ``GetMap``. La imagen resultante se agrega como una capa *image* al mapa.
ja: 出発地点と目的地点はユーザにより、地図上でクリックすることで作成されます。その後、出発地点と目的地点の座標は WMS サーバ (GeoServer) に WMS の ``GetMap`` リクエストとして送信されます。結果画像は地図に *画像* レイヤとして追加されます。

source: OpenLayers introduction
es: Introducción a OpenLayers

source: OpenLayers uses modern JavaScript, and HTML5 technologies such as Canvas and WebGL for the rendering of images/tiles and vectors.
es: OpenLayers utiliza tecnologías JavaScript y HTML5 modernas, como Canvas y WebGL, para la representación de imágenes/iconos y vectores.

source: Creating an OpenLayers map in a web page involves creating a *map* object, which is an instance of the ``ol.Map`` class. Then, data layers and controls can be added to that map object.
es: Crear un mapa openlayers en una página web implica crear un objeto *map*, que es una instancia de la clase de mapa ``ol.Map``. Posteriormente, se pueden agregar capas y controles de datos a ese objeto de mapa.

source: OpenLayers features three renderers: the *Canvas* renderer, the *WebGL* renderer, and the *DOM* renderer. Currently, the most capable renderer is Canvas. In particular the Canvas renderer supports vector layers, while the other two don't. Canvas is the default renderer, and the renderer used in this workshop.
es: OpenLayers cuenta con tres renderizadores: el representador *Canvas*, el representador *WebGL* y el representador *DOM*. Actualmente, el renderizador más capaz es Canvas. En particular, el renderizador Canvas admite capas vectoriales, mientras que las otras dos no. Canvas es el representador predeterminado y el renderizador utilizado en este taller.

source: Creating a minimal map
es: Crear un mapa mínimo
ja: 最小限の地図の作成

source: Let's create our first OpenLayers map: open a text editor and copy this code into a file named ``ol.html``. You can save this file on the ``Desktop`` and open it with a web browser.
es: Vamos a crear nuestro primer mapa OpenLayers: abramos un editor de texto y copiemos este código en un archivo denominado ``ol.html``. Puede guardar este archivo en ``Desktop`` y abrirlo con un navegador web.

source: This web page includes a simple map with an OpenStreetMap layer and center to a predifined location. There is no routing-related code for now; just a simple map with stantard navigation tools.
es: Esta página web incluye un mapa simple con una capa OpenStreetMap y un centro a una ubicación predifinida. No hay código relacionado con el ruteo por ahora; sólo un mapa simple con herramientas de navegación stantard.
ja: このウェブページは OpenStreetMap レイヤの簡単な地図を含み、既定の位置を中心としています。今のところ、ルート検索に関連したコードはありません; 単に標準のナビゲーションツールを備えた簡単な地図となります。

source: Line by line we have:
es: Línea por línea tenemos:
ja: 各行では以下を行っています:

source: Line 6: include the default OpenLayers CSS file.
es: Línea 6: incluir archivo CSS de OpenLayers predeterminado.
ja: 6 行目: デフォルトの OpenLayers CSS ファイルを読み込みます。

source: Line 7 to Line 12: CSS rules to give dimensions to the map DOM element.
es: Línea 7 a Línea 12: reglas CSS para dar dimensiones al elemento DOM del mapa.
ja: 7 〜 12 行目: 地図の DOM 要素にサイズを割り当てるため、 CSS ルールを記述します。

source: Line 15: add a div element for the map. The element's identifier is ``map``.
es: Línea 15: agregar un elemento div para el mapa. El identificador del elemento es ``map``.
ja: 15行目: 地図のために div 要素を追加します。要素の識別子は ``map`` とします。

source: Line 16: load the OpenLayers library code. Functions and classes in the ``ol`` namespace come from there.
es: Línea 16: cargar el código de la biblioteca OpenLayers. Las funciones y clases del espacio de nombres ``ol`` provienen de allí.

source: Line 18 to Line 29: the JavaScript code specific to that example.
es: Línea 18 a Línea 29: el código JavaScript específico de ese ejemplo.
ja: 18 〜 29行目: このサンプル特有の JavaScript コードとなります。

source: Let's have a closer look at the code that create the OpenLayers code:
es: Echemos un vistazo más de cerca al código que crea el código OpenLayers:

source: This code creates an ``ol.Map`` instance whose ``target`` is the ``map`` DOM element in the HTML page. The map is configured with a *tile layer*, itself configured with an OpenStreetMap *source*. The map is also configured with a *view* instance (of the ``ol.View`` class) with predefined values for the *center* and the *zoom* level.
es: Este código crea un ``ol.Map`` instancia cuyo ``target`` es el elemento DOM ``map`` en la página HTML. El mapa se configura con una *capa de teselas*, configurada con una *fuente* OpenStreetMap . El mapa también se configura con una instancia de *vista* (de la clase ``ol.View`` ) con valores predefinidos para el *centro* y el nivel de *zoom*.
ja: このコードは ``target`` が HTML ページ内の ``map`` DOM 要素となる ``ol.Map`` インスタンスを作成します。地図は *タイルレイヤ* の設定を含み、レイヤは OpenStreetMap の *source* 設定を含みます。地図はさらに、既定の *center* と *zoom* レベルの既定値を定義した *view* インスタンス (``ol.View`` クラス) の設定を含みます。

source: WMS GET parameters
es: Parámetros WMS GET
ja: WMS GET パラメータ

source: Add this code after the creation of the map:
es: Agregue este código después de la creación del mapa:
ja: 以下のコードを地図の作成の後に追加します。

source: The ``params`` object holds the WMS GET parameters that will be sent to GeoServer. Here we set the values that will never change: the layer name and the output format.
es: El objeto ``params`` contiene los parámetros WMS GET que se enviarán a GeoServer. Aquí establecemos los valores que nunca cambiarán: el nombre de la capa y el formato de salida.
ja: ``params`` オブジェクトは GeoServer に送信される WMS GET パラメータを保持します。ここでは、変更されることのない値: レイヤ名称と出力フォーマット を設定します。

source: Select "start" and "destination"
es: Seleccione "inicio" y "destino"
ja: "出発地" と "目的地" の選択

source: We now want to allow the user to add the start and destination positions by clicking on the map. Add the following code for that:
es: Ahora queremos permitir que el usuario agregue las posiciones de inicio y destino haciendo clic en el mapa. Agregue el código siguiente para ello:
ja: 地図上でのクリックにより、ユーザが出発地と目的地を追加できるようにすることが必要です。以下のコードを追加します:

source: That code creates two vector features, one for the "start" position and one for the "destination" position. These features are empty for now – they do not include a geometry.
es: Ese código crea dos características vectoriales, una para la posición "start" y otra para la posición "destination". Estas operaciones están vacías por ahora: no incluyen geometría.
ja: 上記コードは 2 つのベクタフィーチャを作成し、 1 つは "出発地" 、もう 1 つは "目的地" となります。 これらのフィーチャは、今のところ空 - ジオメトリを含まない - 状態となります。

source: The code also creates a vector layer, with the "start" and "destination" features added to it. It also adds the vector layer to the map, using the map's ``addLayer`` method.
es: El código también crea una capa vectorial, con las entidades "inicio" y "destino" añadidas a ella. También agrega la capa vectorial al mapa, utilizando el método``addLayer`` del mapa.
ja: 上記コードは、さらにベクタレイヤを作成し、 "出発地" と "目的地" のフィーチャを追加しています。さらに、 map の ``addLayer`` メソッドにより、地図にベクタレイヤを追加しています。

source: Now add the following code:
es: Agregar ahora el siguiente código:
ja: 次に、以下のコードを追加します:

source: This code registers a listener function for the map ``click`` event. This means that OpenLayers will call that function each time a click is detected on the map.
es: Este código registra una función de escucha para el evento ``clic`` del mapa. Esto significa que OpenLayers llamará a esa función cada vez que se detecte un clic en el mapa.

source: The event object passed to the listener function includes a ``coordinate`` property that indicates the geographical location of the click. That coordinate is used to create a *point* geometry for the "start" and "destination" features.
es: El objeto del evento pasado a la función de escucha incluye una propiedad de ''coordinar'' que indica la ubicación geográfica del clic. Esa coordenada se utiliza para crear una geometría de *punto* para las entidades "inicio" y "destino".
ja: リスナー関数に渡されるイベントオブジェクトは、 クリックの地理的な位置を表す ``coordinate`` プロパティを含みます。 coordinate は "出発地" と "目的地" フィーチャの *ポイント* ジオメトリを作成するのに使用されます。

source: Once we have the start and destination points (after two clicks); the two pairs of coordinates are transformed from the map projection (``EPSG:3857``) into the server projection (``EPSG:4326``) using the ``transform`` function.
es: Una vez que tengamos los puntos de inicio y destino (después de dos clics); los dos pares de coordenadas se transforman de la proyección del mapa (``EPSG:3857``) en la proyección del servidor (``EPSG:4326``) utilizando la función ``transform``.
ja: 一度、始点と目的地のポイントが(2度のクリックにより)確定すると、2つの座標値のペアは、地図の投影法(``EPSG:3857``)からサーバの投影法(``EPSG:4326``)に ``transform`` 関数を使用して変換されます。

source: The ``viewparams`` property is then set on WMS GET parameters object. The value of this property has a special meaning: GeoServer will substitute the value before executing the SQL query for the layer. For example, if we have:
es: A continuación, la propiedad ``viewparams`` se establece en el objeto de parámetros WMS GET. El valor de esta propiedad tiene un significado especial: GeoServer sustituirá el valor antes de ejecutar la consulta SQL para la capa. Por ejemplo, si tenemos:
ja: ``viewparams`` プロパティは WMS GET パラメータオブジェクトに設定されます。このプロパティの値は特別な意味を持ちます: GeoServer はこのレイヤのための SQL クエリを実行する前に、この値を代用します。例えば、もし:

source: And ``viewparams`` is ``viewparams=min:20;max:120`` then the SQL query sent to PostGIS will be:
es: Y ``viewparams`` es ``viewparams=min:20;max:120`` entonces la consulta SQL enviada a PostGIS será:
ja: の場合、 ``viewparams`` は ``viewparams=min:20;max:120`` となり、 PostGIS に送信される SQL クエリは:

source: Finally, a new OpenLayers WMS layer is created and added to the map, the param object is passed to it.
es: Por último, se crea una nueva capa WMS OpenLayers y se agrega al mapa, se le pasa el objeto param.
ja: となります。最後に、param オブジェクトが渡された、新しい OpenLayers WMS レイヤが作成されて、地図に追加されます。

source: Clear the results
es: Borrar los resultados
ja: 結果のクリア

source: Add this after the map ``div`` in the HTML page:
es: Añádalo después del mapa ``div`` en la página HTML:
ja: 以下のコードを HTML ページの地図の ``div`` の後に追加します:

source: This creates a button to we will use to allow the user to clear the routing points and start a new routing query.
es: Esto crea un botón que usaremos para permitir al usuario borrar los puntos de ruteo e iniciar una nueva consulta de enrutamiento.
ja: 上記により、ルート検索ポイントをクリアし、新しいルート検索クエリを開始することを可能にするボタンが作成されます。

source: Now add the following to the JavaScript code:
es: Ahora agregue lo siguiente al código JavaScript:
ja: 次に、以下のコードを JavaScript コードに追加します:

source: When the button is clicked, this function passed to ``addEventListener`` is executed. That function resets the "start" and "destination" features and remove the routing result layer from the map.
es: Cuando se hace clic en el botón, se ejecuta esta función pasada a ``addEventListener'``. Esa función restablece las entidades "inicio" y "destino" y elimina la capa de resultados de ruteo del mapa.
ja: このボタンがクリックされた際は、 ``addEventListener`` に渡されたこの関数が実行されます。この関数は "出発地" と "目的地" のフィーチャをリセットし、ルート検索結果レイヤを地図から削除します。

source: Summary (full example)
es: Resumen (ejemplo completo)

source: Now copy the following final application code into a file, accessible by a webserver, such as Apache or Nginx for example:
es: Ahora copie el siguiente código de aplicación final en un archivo, al que puede acceder un servidor web, como Apache o Nginx, por ejemplo:
