Repository: pgRouting/workshop
Catalog: locale/*/LC_MESSAGES/interactions/chapter-10.po
Languages: es

source: WMS server with GeoServer
es: Servidor WMS con GeoServer

source: Connect to the administration page
es: Conéctese a la página de administración

source: Once the server is up and running, open the `administration page <http://localhost:8082/geoserver/web>`_ in your browser, click the *Login* button, and enter the GeoServer admin credentials:
es: Una vez que el servidor esté en funcionamiento, abra la `página dadministrativa <http://localhost:8082/geoserver/web>`_ en su navegador, haga clic en el botón *Iniciar sesión* e introduzca las credenciales de administrador de GeoServer:

source: Username
es: Nombre de usuario

source: Password
es: Contraseña

source: Create the layer
es: Crear la capa

source: Now that your are logged in as an administrator you can create the WMS layer. In GeoServer terminology you will create an SQL View (see the `official documentation <https://docs.geoserver.org/latest/en/user/data/database/sqlview.html>`_ for more info).
es: Ahora que ha iniciado sesión como administrador, puede crear la capa WMS. En la terminología de GeoServer, creará una Vista SQL (consulte la `documentación oficial <https://docs.geoserver.org/latest/en/user/data/database/sqlview.html>` _ para obtener más información).

source: The first thing to do is to create a new **Workspace** for pgrouting: in the left menu of the page, inside the *Data* section, click *Workspaces* and then *Add new workspace*.
es: Lo primero que hay que hacer es crear un nuevo **Espacio de trabajo** para pgrouting: en el menú izquierdo de la página, dentro de la sección *Datos*, haga clic en *Espacios de trabajo* y luego *Agregar nuevo espacio de trabajo*.

source: Fill the form with:
es: Rellene el formulario con:

source: Namespace URI
es: URI de espacio de nombres

source: And press the ``submit`` button.
es: Y pulse el botón ``enviar``.

source: Next step: create a new **Store** linked to the workspace. Still in the left menu, click *Stores* and then *Add new Store*. Here you can choose the type of data source to configure. Choose *PostGIS*.
es: Siguiente paso: crear un nuevo **Almacén** vinculado al espacio de trabajo. En el menú de la izquierda, haga clic en *Almacenes* y, a continuación, en *Agregar nuevo almacén* Aquí puede elegir el tipo de origen de datos que desea configurar. Elija *PostGIS*.

source: Basic Store Info:
es: Información Básica de la Tienda:

source: Workspace
es: Espacio de trabajo

source: Data Source
es: Fuente de Datos

source: Connection Parameters:
es: Parámetros de conexión:

source: host
es: anfitrión

source: port
es: puerto

source: database
es: base de datos

source: schema
es: esquema

source: user
es: usuario

source: password
es: contraseña

source: The rest of the values can be left untouched.
es: El resto de los valores pueden dejarse como están.

source: Finally, your next task is to create the **Layer**. Click the *Layers* menu and then *Add a new resource*. Select the newly created workspace and store pair: ``pgrouting:pgrouting``.
es: Por último, la siguiente tarea es crear la **Capa** Hacer clic en el menú *Capas* y, a continuación, en *Agregar un nuevo recurso*. Seleccione el espacio de trabajo recién creado y almacene el par: ``pgrouting:pgrouting``.

source: Inside the text, click *Configure new SQL view*.
es: Dentro del texto, haga click en *Configure new SQL view*.

source: Name the view ``pgrouting`` and fill the *SQL statement* with:
es: Nombrar la vista``pgrouting`` y llene la *SQL statement* con:

source: In the *SQL view parameters*, click *Guess parameters from SQL*; the list displayed represents the parameters from the SQL above.
es: En el *SQL view parameters*, haga clic en *Guess parameters from SQL*; la lista mostrada representa los parámetros de la anterior de SQL.

source: For each parameter:
es: Para cada parámetro:

source: Set the default value to: `0`
es: Establecer el valor predeterminado: `0`

source: Change the validation regular expression to ``^-?[\d.]+$``
es: Cambiar la expresión regular de validación a ``^-?[\d.]+$``

source: The regular expression will only match numbers.
es: La expresión regular sólo igualará números.

source: In the *Attributes* list:
es: En la lista de *Atributos*:

source: Hit *Refresh*, one attribute should appear (called *st_makeline*)
es: Pulsa *Actualizar*, debe aparecer un atributo (llamado *st_makeline*)

source: Change the type to ``LineString`` and the SRID of the geometry column from ``-1`` to ``4326``
es: Cambie el tipo a ``LineString`` y el SRID de la columna geometría de ``-1`` a ``4326``

source: Save the form.
es: Guardar el formulario.

source: Finally, we need to setup the rest of the layer.
es: Por último, tenemos que configurar el resto de la capa.

source: The only thing to do in this screen is to make sure that the coordinate reference system is correct: the geometries in the database are in ``EPSG:4326`` but we want to display them in `EPSG:3857` because the OpenLayers map where the layer will be dispayed is in this projection.
es: Lo único que hay que hacer en esta pantalla es asegurarnos de que el sistema de referencia de coordenadas es correcto: las geometrías de la base de datos están en ``EPSG:4326`` pero queremos mostrarlas en `EPSG:3857` porque el mapa openlayers donde se desasignará la capa está en esta proyección.

source: Scroll down to the *coordinate reference system* section and change the **Declared SRS** to ``EPSG:3857`` and the **SRS handling** to ``Reproject native to declared``.
es: Desplázate hacia abajo hasta la sección *sistema de referencia de coordenadas* y cambia el SRS **Declarado** a ``EPSG:3857`` y el **control SRS** a ``Reproyecto nativo para declarar``.

source: Click the *Compute from data* and *Compute from native bounds* link to automatically set the layer bounds. Click the *Save* at the bottom of the page to create the layer.
es: Hacer clic en el vínculo *Calcular desde datos* y *Calcular desde límites nativos* para establecer automáticamente los límites de capa. Hacer clic en *Guardar* en la parte inferior de la página para crear la capa.
