Repository: pgRouting/workshop
Catalog: locale/*/LC_MESSAGES/chapters/appendix-1.po
Languages: es

source: Appendix: Workshop Solutions
es: Apéndice: Soluciones del taller

source: Solutions to :doc:`chapter-5`
es: Soluciones para :doc:`chapter-5`

source: Query results for chapter 5 exercise 1
es: Resultados de la consulta para el ejercicio 1 del capítulo 5

source: :ref:`Exercise 1: Single pedestrian routing`
es: :ref:`Ejercicio 1: Ruteo para un sólo peatón`

source: Query results for chapter 5 exercise 2
es: Resultados de la consulta para el ejercicio 2 del capítulo 5

source: :ref:`Exercise 2: Many Pedestrians going to the same destination`
es: :ref:`Ejercicio 2: Muchos peatones van al mismo destino`

source: Query results for chapter 5 exercise 3
es: Resultados de la consulta para el ejercicio 3 del capítulo 5

source: :ref:`Exercise 3: Many Pedestrians departing from the same location`
es: :ref:`Ejercicio 3: Muchos peatones que salen de la misma ubicación`

source: Query results for chapter 5 exercise 4
es: Resultados de la consulta para el ejercicio 4 del capítulo 5

source: :ref:`Exercise 4: Many Pedestrians going to different destinations`
es: :ref:`Ejercicio 4: Muchos peatones que van a diferentes destinos`

source: Query results for chapter 5 exercise 5
es: Resultados de la consulta para el ejercicio 5 del capítulo 5

source: :ref:`Exercise 5: Many Pedestrians going to different destinations returning aggregate costs`
es: :ref:`Ejercicio 5: Muchos Peatones que van a diferentes destinos devolviendo costos agregados`

source: Query results for chapter 5 exercise 6
es: Resultados de la consulta para el ejercicio 6 del capítulo 5

source: :ref:`Exercise 6: Many Pedestrians going to different destinations summarizing the total costs per departure`
es: :ref:`Ejercicio 6: Muchos peatones van a diferentes destinos resumiendo costos totales por salida`

source: Solutions to :doc:`chapter-6`
es: Soluciones para :doc:`chapter-6`

source: Query results for chapter 6 exercise 1
es: Resultados de la consulta para el ejercicio 1 del capítulo 6

source: :ref:`Exercise 1: Vehicle routing - going`
es: :ref:`Ejercicio 1: Ruteo de vehículos - ida`

source: Query results for chapter 6 exercise 2
es: Resultados de la consulta para el ejercicio 2 del capítulo 6

source: :ref:`Exercise 2: Vehicle routing - returning`
es: :ref:`Ejercicio 2: Ruteo de vehículos - regreso`

source: Query results for chapter 6 exercise 3
es: Resultados de la consulta para el ejercicio 3 del capítulo 6

source: :ref:`Exercise 3: Vehicle routing when time is money`
es: :ref:`Ejercicio 3: Ruteo de vehículos cuando el tiempo es dinero`

source: Query results for chapter 6 exercise 4
es: Resultados de la consulta para el ejercicio 4 del capítulo 6

source: :ref:`Exercise 4: Vehicle routing without penalization`
es: :ref:`Ejercicio 4: Ruteo de vehículos sin penalización`

source: Query results for chapter 6 exercise 5
es: Resultados de la consulta para el ejercicio 5 del capítulo 6

source: :ref:`Exercise 5: Vehicle routing with penalization`
es: :ref:`Ejercicio 5: Ruteo de vehículos con penalización`

source: Solutions to :doc:`chapter-7`
es: Soluciones para :doc:`chapter-7`

source: Query results for chapter 7 exercise 1
es: Resultados de la consulta para el ejercicio 1 del capítulo 7

source: :ref:`Exercise 1: Creating a view for routing`
es: :ref:`Ejercicio 1: Creación de una vista para el ruteo`

source: Query results for chapter 7 exercise 2
es: Resultados de la consulta para el ejercicio 2 del capítulo 7

source: :ref:`Exercise 2: Limiting the road network within an area`
es: :ref:`Ejercicio 2: Limitar la red viaria dentro de un área`

source: Query results for chapter 7 exercise 3
es: Resultados de la consulta para el ejercicio 3 del capítulo 7

source: :ref:`Exercise 3: Creating a materialized view for routing pedestrians`
es: :ref:`Ejercicio 3: Creación de una vista materializada para ruteo de los peatones`

source: Query results for chapter 7 exercise 4
es: Resultados de la consulta para el ejercicio 4 del capítulo 7

source: :ref:`Exercise 4: Testing the views for routing`
es: :ref:`Ejercicio 4: Probar las vistas para el ruteo`

source: Query results for chapter 7 exercise 5
es: Resultados de la consulta para el ejercicio 5 del capítulo 7

source: :ref:`Exercise 5: Get additional information`
es: :ref:`Ejercicio 5: Obtener información adicional`

source: Query results for chapter 7 exercise 6
es: Resultados de la consulta para el ejercicio 6 del capítulo 7

source: :ref:`Exercise 6: Route geometry (human readable)`
es: :ref:`Ejercicio 6: Geometría de la ruta (legible para humanos)`

source: Query results for chapter 7 exercise 7
es: Resultados de la consulta para el ejercicio 7 del capítulo 7

source: :ref:`Exercise 7: Route geometry (binary format)`
es: :ref:`Ejercicio 7: Geometría de ruta (formato binario)`

source: Query results for chapter 7 exercise 8
es: Resultados de la consulta para el ejercicio 8 del capítulo 7

source: :ref:`Exercise 8: Route geometry directionality`
es: :ref:`Ejercicio 8: Direccionalidad de la geometría de la ruta`

source: Query results for chapter 7 exercise 9
es: Resultados de la consulta para el ejercicio 9 del capítulo 7

source: :ref:`Exercise 9: Using the geometry`
es: :ref:`Ejercicio 9: Uso de la geometría`

source: Query results for chapter 7 exercise 10
es: Resultados de la consulta para el ejercicio 10 del capítulo 7

source: :ref:`Exercise 10: Function for an application`
es: :ref:`Ejercicio 10: Función para una aplicación`

source: Query results for chapter 7 exercise 11
es: Resultados de la consulta para el ejercicio 11 del capítulo 7

source: :ref:`Exercise 11: Using the function`
es: :ref:`Ejercicio 11: Uso de la función`

source: Solutions to :doc:`chapter-8`
es: Soluciones para :doc:`chapter-8`

source: Query results for chapter 8 exercise 1
es: Resultados de la consulta para el ejercicio 1 del capítulo 8

source: :ref:`Exercise 1: Number of Vertices`
es: :ref:`Ejercicio 1: Número de vértices`

source: For ``vehicle_net``:
es: Para ``vehicle_net``:

source: For ``taxi_net``:
es: Para ``taxi_net``:

source: For ``walk_net``:
es: Para ``walk_net``:

source: Query results for chapter 8 exercise 2
es: Resultados de la consulta para el ejercicio 2 del capítulo 8

source: :ref:`Exercise 2: Vertices on a table`
es: :ref:`Ejercicio 2: Vértices en una tabla`

source: Query results for chapter 8 exercise 3
es: Resultados de la consulta para el ejercicio 3 del capítulo 8

source: :ref:`Exercise 3: Nearest Vertex`
es: :ref:`Ejercicio 3: Vértice más cercano`

source: For ``vehicle_net_vertices_pgr``:
es: Para``vehicle_net_vertices_pgr``:

source: For ``taxi_net_vertices_pgr``:
es: Para ``taxi_net_vertices_pgr``:

source: For ``walk_net_vertices_pgr``:
es: Para ``walk_net_vertices_pgr``:

source: Query results for chapter 8 exercise 4
es: Resultados de la consulta para el ejercicio 4 del capítulo 8

source: :ref:`Exercise 4: Nearest vertex function`
es: :ref:`Ejercicio 4: Función de vértice más cercano`

source: Query results for chapter 8 exercise 5
es: Resultados de la consulta para el ejercicio 5 del capítulo 8

source: :ref:`Exercise 5: Test nearest vertex function`
es: :ref:`Ejercicio 5: Prueba de la función vértice más cercano`

source: Query results for chapter 8 exercise 6
es: Resultados de la consulta para el ejercicio 6 del capítulo 8

source: :ref:`Exercise 6: Creating the main function`
es: :ref:`Ejercicio 6: Creación de la función principal`

source: Query results for chapter 8 exercise 7
es: Resultados de la consulta para el ejercicio 7 del capítulo 8

source: :ref:`Exercise 7: Using the main function`
es: :ref:`Ejercicio 7: Uso de la función principal`

source: For ``vehicle_net``
es: Para ``vehicle_net``

source: For ``taxi_net``
es: Para ``taxi_net``

source: The ``WARNING`` message:
es: El mensaje ``ADVERTENCIA``:

source: The query results:
es: Los resultados de la consulta:

source: For ``walk_net``
es: Para ``walk_net``
