Repository: pgRouting/workshop
Catalog: locale/*/LC_MESSAGES/chapters/chapter-3.po
Languages: es

source: Installation
es: Instalación

source: All required tools are available on `OSGeoLive <http://live.osgeo.org>`__.
es: Todas las herramientas necesarias están disponibles en `OSGeoLive <http://live.osgeo.org>`__.

source: `OSGeoLive Quickstart for Running in a Virtual Machine <https://live.osgeo.org/en/quickstart/virtualization_quickstart.html>`__
es: `Inicio Rápido de OSGeoLive para Ejecutar en una Máquina Virtual <https://live.osgeo.org/en/quickstart/virtualization_quickstart.html>`__

source: `Creating an OSGeoLive Bootable USB flash drive <https://live.osgeo.org/en/quickstart/usb_quickstart.html>`__
es: `Creación de una unidad flash USB de arranque OSGeoLive <https://live.osgeo.org/en/quickstart/usb_quickstart.html>`__

source: Before attending a workshop event, make sure your you can use `OSGeoLive` with either method or :doc:`appendix-2` on your computer.
es: Antes de asistir a un evento de taller es necesario asegurarse de que puede utilizar `OSGeoLive` con el método o :doc:`appendix-2` en su ordenador.

source: This workshop uses OSGeoLive on VirtualBox
es: Este taller utiliza OSGeoLive en VirtualBox

source: OSGeoLive on a VirtualBox
es: OSGeoLive en una VirtualBox

source: Install `VirtualBox <https://www.virtualbox.org/>`__.
es: Instalar `VirtualBox <https://www.virtualbox.org/>`__.

source: Complete details about installation can be found on the `VirtualBox <https://www.virtualbox.org/>`__ documentation.
es: Los detalles completos sobre la instalación se encuentran en la documentación de `VirtualBox <https://www.virtualbox.org/>`__

source: Linux distributions:
es: Distribuciones de Linux:

source: Add the following line to your /etc/apt/sources.list. According to your distribution, replace '<mydist>' with your distribution name.
es: Agregar la siguiente línea a su /etc/apt/sources.list. Según su distribución, reemplazar '<mydist>' con su nombre de distribución.

source: Add the keys:
es: Agregar las teclas:

source: Install Virtual box using:
es: Instalación de Virtual box utilizando:

source: More detailed and up to date information can be found `here <https://www.virtualbox.org/wiki/Linux_Downloads>`__
es: Para encontrar información más detallada y actualizada consulte `aquí <https://www.virtualbox.org/wiki/Linux_Downloads>`__

source: Download OSGeoLive 14.0
es: Descargar OSGeoLive 14.0

source: The images on this section might not correspond to the VirtualBox version you installed. But the workflow is similar.
es: Es posible que las imágenes de esta sección no correspondan a la versión de VirtualBox que instaló. Pero el flujo de trabajo es similar.

source: Go to https://sourceforge.net/projects/osgeo-live/files/14.0/ and download *osgeolive-14.0-vmdk.7z*
es: Ir a https://sourceforge.net/projects/osgeo-live/files/14.0/ y descargar *osgeolive-14.0-vmdk.7z*

source: Open VirtualBox and click :menuselection:`New`
es: Abrir VirtualBox y hacer clic en :menuselection:`Nuevo`

source: Fill *name* and *operating system*
es: Llenar *nombre* y *sistema operativo*

source: Fill *memory size*: Use 2048
es: Llenar *tamaño de memoria*: Usar 2048

source: Fill *hard disk* & create
es: Llenar *disco duro* y crear

source: Fill *General* & Choose *bidirectional* (to be able o use the clipboard between your computer and the virtual machine.)
es: Llenar *General* y elegir *bidireccional* (para poder utilizar el portapapeles entre el ordenador y la máquina virtual.)

source: Double-click on *OSGeoLive14* & Read *Welcome message*
es: Doble clic en *OSGeoLive14* y leer *Mensaje de bienvenida*

source: Ready to use
es: Listo para usar

source: OSGeoLive's account is ``user`` and password is ``user``
es: La cuenta de OSGeoLive es ``user`` y la contraseña es ``user``
