Repository: pgRouting/workshop
Catalog: locale/*/LC_MESSAGES/chapters/chapter-2.po
Languages: es

source: About The Workshop
es: Sobre El Taller

source: This workshop use several free and open source software for geospatial tools. Most of the free and open source software for geospatial tools are related to other open source software projects and it would not be feasible to list all of them.
es: Este taller utiliza varios programas de código libre y abierto para herramientas geoespaciales. La mayoría del software gratuito y de código abierto para herramientas geoespaciales están relacionados con otros proyectos de software de código abierto y no sería factible enumerarlos todos ellos.

source: pgRouting Overview
es: Visión General de pgRouting

source: pgRouting extends the PostGIS / PostgreSQL geospatial database to provide geospatial routing functionality.
es: pgRouting amplía la base de datos geoespacial PostGIS / PostgreSQL para proporcionar funcionalidad de ruteo geoespacial.

source: Advantages of the database routing approach are:
es: Las ventajas del enfoque de base de datos de enrutamiento son:

source: Data and attributes can be modified by many clients, like QGIS or by directly using PL/pgSQL. The clients can either be personal computers or mobile devices.
es: Muchos clientes pueden modificar datos y atributos, como QGIS o mediante PL/pgSQL directamente. Los clientes pueden ser ordenadores personales o dispositivos móviles.

source: Data changes can be reflected instantaneously through the routing engine. There is no need for precalculation.
es: Los cambios de datos se pueden reflejar instantáneamente a través del motor de enrutamiento. No hay necesidad de precalculación.

source: The “cost” parameter can be dynamically calculated through SQL and its value can come from multiple fields or tables.
es: El parámetro "cost" se puede calcular dinámicamente a través de SQL y su valor puede provenir de varios campos o tablas.

source: Some of the pgRouting library core features are:
es: Algunas de las características principales de la biblioteca pgRouting son:

source: `Dijkstra Algorithm <https://docs.pgrouting.org/latest/en/pgr_dijkstra.html>`__
es: `Algoritmo Dijkstra <https://docs.pgrouting.org/latest/en/pgr_dijkstra.html>`__

source: `Johnson's Algorithm <https://docs.pgrouting.org/latest/en/pgr_johnson.html>`__
es: `Algoritmo de Johnson <https://docs.pgrouting.org/latest/en/pgr_johnson.html>`__

source: `Floyd-Warshall Algorithm <https://docs.pgrouting.org/latest/en/pgr_floydWarshall.html>`__
es: `Algoritmo de Floyd-Warshall <https://docs.pgrouting.org/latest/en/pgr_floydWarshall.html>`__

source: `A* Search Algorithm <https://docs.pgrouting.org/latest/en/pgr_aStar.html>`__
es: `A* Buscar Algoritmo <https://docs.pgrouting.org/latest/en/pgr_aStar.html>`__

source: `Traveling Salesperson Problem <https://docs.pgrouting.org/latest/en/pgr_TSP.html>`__
es: `Problema del Vendedor Viajero <https://docs.pgrouting.org/latest/en/pgr_TSP.html>`__

source: `Driving Distance <https://docs.pgrouting.org/latest/en/pgr_drivingDistance.html>`__
es: `Distancia de Manejo <https://docs.pgrouting.org/latest/en/pgr_drivingDistance.html>`__

source: many more!!!
es: muchos más!!!

source: pgRouting is an Open Source Software, available under the GPLv2 license and is supported and maintained by |georepublic|, |paragon| and a broad user community.
es: pgRouting es un Software de Código Abierto, disponible bajo la licencia GPLv2 y es compatible y mantenido por |georepublic|, |paragon| y una amplia comunidad de usuarios.

source: pgRouting is a part of `OSGeo Community Projects <https://wiki.osgeo.org/wiki/OSGeo_Community_Projects>`__ of the `OSGeo Foundation <https://www.osgeo.org>`__ and included on `OSGeoLive <https://live.osgeo.org/en/overview/pgrouting_overview.html>`__.
es: pgRouting forma parte de los `Proyectos de la Comunidad OSGeo <https://wiki.osgeo.org/wiki/OSGeo_Community_Projects>`__ de la `Fundación OSGeo <https://www.osgeo.org>`__ y está incluido en `OSGeoLive <https://live.osgeo.org/en/overview/pgrouting_overview.html>`__.

source: Website
es: Sitio web

source: osm2pgrouting Overview
es: Visión General de osm2pgrouting

source: osm2pgrouting is a command line tool that imports OpenStreetMap data into a pgRouting database. It builds the routing network topology automatically and creates tables for feature types and road classes. osm2pgrouting was primarily written by Daniel Wendt and is now hosted on the pgRouting project site.
es: osm2pgrouting es una herramienta de línea de comandos que importa datos OpenStreetMap en una base de datos pgRouting. Crea automáticamente la topología de red de enrutamiento y crea tablas para tipos de entidad y clases de carretera. osm2pgrouting fue escrito principalmente por Daniel Wendt y ahora está alojado en el sitio del proyecto pgRouting.

source: osm2pgrouting is available under the GPLv2 license.
es: osm2pgrouting está disponible bajo la licencia GPLv2.

source: OpenStreetMap Overview
es: Visión general de OpenStreetMap

source: "OpenStreetMap (OSM) is dedicated to creating and providing geographic data, such as street maps, worldwide, for free. Most maps considered "free" actually have legal or technical restrictions on their use. These restrictions hold back anyone from using them in creative, productive or unexpected ways, and make every map a silo of data and effort."
es: "OpenStreetMap (OSM) se dedica a crear y proporcionar datos geográficos, como mapas de calles, en todo el mundo, de forma gratuita. La mayoría de los mapas considerados "libres" en realidad tienen restricciones legales o técnicas en su uso. Estas restricciones impiden que cualquier persona las use de maneras creativas, productivas o inesperadas, y hacen de cada mapa un silo de datos y esfuerzo".

source: (Source: https://wiki.openstreetmap.org/wiki/Press)
es: (Fuente: https://wiki.openstreetmap.org/wiki/Press)

source: OpenStreetMap is an adequate data source for pgRouting, because it has no technical restrictions in terms of processing the data. Data availability still varies from country to country, but the worldwide coverage is improving day by day.
es: OpenStreetMap es un origen de datos adecuado para pgRouting, ya que no tiene restricciones técnicas en términos de procesamiento de los datos. La disponibilidad de datos todavía varía de un país a otro, pero la cobertura mundial está mejorando día a día.

source: OpenStreetMap uses a topological data structure:
es: OpenStreetMap utiliza una estructura de datos topológica:

source: Nodes are points with a geographic position.
es: Los nodos son puntos con una posición geográfica.

source: Ways are lists of nodes, representing a polyline or polygon.
es: Los caminos, son las listas de nodos que representan una polilínea o polígono.

source: Relations are groups of nodes, ways and other relations which can be assigned certain properties.
es: Las relaciones son grupos de nodos, caminos y otras relaciones que se les puede asignadar determinadas propiedades.

source: Properties can be assigned to nodes, ways or relations and consist of :code:`name = value` pairs.
es: Las propiedades se pueden asignar a nodos, formas o relaciones y constan de pares :code:`name = value` pairs.
