Repository: pgRouting/workshop
Catalog: locale/*/LC_MESSAGES/chapters/chapter-1.po
Languages: es

source: Introduction
es: Introducción

source: Abstract
es: Resumen

source: |pgrouting-web| adds routing functionality to |postgis-web|. This introductory workshop will demonstrate the routing functionality by providing practical examples using |osm-web| road network data. It will be covering topics starting from preparing the data, making routing queries, writing custom 'plpgsql' functions up to integrating pgRouting with other FOSS4G tools.
es: |pgrouting-web| añade funcionalidad de ruteo a |postgis-web|. Este taller introductorio demostrará la funcionalidad de ruteo proporcionando ejemplos prácticos utilizando datos |osm-web| de la red de carreteras. Se tratarán temas que comienzan desde la preparación de los datos, la realización de consultas de enrutamiento, la escritura de funciones personalizadas 'plpgsql' hasta la integración de pgRouting con otras herramientas FOSS4G.

source: Road networks navigation require complex graph algorithms. pgRouting is an extendible open-source library that provides a variety of tools for graph algorithms, including shortest path search, as an extension of PostgreSQL and PostGIS.
es: La navegación por redes de carretera requiere algoritmos gráficos complejos. pgRouting es una biblioteca de código abierto extensible que proporciona una variedad de herramientas para algoritmos de gráficos, incluida la búsqueda de rutas más corta, como una extensión de PostgreSQL y PostGIS.

source: The workshop will focus on real road networks of the FOSS4G Argentina surrounding area. It will cover the following topics:
es: El taller se centrará en las redes viales reales de la FOSS4G Argentina en los alrededores. Abarcará los siguientes temas:

source: Installing pgRouting.
es: Instalación de pgRouting.

source: Creating a routing topology.
es: Creación de una topología de ruteo.

source: Importing |osm-web| road network data.
es: Importación de |osm-web| datos de la red de carreteras.

source: Using pgRouting algorithms.
es: Uso de algoritmos pgRouting.

source: Writing advanced queries.
es: Escribir consultas avanzadas.

source: Writing a custom PostgreSQL stored procedure in ‘plpgsql’.
es: Escribir un procedimiento almacenado PostgreSQL personalizado en 'plpgsql'.

source: Please see the :doc:`contents <../index>` for full content of this workshop.
es: Consulte :doc:`contents <../index>` para obtener todo el contenido de este taller.

source: Prerequisites
es: Pre-requisitos

source: Workshop level: intermediate.
es: Nivel de taller: intermedio.

source: Attendee's previous knowledge: SQL (PostgreSQL, PostGIS)
es: Conocimiento previo del asistente: SQL (PostgreSQL, PostGIS)

source: Equipments: This workshop uses `OSGeoLive <https://live.osgeo.org>`__ (14.0)
es: Equipamientos: Este taller utiliza `OSGeoLive <https://live.osgeo.org>`__ (14.0)

source: Authors
es: Autores

source: Alphabetical Order:
es: orden alfabético:

source: *Daniel Kastl* is founder and CEO of `Georepublic <https://georepublic.info>`_ and works in Germany and Japan. He is moderating and promoting the pgRouting community and development since the beginning of the project, and he's an active OSM contributor in Japan. OSGeo Charter member.
es: *Daniel Kastl* es fundador y CEO de `Georepublic <https://georepublic.info>`_ y trabaja en Alemania y Japón. Él es moderador y promotor de la comunidad de pgRouting y un desarrollador desde el inicio de este proyecto, y es un colaborador activo de OSM en Japón. Miembro Fundador de OSGeo.

source: *Ko Nagase* works at `Georepublic <https://georepublic.info>`_ and works in Japan. tests of pgRouting project on Windows and Mac OSX environment. One of the contributors of pgRoutingLayers for QGIS. OSGeo Charter member.
es: *Ko Nagase* trabaja en `Georepublic <https://georepublic.info>`_ , en Japón. Realiza pruebas del proyecto pgRouting en entornos Windows y Mac OSX. Uno de los contribuyentes de pgRoutingLayers para QGIS y Miembro Fundador de OSGeo.

source: *Stephen Woodbridge* works at the greater Boston, MA area. He was a pgrouting PSC member and developer. He develops solutions for mapping, geocoding, reverse geocoding, routing and processing of remote sensing imagery. OSGeo Charter member.
es: *Stephen Woodbridge* trabaja en el área metropolitana de Boston, MA. Era un miembro y desarrollador de PSC. Desarrolla soluciones para mapeo, geocodificación, geocodificación inversa, enrutamiento y procesamiento de imágenes de teledetección. Miembro Fundador de OSGeo.

source: *Vicky Vergara* works at `Georepublic <https://georepublic.info>`_ and works in Mexico. She's the core developer of pgRouting project and GSoC Mentor. OSGeo Charter member.
es: *Vicky Vergara* trabaja en `Georepublic <https://georepublic.info>` _, en México. Ella es la desarrolladora principal del proyecto pgRouting y GSoC Mentor. Miembro Fundador de OSGeo.

source: License
es: Licencias

source: This work is licensed under a `Creative Commons Attribution-Share Alike 3.0 License <https://creativecommons.org/licenses/by-sa/3.0/>`_.
es: Esta obra está autorizada bajo una licencia `Creative Commons Attribution-Share Alike 3.0 License <https://creativecommons.org/licenses/by-sa/3.0/>`_.

source: Supported by
es: Apoyado por
