Repository: pgRouting/workshop
Catalog: locale/*/LC_MESSAGES/advanced/chapter-12.po
Languages: es

source: Create a Network Topology
es: Crear una topología de red

source: :doc:`osm2pgrouting <../appendix/appendix-3>` is a convenient tool, and its focus to work on OpenStreetMap data. There are several cases where :doc:`osm2pgrouting <../appendix/appendix-3>` can't be used. Some network data already comes with a network topology that can be used with pgRouting out-of-the-box. Often network data is stored in Shape file format (``.shp``) and we can use PostGIS' ``shp2pgsql`` converter to import the data into a PostgreSQL database.
es: :doc:`osm2pgrouting <../appendix/appendix-3>` es una herramienta conveniente y su enfoque es trabajar con datos de OpenStreetMap. Hay varios casos en los que :doc:`osm2pgrouting <../appendix/appendix-3>` no se puede utilizar. Algunos datos de red ya vienen con una topología de red que se puede usar con pgRouting out-of-the-box. A menudo, los datos de red se almacenan en formato de archivo Shape (``.shp``) y podemos usar el convertidor de PostGIS' ``shp2pgsql`` para importar los datos a una base de datos PostgreSQL.

source: But what to do then?
es: ¿Pero qué hacer entonces?

source: In this chapter you will learn how to create a basic `Routing Network Topology` from a network data that does not have a routing Topology create the minimum attributes needed the `Routing Network Topology`.
es: En este capítulo aprenderá a crear una `Topología de Red de Ruteo` básica a partir de datos de red que no tiene una Topología de ruteo crear los atributos mínimos necesarios para la `Topología de Red de Ruteo`.

source: Chapter contents
es: Contenido del capítulo

source: Load network data
es: Cargar los datos de la red

source: At first we will load OpenStreetMap sample data with osm2pgsql.
es: Al principio cargaremos datos de muestra de OpenStreetMap con osm2pgsql.

source: Let's see which tables have been created:
es: Veamos qué tablas se han creado:

source: Run: ``psql -U user -d osm_data -c "\d"``
es: Ejecutar: ``psql -U user -d osm_data -c "\d"``

source: The table containing the road network data has the name ``planet_osm_roads``. It consists of large amount of attributes.
es: La tabla que contiene los datos de la red de carreteras tiene el nombre ``planet_osm_roads``. Consta de una gran cantidad de atributos.

source: Run: ``psql -U user -d osm_data -c "\d planet_osm_roads"``
es: Ejecutar: ``psql -U user -d osm_data -c "\d planet_osm_roads"``

source: It is common that road network data provides at least the following information:
es: Es común que datos de la red carretera proporcionen al menos la siguiente información:

source: Road link ID (gid)
es: ID del Camino (gid)

source: Road class (class_id)
es: Clase de camino (class_id)

source: Road link length (length)
es: Longitud del camino (length)

source: Road name (name)
es: Nombre del camino (name)

source: Road geometry (the_geom)
es: Geometría del camino (the_geom)

source: This allows to display the road network as a PostGIS layer in GIS software, for example in QGIS. Though it is not sufficient for routing, because it doesn't contain network topology information.
es: Esto permite para visualizar la red de carreteras como una capa PostGIS en software GIS, por ejemplo en QGIS. Aunque no es suficiente para el enrutamiento, porque no contiene información de la topología de red.

source: The next steps will use the PostgreSQL command line tool.
es: Los pasos siguientes utilizarán la herramienta de línea de comandos PostgreSQL.

source: Create a Routing Network Topology
es: Crear una Topología de Red de Ruteo

source: Having your data imported into a PostgreSQL database might require one more step for pgRouting.
es: Tener los datos importados en una base de datos PostgreSQL puede requerir un paso más para pgRouting.

source: Make sure that your data provides a correct `Routing Network Topology`, which consists of information about source and target identifiers for each road link. The results above, show that the network topology does not have any source and target information.
es: Asegurarse de que los datos proporcionan una correcta `Red Topológica de ruteo` que consta de información sobre los identificadores de origen y destino para cada vínculo de carretera. Los resultados anteriores muestran que la topología de red no tiene ninguna información de origen y destino.

source: Creation of the `Routing Network Topology` is necessary.
es: Es necesaria la creación de la `Topología de Red de Ruteo`.

source: PostGIS topology is not suitable for Routing.
es: La topología postGIS no es adecuada para ruteo.

source: pgRouting provides a general way for creating the `Routing Network Topology` with the ``pgr_createTopology`` function.
es: pgRouting proporciona una forma general de crear la `Topología de Red de Ruteo` con la función ``pgr_createTopology`` .

source: This function:
es: Esta función:

source: Assigns a ``source`` and a ``target`` identifiers to each road link
es: Asigna identificadores de ``source`` y ``target`` a cada enlace de carretera

source: It can logically "snap" nearby vertices within a certain tolerance by assigning the same identifier.
es: Puede "ajustar" lógicamente los vértices cercanos dentro de una cierta tolerancia asignando el mismo identificador.

source: Creates a vertices table related to it.
es: Crea una tabla de vértices relacionada con ella.

source: Creates the basic indices.
es: Crea los índices básicos.

source: For additional information see `pgr_createTopology <https://docs.pgrouting.org/latest/en/pgr_createTopology.html>`_.
es: Para obtener más información, consultar `pgr_createTopology <https://docs.pgrouting.org/latest/en/pgr_createTopology.html>`_.

source: First add source and target column, then run the ``pgr_createTopology`` function ... and wait.
es: Primero, agregar la columna de origen y destino y, a continuación, ejecutar la función ``pgr_createTopology`` ... esperar.

source: Depending on the network size this process may take from minutes to hours.
es: Dependiendo del tamaño de la red, este proceso puede tardar de minutos a horas.

source: Progress indicator can be read with PostgreSQL NOTICE
es: Indicador de progreso se puede leer con PostgreSQL NOTICE

source: It will also require enough memory (RAM or SWAP partition) to store temporary data.
es: También requerirá suficiente memoria (partición RAM o SWAP) para almacenar datos temporales.

source: The dimension of the tolerance parameter depends on your data projection. Usually it's either "degrees" or "meters". In our example the geometry data projection to determine the tolerance:
es: La dimensión del parámetro de tolerancia depende de la proyección de datos. Por lo general, son "grados" o "metros". En nuestro ejemplo, la proyección de datos de geometría para determinar la tolerancia:

source: Based on this result the tolerance will be 0.00001
es: En base a este resultado, la tolerancia será 0.00001

source: Verify the Routing Network Topology
es: Verifique la Topología de Red de Ruteo

source: To verify that there is a basic `Routing Network Topology`:
es: Para verificar que hay una `Topología de Red de Ruteo` básica:

source: Also a new table containing the vertices information was created:
es: También se creó una nueva tabla que contiene la información de vértices:

source: ``id`` is the vertex identifier
es: ``id`` es el identificador de vértice

source: ``the_geom`` is the geometry considered for that particular vertex identifier.
es: ``the_geom`` es la geometría considerada para ese identificador de vértice en particular.

source: ``source`` and ``target`` from the ``planet_osm_roads`` correspond to an ``id`` in ``planet_osm_roads_vertices_pgr`` table
es: ``source`` y ``target`` del ``planet_osm_roads`` corresponden a un ``id`` en la tabla ``planet_osm_roads_vertices_pgr``

source: Additional columns are for analyzing the topology.
es: Las columnas adicionales son para analizar la topología.

source: Now we are ready for our first routing query with :ref:`basic/pedestrian:pgr_dijkstra`
es: Ahora estamos listos para nuestra primera consulta de enrutamiento con :ref:`basic/pedestrian:pgr_dijkstra`

source: Analyze and Adjust the Routing Network Topology
es: Analizar y ajustar la Topología de Red de Ruteo

source: Analyzing the topology with `pgr_analyzeGraph <https://docs.pgrouting.org/latest/en/pgr_analyzeGraph.html>`_:
es: Analizando la topología con `pgr_analyzeGraph <https://docs.pgrouting.org/latest/en/pgr_analyzeGraph.html>`_:

source: Adjusting the topology is not an easy task:
es: Ajustar la topología no es una tarea fácil:

source: Is an isolated segment an error in the data?
es: ¿Es un segmento aislado un error en los datos?

source: Is an isolated segment because its on the edge of the bounding box?
es: ¿Es un segmento aislado porque está en el borde del cuadro delimitador?

source: Do the potential gaps found near dead ends because the tolerance was too small?
es: ¿Las brechas potenciales encontradas cerca de los sin salida porque la tolerancia era demasiado pequeña?

source: Are the intersections real intersections and need to be nodded?
es: ¿Las intersecciones son verdaderas intersecciones y necesitan ser admitidas?

source: Are the intersections bridges or tunnels and do not need to be nodded?
es: ¿Las intersecciones son puentes o túneles y no necesitan ser admitidos?

source: Depending on the application some adjustments need to be made.
es: Dependiendo de la aplicación es necesario realizar algunos ajustes.

source: Some `topology manipulation <https://docs.pgrouting.org/latest/en/topology-functions.html>`_ functions help to detect and fix some of the topological errors in the data.
es: algunas funciones de `topology manipulation <https://docs.pgrouting.org/latest/en/topology-functions.html>`_ ayudan a detectar y reparar algunos errores topológicos en los datos.
