Repository: pgRouting/workshop
Catalog: locale/*/LC_MESSAGES/un_sdg/appendix.po
Languages: es

source: Appendix: OSGeo UN Challenge Workshop Solutions
es: Apéndice: OSGeo Soluciones del taller de ONU - ODS

source: Solutions to Chapter 3: :doc:`sdg3-health`
es: Soluciones al Capítulo 3: :doc:`sdg3-health`

source: **Exercise:** 5 (**Chapter:** SDG 3)
es: **Ejercicio:** 5 (**Capítulo:** SDG 3)

source: :ref:`un_sdg/sdg3-health:Exercise 5: Counting the number of Roads and Buildings`
es: :ref:`un_sdg/sdg3-health:Ejercicio 5: Contar el número de carreteras y edificios`

source: **Exercise:** 6 (**Chapter:** SDG 3)
es: **Ejercicio:** 6 (**Capítulo:** ODS 3)

source: :ref:`un_sdg/sdg3-health:Exercise 6: Add a spatial column to the table`
es: :ref:`un_sdg/sdg3-health:Ejercicio 6: Añadir una columna espacial a la tabla`

source: **Exercise:** 7 (**Chapter:** SDG 3)
es: **Ejercicio:** 7 (**Capítulo:** ODS 3)

source: :ref:`un_sdg/sdg3-health:Exercise 7: Removing the polygons with less than 4 points`
es: :ref:`un_sdg/sdg3-health:Ejercicio 7: Extracción de los polígonos con menos de 4 puntos`

source: **Exercise:** 8 (**Chapter:** SDG 3)
es: **Ejercicio:** 8 (**Capítulo:** ODS 3)

source: :ref:`un_sdg/sdg3-health:Exercise 8: Creating the polygons`
es: :ref:`un_sdg/sdg3-health:Ejercicio 8: Creación de los polígonos`

source: **Exercise:** 9 (**Chapter:** SDG 3)
es: **Ejercicio:** 9 (**Capítulo:** ODS 3)

source: :ref:`un_sdg/sdg3-health:Exercise 9: Calculating the area`
es: :ref:`un_sdg/sdg3-health:Ejercicio 9: Cálculo del área`

source: **Exercise:** 10 (**Chapter:** SDG 3)
es: **Ejercicio:** 10 (**Capítulo:** ODS 3)

source: :ref:`un_sdg/sdg3-health:Exercise 10: Find the Component ID for Road vertices`
es: :ref:`un_sdg/sdg3-health:Ejercicio 10: Buscar el identificador de componente para los vértices de carretera`

source: **Exercise:** 11 (**Chapter:** SDG 3)
es: **Ejercicio:** 11 (**Capítulo:** ODS 3)

source: :ref:`un_sdg/sdg3-health:Exercise 11: Finding the components which are to be removed`
es: :ref:`un_sdg/sdg3-health:Ejercicio 11: Encontrar los componentes que deben eliminarse`

source: **Exercise:** 12 (**Chapter:** SDG 3)
es: **Ejercicio:** 12 (**Capítulo:** ODS 3)

source: :ref:`un_sdg/sdg3-health:Exercise 12: Finding the road vertices of these components`
es: :ref:`un_sdg/sdg3-health:Ejercicio 12: Encontrar los vértices de estos componentes`

source: **Exercise:** 13 (**Chapter:** SDG 3)
es: **Ejercicio:** 13 (**Capítulo:** ODS 3)

source: :ref:`un_sdg/sdg3-health:Exercise 13: Removing the unwanted edges and vertices`
es: :ref:`un_sdg/sdg3-health:Ejercicio 13: Eliminación de las aristas y vértices no deseados`

source: **Exercise:** 15 (**Chapter:** SDG 3)
es: **Ejercicio:** 15 (**Capítulo:** ODS 3)

source: :ref:`un_sdg/sdg3-health:Exercise 15: Finding the served roads using pgr_drivingDistance`
es: :ref:`un_sdg/sdg3-health:Ejercicio 15: Encontrar las carreteras servidas usando pgr_drivingDistance`

source: **Exercise:** 16 (**Chapter:** SDG 3)
es: **Ejercicio:** 16 (**Capítulo:** ODS 3)

source: :ref:`un_sdg/sdg3-health:Exercise 16: Generalising the served roads`
es: :ref:`un_sdg/sdg3-health:Ejercicio 16: Generalización de las carreteras servidas`

source: **Exercise:** 17 (**Chapter:** SDG 3)
es: **Ejercicio:** 17 (**Capítulo:** ODS 3)

source: :ref:`un_sdg/sdg3-health:Exercise 17: Estimating the population of buildings`
es: :ref:`un_sdg/sdg3-health:Ejercicio 17: Estimación de la población de edificios`

source: **Exercise:** 18 (**Chapter:** SDG 3)
es: **Ejercicio:** 18 (**Capítulo:** ODS 3)

source: :ref:`un_sdg/sdg3-health:Exercise 18: Finding the nearest roads to store the population`
es: :ref:`un_sdg/sdg3-health:Ejercicio 18: Encontrar las carreteras más cercanas para almacenar a la población`

source: **Exercise:** 19 (**Chapter:** SDG 3)
es: **Ejercicio:** 19 (**Capítulo:** ODS 3)

source: :ref:`un_sdg/sdg3-health:Exercise 19: Storing the population in the roads`
es: :ref:`un_sdg/sdg3-health:Ejercicio 19: Almacenar la población en las carreteras`

source: **Exercise:** 20 (**Chapter:** SDG 3)
es: **Ejercicio:** 20 (**Capítulo:** ODS 3)

source: :ref:`un_sdg/sdg3-health:Exercise 20: Finding total population`
es: :ref:`un_sdg/sdg3-health:Ejercicio 20: Encontrar la población total`

source: Solutions to :doc:`sdg7-energy`
es: Soluciones para :doc:`sdg7-energy`

source: **Exercise:** 5 (**Chapter:** SDG 7)
es: **Ejercicio:** 5 (**Capítulo:** ODS 7)

source: :ref:`un_sdg/sdg7-energy:Exercise 5: Counting the number of Roads`
es: :ref:`un_sdg/sdg7-energy:Ejercicio 5: Contar el número de carreteras`

source: **Exercise:** 6 (**Chapter:** SDG 7)
es: **Ejercicio:** 6 (**Capítulo:** ODS 7)

source: :ref:`un_sdg/sdg7-energy:Exercise 6: Find the Component ID for Road vertices`
es: :ref:`un_sdg/sdg7-energy:Ejercicio 6: Buscar el identificador de componente para los vértices de carretera`

source: **Exercise:** 7 (**Chapter:** SDG 7)
es: **Ejercicio:** 7 (**Capítulo:** ODS 7)

source: :ref:`un_sdg/sdg7-energy:Exercise 7: Finding the components which are to be removed`
es: :ref:`un_sdg/sdg7-energy:Ejercicio 7: Encontrar los componentes que deben eliminarse`

source: **Exercise:** 8 (**Chapter:** SDG 7)
es: **Ejercicio:** 8 (**Capítulo:** ODS 7)

source: :ref:`un_sdg/sdg7-energy:Exercise 8: Finding the road vertices of these components`
es: :ref:`un_sdg/sdg7-energy:Ejercicio 8: Encontrar los vértices de la carretera de estos componentes`

source: **Exercise:** 9 (**Chapter:** SDG 7)
es: **Ejercicio:** 9 (**Capítulo:** ODS 7)

source: :ref:`un_sdg/sdg7-energy:Exercise 9: Removing the unwanted edges and vertices`
es: :ref:`un_sdg/sdg7-energy:Ejercicio 9: Eliminación de las aristas y vértices no deseados`

source: **Exercise:** 10 (**Chapter:** SDG 7)
es: **Ejercicio:** 10 (**Capítulo:** ODS 7)

source: :ref:`un_sdg/sdg7-energy:Exercise 10: Find the minimum spanning tree`
es: :ref:`un_sdg/sdg7-energy:Ejercicio 10: Encontrar el árbol de expansión mínimo`

source: **Exercise:** 11 (**Chapter:** SDG 7)
es: **Ejercicio:** 11 (**Capítulo:** ODS 7)

source: :ref:`un_sdg/sdg7-energy:Exercise 11: Compute total length of material required in km`
es: :ref:`un_sdg/sdg7-energy:Ejercicio 11: Calcular la longitud total del material requerido en km`

source: **Exercise:** 12 (**Chapter:** SDG 7)
es: **Ejercicio:** 12 (**Capítulo:** ODS 7)

source: :ref:`un_sdg/sdg7-energy:Exercise 12: Compute total length of roads`
es: :ref:`un_sdg/sdg7-energy:Ejercicio 12: Calcular la longitud total de las carreteras`

source: Solutions to :doc:`sdg11-cities`
es: Soluciones para :doc:`sdg11-cities`

source: **Exercise:** 1 (**Chapter:** SDG 11)
es: **Ejercicio:** 1 (**Capítulo:** ODS 11)

source: :ref:`un_sdg/sdg11-cities:Exercise 1: Create a point for the city`
es: :ref:`un_sdg/sdg11-cities:Ejercicio 1: Crear un punto para la ciudad`

source: **Exercise:** 6 (**Chapter:** SDG 11)
es: **Ejercicio:** 6 (**Capítulo:** ODS 11)

source: :ref:`un_sdg/sdg11-cities:Exercise 6: Counting the number of Waterways`
es: :ref:`un_sdg/sdg11-cities:Ejercicio 6: Contar el número de vías navegables`

source: **Exercise:** 7 (**Chapter:** SDG 11)
es: **Ejercicio:** 7 (**Capítulo:** ODS 11)

source: :ref:`un_sdg/sdg11-cities:Exercise 7: Removing the Rivers which are in swamps`
es: :ref:`un_sdg/sdg11-cities:Ejercicio 7: Eliminar los ríos que están en pantanos`

source: **Exercise:** 8 (**Chapter:** SDG 11)
es: **Ejercicio:** 8 (**Capítulo:** ODS 11)

source: :ref:`un_sdg/sdg11-cities:Exercise 8: Get the Connected Components of Waterways`
es: :ref:`un_sdg/sdg11-cities:Ejercicio 8: Obtener los componentes conectados de las vías fluviales`

source: **Exercise:** 9 (**Chapter:** SDG 11)
es: **Ejercicio:** 9 (**Capítulo:** ODS 11)

source: :ref:`un_sdg/sdg11-cities:Exercise 9: Creating buffer around the city`
es: :ref:`un_sdg/sdg11-cities:Ejercicio 9: Crear una zona límite alrededor de la ciudad`

source: **Exercise:** 11 (**Chapter:** SDG 11)
es: **Ejercicio:** 11 (**Capítulo:** ODS 11)

source: :ref:`un_sdg/sdg11-cities:Exercise 11: Finding the components intersecting the buffer`
es: :ref:`un_sdg/sdg11-cities:Ejercicio 11: Encontrar los componentes que intersectan la zona limitada`

source: **Exercise:** 12 (**Chapter:** SDG 11)
es: **Ejercicio:** 12 (**Capítulo:** ODS 11)

source: :ref:`un_sdg/sdg11-cities:Exercise 12: Get the rain zones`
es: :ref:`un_sdg/sdg11-cities:Ejercicio 12: Obtener las zonas de lluvia`

source: **Exercise:** 13 (**Chapter:** SDG 11)
es: **Ejercicio:** 13 (**Capítulo:** ODS 11)

source: :ref:`un_sdg/sdg11-cities:Exercise 13: Create a union of rain zones`
es: :ref:`un_sdg/sdg11-cities:Ejercicio 13: Crear una unión de zonas de lluvia`
