Repository: pgRouting/workshop
Catalog: locale/*/LC_MESSAGES/un_sdg/data.po
Languages: es

source: Data for Sustainable Development Goals
es: Datos para los Objetivos de Desarrollo Sostenible

source: To be able to use pgRouting, data has to be imported into a database. This chapter will use ``osm2pgrouting`` to get that the data from OpenStreetMaps(OSM). This data will be used for exercises in further chapters.
es: Para poder utilizar pgRouting, los datos deben importarse a una base de datos. Este capítulo usará ``osm2pgrouting`` para obtener los datos de OpenStreetMaps (OSM). Estos datos se utilizarán para ejercicios en capítulos posteriores.

source: Chapter Contents
es: Contenido del Capítulo

source: Work Directory for pgRouting data manipulation
es: Directorio de trabajo para la manipulación de datos de pgRouting

source: Mumbai database
es: Base de datos de Mumbai

source: pgRouting is pre-installed as an extension which requires:
es: pgRouting está preinstalado como una extensión que requiere:

source: Supported PostgreSQL version
es: Versión PostgreSQL compatible

source: Supported PostGIS version
es: Versión PostGIS compatible

source: If you don't have pgRouting installed. You can find the installation procedure at this `link <https://docs.pgrouting.org/latest/en/pgRouting-installation.html>`__
es: Si no está pgRouting instalado. Se puede encontrar el procedimiento de instalación en este `enlace <https://docs.pgrouting.org/latest/en/pgRouting-installation.html>`__

source: Create Mumbai database compatible with pgRouting
es: Crear base de datos de Mumbai compatible con pgRouting

source: Use the following command to create ``mumbai`` database
es: Utilice el siguiente comando para crear la base de datos ``mumbai``

source: To connect to the database do the following
es: Para conectarse a la base de datos, haga lo siguiente

source: After connecting to the database, first step is to create ``EXTENSION`` to enable pgRouting and PostGIS in the database. Then add the ``SCHEMA`` for each table.
es: Después de conectarse a la base de datos, el primer paso es crear ``EXTENSION`` para habilitar pgRouting y PostGIS en la base de datos. A continuación, agregue el `SCHEMA`` para cada tabla.

source: Get the Mumbai Data
es: Obtenga los datos de Mumbai

source: The pgRouting workshop will make use of OpenStreetMap data of an area in Mumbai City. The instructions for downloading the data are given below.
es: El taller pgRouting hará uso de los datos de OpenStreetMap de un área en la ciudad de Mumbai. Las instrucciones para descargar los datos se dan a continuación.

source: Downloading Mumbai data from OSGeo
es: Descarga de datos de Mumbai desde OSGeo

source: The following command is used to download the snapshot of the Mumbai area data used in this workshop, using the download service of OSGeo.
es: El siguiente comando se utiliza para descargar la instantánea de los datos del área de Mumbai utilizados en este taller, utilizando el servicio de descarga de OSGeo.

source: The Mumbai data for this workshop depends on this `snapshot <http://download.osgeo.org/pgrouting/workshops/mumbai.osm.bz2>`__.
es: Los datos de Mumbai para este taller depende de ésta `instantanea <http://download.osgeo.org/pgrouting/workshops/mumbai.osm.bz2>`__.

source: Downloading Mumbai data from OpenStreetMap (OSM)
es: Descarga de datos de Mumbai desde OpenStreetMap (OSM)

source: The following command is used to download the OpenStreetMap data of the area in Mumbai, India.
es: El siguiente comando se utiliza para descargar los datos de OpenStreetMap del área en Mumbai, India.

source: OpenStreetMap data changes on a day to day basis, therefore if this data is used, the results might change and some queries might need adjustments. The command was used to take the snapshot of the data on June 2021.
es: Los datos de OpenStreetMap cambian día a día, por lo tanto, si se utilizan estos datos, los resultados pueden cambiar y algunas consultas pueden necesitar ajustes. El comando se utilizó para tomar la instantánea de los datos en junio de 2021.

source: Upload Mumbai data to the database
es: Cargar datos de Mumbai en la base de datos

source: The next step is to run ``osm2pgrouting`` converter, which is a command line tool that inserts the data in the database, "ready" to be used with pgRouting. See :doc:`../appendix/appendix-3` for additional information about ``osm2pgrouting``.
es: El siguiente paso es ejecutar el convertidor ``osm2pgrouting'', que es una herramienta de línea de comandos que inserta los datos en la base de datos, "listo" para ser utilizado con pgRouting. Puede encontrar información adicional sobre ``osm2pgrouting`` en :doc:`../appendix/appendix-3`

source: For this step the following is used:
es: Para este paso se utiliza lo siguiente:

source: ``mumbai_buildings.xml`` and ``mumbai_roads.xml`` configuration files for osm2pgrouting.
es: Archivos de configuración ``mumbai_buildings.xml`` y ``mumbai_roads.xml`` para osm2pgrouting.

source: ``~/Desktop/workshop/mumbai.osm`` - OSM data from the previous step
es: ``~/Desktop/workshop/mumbai.osm`` - Datos de OSM del paso anterior

source: ``mumbai`` database.
es: Base de datos ``mumbai``.

source: Contents of the configuration files are given in the `Appendix`_. Create a XML file using these contents and save it into the root directory ``~/Desktop/workshop``.
es: El contenido de los archivos de configuración se indican en el `Apéndice`_. Crear un archivo XML utilizando estos contenidos y guardar en el directorio raíz ``~/Desktop/workshop``.

source: Open a terminal window by ``ctrl-alt-t`` and move to the workshop directory by ``cd ~/Desktop/workshop``. The following ``osm2pgrouting`` command will be used to convert the osm files to pgRouting friendly format which we will use for further exercises.
es: Abrir una ventana de terminal con ``ctrl-alt-t`` y navegar al directorio del taller ``cd ~/Desktop/workshop``. El siguiente comando ``osm2pgrouting`` se utilizará para convertir los archivos osm a un formato amigable a pgRouting que usaremos para ejercicios posteriores.

source: Importing Mumbai Roads
es: Importación de los caminos de Mumbai

source: The following ``osm2pgrouting`` command will be used to import the Roads from OpenStreetMaps file to pgRouting database which we will use for further exercises.
es: El siguiente comando ``osm2pgrouting`` se utilizará para importar los caminos del archivo de OpenStreetMap a la base de datos pgRouting los cuales usaremos para ejercicios posteriores.

source: Depending on the osm2pgrouting version `-W password` is needed
es: Dependiendo de la versión osm2pgrouting `-W password` es necesario

source: Output:
es: Salida:

source: Importing Mumbai Buildings
es: Importación de edificios de Mumbai

source: Similar to Roads, ``osm2pgrouting`` command will be used to import the Buildings from OpenStreetMaps file to pgRouting database which we will use for further exercises.
es: Similar a los caminos, el comando ``osm2pgrouting`` se utilizará para importar los edificios desde el archivo de OpenStreetMaps a la base de datos pgRouting que usaremos para ejercicios posteriores.

source: To connect to the database, type the following in the terminal.
es: Para conectarse a la base de datos, escribir lo siguiente en el terminal.

source: Bangladesh database
es: Base de datos de Bangladesh

source: Now download the data for an area in Bangladesh by following the same steps like that of Mumbai.
es: Ahora descargar los datos de un área en Bangladesh siguiendo los mismos pasos que el de Mumbai.

source: Create Bangladesh area database compatible with pgRouting
es: Crear una base de datos de área de Bangladesh compatible con pgRouting

source: Use the following command to create ``bangladesh`` database
es: Utilice el siguiente comando para crear la base de datos ``bangladesh``

source: Get the Bangladesh Data
es: Obtener los datos de Bangladesh

source: Downloading Bangladesh data from OSGeo
es: Descarga de datos de Bangladesh desde OSGeo

source: The following command is used to download the snapshot of the Bangladesh area data used in this workshop, using the download service of OSGeo.
es: El siguiente comando se utiliza para descargar la instantánea de los datos del área de Bangladesh utilizados en este taller, utilizando el servicio de descarga de OSGeo.

source: The Bangladesh data for this workshop depends on this `snapshot <http://download.osgeo.org/pgrouting/workshops/bangladesh.osm.bz2>`__.
es: Los datos de Bangladesh para este taller depende de ésta `instantanea <http://download.osgeo.org/pgrouting/workshops/bangladesh.osm.bz2>`__.

source: Downloading Bangladesh data from OpenStreetMap
es: Descarga de datos de Bangladesh desde OpenStreetMap

source: The following command is used to download the OSM data of the area in Munshigang, Bangladesh.
es: El siguiente comando se utiliza para descargar los datos OSM del área en Munshigang, Bangladesh.

source: Upload Bangladesh data to the database
es: Cargar datos de Bangladesh en la base de datos

source: ``waterways.xml`` configuration file
es: Archivo de configuración ``waterways.xml``

source: ``~/Desktop/workshop/bangladesh.osm`` - OSM data from the previous step
es: ``~/Desktop/workshop/bangladesh.osm`` - Datos de OSM del paso anterior

source: ``bangladesh`` database
es: Base de datos ``bangladesh``

source: Open a terminal window by ``ctrl-alt-t`` and move to the workshop directory by ``cd ~/Desktop/workshop``.
es: Abra una ventana de terminal con ``ctrl-alt-t`` y vaya al directorio del taller por ``cd ~/Desktop/workshop``.

source: Importing Bangladesh Waterways
es: Importación de vías navegables de Bangladesh

source: The following ``osm2pgrouting`` command will be used to import the Waterways from OpenStreetMaps file to pgRouting database which we will use for further exercises.
es: El siguiente comando de ``osm2pgrouting`` se utilizará para importar las vías navegables desde el archivo OpenStreetMaps a la base de datos pgRouting que usaremos para ejercicios posteriores.

source: Appendix
es: Apéndice

source: Configuration information for Buildings
es: Información de configuración para edificios

source: Configuration information for Waterways
es: Información de configuración para vías navegables
