Repository: pgRouting/workshop
Catalog: locale/*/LC_MESSAGES/un_sdg/introduction.po
Languages: es

source: Achieving Sustainable Development Goals with pgRouting
es: Alcanzar los Objetivos de Desarrollo Sostenible con pgRouting

source: History
es: Historia

source: The `UN OpenGIS initiative <http://unopengis.org/unopengis/main/main.php>`__ along with `OSGeo Foundation <https://www.osgeo.org/>`__ organized the `OSGeo UN Committee Educational Challenge <https://www.osgeo.org/foundation-news/2021-osgeo-un-committee-educational-challenge>`__ where Challenge 2 was to create Workshop material for pgRouting. The challenge supports the objectives of the OSGeo UN Committee, i.e. promoting the development and use of open-source software that meets UN needs and supports the aims of the UN. pgRouting is not only useful for routing cars on roads but it can also be used to analyse water distribution networks, river flow or the connectivity of an electricity network. Currently, this workshop expands the pgRouting workshop by addressing Three of the Seventeen Sustainable Development Goals
es: La `Iniciativa OpenGIS de la ONU <http://unopengis.org/unopengis/main/main.php>`__ junto con la `Fundación OSGeo <https://www.osgeo.org/>`__ organizaron el 'Desafío Educativo del Comité de la ONU OSGeo <https://www.osgeo.org/foundation-news/2021-osgeo-un-committee-educational-challenge>`__ donde el Desafío 2 fue crear material del Taller para pgRouting. El desafío apoya los objetivos del Comité OSGeo para las Naciones Unidas, es decir, promover el desarrollo y el uso de software de código abierto que satisfaga las necesidades de las Naciones Unidas y apoye los objetivos de las Naciones Unidas. pgRouting no solo es útil para enrutar automóviles en carreteras, sino que también se puede utilizar para analizar redes de distribución de agua, flujo pluvial o la conectividad de una red eléctrica. Actualmente, este taller amplía el taller pgRouting al abordar tres de los diecisiete Objetivos de Desarrollo Sostenible

source: Chapter Contents
es: Contenido del Capítulo

source: United Nations
es: Organización de las Naciones Unidas

source: UN Flag
es: Bandera de la ONU

source: `Image Source <https://research.un.org/en/maps/flags/>`__
es: 'Fuente de la imagen <https://research.un.org/en/maps/flags/>`__

source: The United Nations (UN) is an intergovernmental organization founded in 1945 that aims to maintain international peace and security and develop friendly relations among nations to achieve international cooperation. The UN has its headquarters in New York City in an international territory and has other main offices in Geneva, Nairobi, Vienna, and The Hague.
es: La Organización de las Naciones Unidas (ONU) es una organización intergubernamental fundada en 1945 que tiene como objetivo mantener la paz y la seguridad internacionales y desarrollar relaciones amistosas entre las naciones para lograr la cooperación internacional. La ONU tiene su sede en la ciudad de Nueva York en un territorio internacional y tiene otras oficinas principales en Ginebra, Nairobi, Viena y La Haya.

source: The Major Objectives of the UN are to:
es: Los principales objetivos de las Naciones Unidas son:

source: Maintain International Peace and Security
es: Mantener la paz y la seguridad internacionales

source: Protect Human Rights
es: Proteger los derechos humanos

source: Deliver Humanitarian Aid
es: Entrega de ayuda humanitaria

source: Support Sustainable Development and Climate Action
es: Apoyar el desarrollo sostenible y la acción climática

source: Uphold International Law
es: Defender el derecho internacional

source: What are the Sustainable Development Goals?
es: ¿Qué son los Objetivos de Desarrollo Sostenible?

source: `Image Source <https://sdgs.un.org/>`__
es: 'Fuente de la imagen <https://sdgs.un.org/>`__

source: The Sustainable Development Goals (SDGs) are 17 interconnected goals that were adopted by the United Nations in 2015 as a universal call to all the nations to take action to end poverty, hunger protects the planet from the overexploitation by global cooperation. UN aims to achieve the goals by ensuring that all people enjoy peace and prosperity. The seventeen goals are integrated and they recognize that action in one domain will affect outcomes in others. The goals also promote that the development must balanced ensuring social, economic and environmental sustainability. Countries have committed to prioritizing progress for those who's furthest behind. The following table gives an overview of all the Sustainable Development Goals.
es: Los Objetivos de Desarrollo Sostenible (ODS) son 17 metas interconectadas que fueron adoptadas por las Naciones Unidas en 2015 como un llamado universal a todas las naciones a tomar medidas para acabar con la pobreza, el hambre, protege al planeta de la sobreexplotación por la cooperación global. La ONU tiene como objetivo lograr los objetivos asegurando que todas las personas disfruten de paz y prosperidad. Los diecisiete objetivos están integrados y reconocen que la acción en un dominio afectará los resultados en otros. Los objetivos también promueven que el desarrollo debe equilibrarse asegurando la sostenibilidad social, económica y ambiental. Los países se han comprometido a priorizar el progreso para aquellos que están más rezagados. La siguiente tabla ofrece una visión general de todos los Objetivos de Desarrollo Sostenible.

source: **Overview of UN Sustainable Development Goals (SDGs)**
es: **Visión general de los Objetivos de Desarrollo Sostenible (ODS) de las Naciones Unidas**

source: Goal Number
es: Número de objetivo

source: Goal Name
es: Nombre del objetivo

source: Objective
es: Objetivo

source: Goal 1
es: Objetivo 1

source: No Poverty
es: No pobreza

source: End poverty in all its forms everywhere
es: Poner fin a la pobreza en todas sus formas y en todas partes

source: Goal 2
es: Objetivo 2

source: Zero Hunger
es: Cero Hambre

source: End hunger, achieve food security and improved nutrition and promote sustainable agriculture
es: Poner fin al hambre, lograr la seguridad alimentaria y la mejora de la nutrición y promover la agricultura sostenible

source: Goal 3
es: Objetivo 3

source: Good Health and Well Being
es: Buena salud y bienestar

source: Ensure healthy lives and promote well-being for all at all ages
es: Garantizar una vida saludable y promover el bienestar para todos en todas las edades

source: Goal 4
es: Objetivo 4

source: Quality Education
es: Educación de calidad

source: Ensure inclusive and equitable quality education and promote lifelong learning opportunities for all
es: Garantizar una educación de calidad inclusiva y equitativa y promover oportunidades de aprendizaje a lo largo de toda la vida para todos

source: Goal 5
es: Objetivo 5

source: Gender Equality
es: Igualdad de género

source: Achieve gender equality and empower all women and girls
es: Lograr la igualdad de género y empoderar a todas las mujeres y niñas

source: Goal 6
es: Objetivo 6

source: Clean Water and Sanitation
es: Agua limpia y saneamiento

source: Ensure availability and sustainable management of water and sanitation for all
es: Garantizar la disponibilidad y la gestión sostenible del agua y el saneamiento para todos

source: Goal 7
es: Objetivo 7

source: Affordable and Clean Energy
es: Energía asequible y limpia

source: Ensure access to affordable, reliable, sustainable and modern energy for all
es: Garantizar el acceso a una energía asequible, fiable, sostenible y moderna para todos

source: Goal 8
es: Objetivo 8

source: Decent Work and Economic Growth
es: Trabajo decente y crecimiento económico

source: Promote sustained, inclusive and sustainable economic growth, full and productive employment and decent work for all
es: Promover el crecimiento económico sostenido, inclusivo y sostenible, el empleo pleno y productivo y el trabajo decente para todos

source: Goal 9
es: Objetivo 9

source: Industry Innovation and Infrastructure
es: Innovación e infraestructura de la industria

source: Build resilient infrastructure, promote inclusive and sustainable industrialization and foster innovation
es: Construir infraestructura resiliente, promover la industrialización inclusiva y sostenible y fomentar la innovación

source: Goal 10
es: Objetivo 10

source: Reduced Inequalities
es: Reducción de las desigualdades

source: Reduce inequality within and among countries
es: Reducir la desigualdad dentro y entre los países

source: Goal 11
es: Objetivo 11

source: Sustainable Cities and Communities
es: Ciudades y comunidades sostenibles

source: Make cities and human settlements inclusive, safe, resilient and sustainable
es: Hacer que las ciudades y los asentamientos humanos sean inclusivos, seguros, resilientes y sostenibles

source: Goal 12
es: Objetivo 12

source: Responsible Consumption and Production
es: Consumo y producción responsables

source: Ensure sustainable consumption and production patterns
es: Garantizar patrones de consumo y producción sostenibles

source: Goal 13
es: Objetivo 13

source: Climate Action
es: Acción climática

source: Take urgent action to combat climate change and its impacts
es: Tomar medidas urgentes para combatir el cambio climático y sus impactos

source: Goal 14
es: Objetivo 14

source: Life Below Water
es: Vida bajo el agua

source: Conserve and sustainably use the oceans, seas and marine resources for sustainable development
es: Conservar y utilizar de manera sostenible los océanos, los mares y los recursos marinos para el desarrollo sostenible

source: Goal 15
es: Objetivo 15

source: Life on Land
es: La vida en tierra

source: Protect, restore and promote sustainable use of terrestrial ecosystems, sustainably manage forests, combat desertification, and halt and reverse land degradation and halt biodiversity loss
es: Proteger, restaurar y promover el uso sostenible de los ecosistemas terrestres, gestionar de manera sostenible los bosques, combatir la desertificación y detener e invertir la degradación de la tierra y detener la pérdida de biodiversidad

source: Goal 16
es: Objetivo 16

source: Peace, Justice and Strong Institutions
es: Paz, justicia e instituciones sólidas

source: Promote peaceful and inclusive societies for sustainable development, provide access to justice for all and build effective, accountable and inclusive institutions at all levels
es: Promover sociedades pacíficas e inclusivas para el desarrollo sostenible, proporcionar acceso a la justicia para todos y construir instituciones eficaces, responsables e inclusivas a todos los niveles

source: Goal 17
es: Objetivo 17

source: Partnerships for the Goals
es: Alianzas para los Objetivos

source: Strengthen the means of implementation and revitalize the global partnership for sustainable development
es: Fortalecer los medios de aplicación y revitalizar la alianza mundial para el desarrollo sostenible

source: More on Sustainable Development Goals can be found at this `link <https://sdgs.un.org/goals>`__.
es: Se puede encontrar más información sobre los Objetivos de Desarrollo Sostenible en este `enlace <https://sdgs.un.org/goals>`__.

source: Currently this workshop addresses three of the seventeen Sustainable Development Goals and covers the following:
es: Actualmente este taller aborda tres de los diecisiete Objetivos de Desarrollo Sostenible y abarca lo siguiente:

source: Data for Sustainable Development Goals
es: Datos para los Objetivos de Desarrollo Sostenible

source: UN SDG 3: Good Health and Well Being
es: ODS 3 de la ONU: Buena salud y bienestar

source: UN SDG 11: Sustainable Cities and Communities
es: ODS 11 dla ONU: Ciudades y comunidades sostenibles

source: UN SDG 7: Affordable and Clean Energy
es: ODS 7 de la ONU: Energía asequible y limpia

source: Target Audience
es: Público objetivo

source: This educational material can be used by researchers, educators and in local,regional, national or international agencies who have some knowledge of PostGIS and PostgreSQL, and want to teach themselves how to use pgRouting. It is recommended to have a basic knowledge of database management systems and geospatial data structures and formats.
es: Este material educativo puede ser utilizado por investigadores, educadores y en agencias locales, regionales, nacionales o internacionales que tienen algún conocimiento de PostGIS y PostgreSQL, y desean aprender a usar pgRouting. Se recomienda tener un conocimiento básico de los sistemas de gestión de bases de datos y estructuras y formatos de datos geoespaciales.

source: Prerequisites for UN SDG Exercises
es: Requisitos previos para los ejercicios de los ODS de ONU

source: Workshop level: Advanced
es: Nivel de taller: Avanzado

source: Previous knowledge: SQL (PostgreSQL, PostGIS), a brief idea about the applications of GIS and pgRouting
es: Conocimientos previos: SQL (PostgreSQL, PostGIS), una breve idea sobre las aplicaciones de SIG y pgRouting

source: Brief idea about applications of GIS and pgRouting
es: Breve idea sobre las aplicaciones de SIG y pgRouting

source: System Requirements: This workshop uses OSGeoLive (The latest available version)
es: Requisitos del sistema: Este taller utiliza OSGeoLive (la última versión disponible)

source: Basic chapters pgRouting Workshop
es: Capítulos básicos pgRouting Workshop
