Repository: pgRouting/workshop
Catalog: locale/*/LC_MESSAGES/un_sdg/sdg11-cities.po
Languages: es, sv

source: Sustainable Cities and Communities
es: Ciudades y comunidades sostenibles
sv: Hållbara städer och samhällen

source: `Sustainable Cities and Communities` is the 11th Sustainable Development Goal which aspires to make cities `inclusive, safe, resilient` and `sustainable`.The world is becoming increasingly urbanized. Since 2007, more than half the world’s population has been living in cities. This makes it very important for the cities to remain alert when there is a chance of disaster like floods. Local administration should know if their city is going to get affected by the rains which happen in their proximity so that they can raise an alert amongst the citizens. This exercise will solve one of such problems.
es: 'Ciudades y Comunidades Sostenibles' es el 11º Objetivo de Desarrollo Sostenible que aspira a hacer que las ciudades sean "inclusivas, seguras, resilientes" y "sostenibles". El mundo se está urbanizando cada vez más. Desde 2007, más de la mitad de la población mundial vive en ciudades. Esto hace que sea muy importante que las ciudades permanezcan alertas cuando existe la posibilidad de desastres como inundaciones. La administración local debe saber si su ciudad se va a ver afectada por las lluvias que ocurren en sus proximidades para que puedan alertar a los ciudadanos. Este ejercicio resolverá uno de estos problemas.
sv: `Hållbara städer och samhällen` är det elfte globala målet för hållbar utveckling som syftar till att göra städerna "inkluderande, säkra, motståndskraftiga" och "hållbara".Världen blir alltmer urbaniserad. Sedan 2007 har mer än hälften av världens befolkning bott i städer. Det gör det mycket viktigt för städerna att hålla sig alerta när det finns risk för katastrofer som översvämningar. Den lokala administrationen bör veta om deras stad kommer att påverkas av de regn som inträffar i deras närhet så att de kan höja en varning bland medborgarna. Denna övning kommer att lösa ett av dessa problem.

source: Sustainable Development Goal 11: Sustainable Cities and Communities
es: Objetivo de Desarrollo Sostenible 11: Ciudades y Comunidades Sostenibles
sv: Mål 11 för hållbar utveckling: Hållbara städer och samhällen

source: `Image Source <https://sdgs.un.org/goals/goal11>`__
es: 'Fuente de la imagen <https://sdgs.un.org/goals/goal11>`__
sv: `Bildkälla <https://sdgs.un.org/goals/goal11>`__

source: Chapter Contents
es: Contenido del Capítulo
sv: Kapitelinnehåll

source: Problem: City getting affected by rain or not
es: Problema: Ciudad afectada por la lluvia o no?
sv: Problem: Staden påverkas av regn eller inte

source: **Problem Statement**
es: **Declaración del problema**
sv: **Problemformulering**

source: To determine the areas where if it rains will affect a city/town
es: Determinar las áreas donde si llueve afectará a una ciudad/pueblo
sv: Att fastställa de områden där regn påverkar en stad/ort

source: **Core Idea**
es: **Idea central**
sv: **Kärnidé**

source: If it rains in vicinity of a river connecting the city, the city will get affected by the rains.
es: Si llueve en las cercanías de un río que conecta la ciudad, la ciudad se verá afectada por las lluvias.
sv: Om det regnar i närheten av en flod som förbinder staden kommer staden att påverkas av regnen.

source: **Approach**
es: **Enfoque**
sv: **Tillvägagångssätt**

source: Choose a city
es: Eligir una ciudad
sv: Välj en stad

source: Get the Rivers (Edges)
es: Obtener los ríos (segmentos)
sv: Hämta floderna (kanterna)

source: Create river components
es: Crear componentes fluviales
sv: Skapa flodkomponenter

source: Create a Buffer around the city
es: Crear una zona límite alrededor de la ciudad
sv: Skapa en buffert runt staden

source: Finding the components intersecting the buffer
es: Encontrar los componentes que intersectan la zona limitada
sv: Hitta de komponenter som skär bufferten

source: Finding the rain zones
es: Encontrar las zonas de lluvia
sv: Hitta regnzonerna

source: For this exercise, Munshigang city from Bangladesh is chosen. This city has multiple rivers in its proximity which makes it an apt location to demonstrate this exercise. The exercise will try to find the areas, where if it rains the city will be affected. To define the location of this city and use it in for further steps, create a table to store the name along with latitude and longitude values of City's location. This stores the city as a point.
es: Para este ejercicio, se elige la ciudad de Munshigang de Bangladesh. Esta ciudad tiene múltiples ríos en su proximidad, lo que la convierte en un lugar adecuado para demostrar este ejercicio. El ejercicio tratará de encontrar las zonas, donde si llueve la ciudad se verá afectada. Para definir la ubicación de esta ciudad y usarla en pasos posteriores, crear una tabla para almacenar el nombre junto con los valores de latitud y longitud de la ubicación de la ciudad. Esto almacena la ciudad como un punto.
sv: För den här övningen har vi valt Munshigang i Bangladesh. Staden har flera floder i sin närhet, vilket gör den till en lämplig plats för att demonstrera denna övning. I övningen försöker man hitta de områden där staden påverkas om det regnar. För att definiera platsen för denna stad och använda den i ytterligare steg skapar du en tabell för att lagra namnet tillsammans med latitud- och longitudvärden för Citys plats. Detta lagrar staden som en punkt.

source: Exercise 1: Create a point for the city
es: Ejercicio 1: Crear un punto para la ciudad
sv: Övning 1: Skapa en punkt för staden

source: Create a table for the cities
sv: Skapa en tabell för städerna

source: Insert Munshigang
sv: Infoga Munshigang

source: Simulate the city region with a buffer
sv: Simulera stadsregionen med en buffert

source: See description of the table
sv: Se beskrivning av tabellen

source: Latitude and longitude values are converted into ``geometry`` form using ``ST_Point`` which returns a point with the given X and Y coordinate values. ``ST_SetSRID`` is used to set the SRID (Spatial Reference Identifier) on the point geometry to ``4326``.
es: Los valores de latitud y longitud se convierten en ``geometry`` usando ``ST_Point`` que devuelve un punto con los valores de coordenadas X e Y dados. ``ST_SetSRID`` se utiliza para establecer el SRID (Identificado de referencia Espacial) en la geometría del punto en ``4326``.
sv: Latitud- och longitudvärden konverteras till geometrisk form med hjälp av ``ST_Point`` som returnerar en punkt med de angivna X- och Y-koordinatvärdena. ``ST_SetSRID`` används för att ställa in SRID (Spatial Reference Identifier) på punktgeometrin till ``4326``.

source: Prepare the database
sv: Förbereda databasen

source: Data obtained in :doc:`data`.
sv: Data som erhållits i :doc:`data`.

source: This section will cover the status of the database in order to get the same results when processing the queries.
sv: I det här avsnittet behandlas databasens status för att få samma resultat vid bearbetning av frågorna.

source: Exercise 2: Set the search path
sv: Övning 2: Ställ in sökvägen

source: First step in pre processing is to set the search path for ``Waterways`` data. Search path is a list of schemas that helps the system determine how a particular table is to be imported.
es: El primer paso en el preprocesamiento es establecer la ruta de búsqueda para los datos de ``Waterways``. La ruta de búsqueda es una lista de esquemas que ayuda al sistema a determinar cómo se va a importar una tabla en particular.
sv: Första steget i förbehandlingen är att ställa in sökvägen för ``Waterways`` data. Sökvägen är en lista med scheman som hjälper systemet att avgöra hur en viss tabell ska importeras.

source: Exercise 3: Verify database configuration
sv: Övning 3: Verifiera databaskonfigurationen

source: As part of the every project tasks: inspect the database structure.
sv: Som en del av varje projektuppgift: inspektera databasstrukturen.

source: Get the extensions that are installed
sv: Hämta de tillägg som är installerade

source: List installed tables
sv: Lista installerade tabeller

source: Exercise 4: Count the number of Waterways
sv: Övning 4: Räkna antalet vattenvägar

source: The importance of counting the information on this workshop is to make sure that the same data is used and consequently the results are same. Also, some of the rows can be seen to understand the structure of the table and how the data is stored in it.
es: La importancia de contar la información en este taller es asegurarse de que se utilizan los mismos datos y, en consecuencia, los resultados son los mismos. Además, algunas de las filas se pueden ver para comprender la estructura de la tabla y cómo se almacenan los datos en ella.
sv: Vikten av att räkna informationen i denna workshop är att säkerställa att samma data används och att resultaten följaktligen blir desamma. Dessutom kan man se några av raderna för att förstå tabellens struktur och hur uppgifterna lagras i den.

source: Processing waterways data
sv: Bearbetning av vattenvägsdata

source: This section will work the graph that is going to be used for processing. While building the graph, the data has to be inspected to determine if there is any invalid data. This is a very important step to make sure that the data is of required quality. pgRouting can also be used to do some Data Adjustments.
sv: I detta avsnitt bearbetas den graf som ska användas för bearbetning. När grafen byggs upp måste data inspekteras för att avgöra om det finns några ogiltiga data. Detta är ett mycket viktigt steg för att säkerställa att data håller erforderlig kvalitet. pgRouting kan också användas för att göra vissa datajusteringar.

source: Exercise 5: Remove waterways not for the problem
sv: Övning 5: Ta bort vattenvägar inte för problemet

source: Waterways to be removed
sv: Vattenvägar ska tas bort

source: This exercise focusses only the areas in the mainland, where if it rains the city is affected. Hence, the rivers which are there in the swamp area wich is in a lower altitude of the city, are to be removed from the ``waterways_ways`` table.
sv: Denna övning fokuserar endast på de områden på fastlandet där staden påverkas om det regnar. Därför ska de floder som finns i träskområdet, som ligger lägre upp i staden, tas bort från tabellen ``waterways_ways``.

source: Remove swamp rivers
sv: Ta bort träskfloder

source: When working for many cities, a better approach might be to create views.
sv: När man arbetar för många städer kan det vara bättre att skapa vyer.

source: Also delete a boundary tagged as waterway
sv: Ta även bort en gräns som taggats som vattenväg

source: A better approach might be to fix the original data in OSM website.
sv: Ett bättre tillvägagångssätt kan vara att fixa originaldata på OSM-webbplatsen.

source: Exercise 6: Get the Connected Components of Waterways
sv: Övning 6: Få fram de anslutna komponenterna i vattenvägar

source: As the rivers in the data are not having single edge, i.e, multiple edges make up a river, it is important to find out the connected edges and store the information in the ``waterways_ways`` table. This will help us to identify which edges belong to a river. First, the connected components are found and then stored in a new column named ``component``.
es: Como los ríos en los datos no tienen un solo segmento, es decir, múltiples segmentos forman un río, es importante encontrar los segmentos conectados y almacenar la información en la tabla ``waterways_ways``. Esto ayudará a identificar cuáles segmentos pertenecen a un río. Primero se encuentran los componentes conectados y luego se almacenan en una nueva columna llamada ``component``.
sv: Eftersom floderna i data inte har en enda kant, dvs. flera kanter utgör en flod, är det viktigt att ta reda på de anslutna kanterna och lagra informationen i tabellen ``waterways_ways``. Detta kommer att hjälpa oss att identifiera vilka kanter som tillhör en flod. Först hittas de anslutna komponenterna och lagras sedan i en ny kolumn med namnet ``component``.

source: The pgRouting function ``pgr_connectedComponents`` is used to complete this task and its explaind with more detail in :doc:`../basic/graph_views`.
sv: PgRouting-funktionen ``pgr_connectedComponents`` används för att slutföra denna uppgift och förklaras mer detaljerat i :doc:`../basic/graph_views`.

source: A sub-query is created to find out all the connected components. After that, the ``component`` column is updated using the results obtained from the sub-query. This helps in storing the component id in the ``waterways_ways_vertices_pgr`` table. Next query uses this output and stores the component id in the waterways_ways (edges) table. Follow the steps given below to complete this task.
sv: En underfråga skapas för att ta reda på alla anslutna komponenter. Därefter uppdateras kolumnen ``component`` med hjälp av de resultat som erhållits från underfrågan. Detta hjälper till att lagra komponent-ID i tabellen ``waterways_ways_vertices_pgr``. Nästa fråga använder detta resultat och lagrar komponentens ID i tabellen waterways_ways (edges). Följ stegen nedan för att slutföra den här uppgiften.

source: Create a vertices table.
sv: Skapa en vertices-tabell.

source: Fill up the ``x``, ``y`` and ``geom`` columns.
sv: Fyll i kolumnerna ``x``, ``y`` och ``geom``.

source: Add a ``component`` column on the edges and vertices tables.
sv: Lägg till en ``component``-kolumn i tabellerna edges och vertices.

source: Fill up the ``component`` column on the vertices table.
sv: Fyll i kolumnen ``component`` i tabellen över vertikaler.

source: Fill up the ``component`` column on the edges table.
sv: Fyll i kolumnen ``component`` i tabellen över kanter.

source: Exercise 7: Creating a function that gets the city buffer
sv: Övning 7: Skapa en funktion som hämtar stadens buffert

source: A function can be created for the same task. This will be help when the table has more than one city.
es: Se puede crear una función para la misma tarea. Esto será de ayuda cuando la tabla tenga más de una ciudad.
sv: En funktion kan skapas för samma uppgift. Detta är till hjälp när tabellen har mer än en stad.

source: Exercise 8: Finding the components intersecting the buffer
sv: Övning 8: Hitta de komponenter som skär bufferten

source: Next step is to find the components of waterways which lie in the buffer zone of the city. These are the waterways which will affect the city when it rains around them. This is done using ``ST_Intersects``. Note that ``get_city_buffer`` function is used in the query below.
es: El siguiente paso es encontrar los componentes de las vías fluviales que se encuentran dentro de la zona límite de la ciudad. Estos son los flujos de agua que afectarán a la ciudad cuando llueva a su alrededor. Esto se hace usando ``ST_Intersects``. Tenga en cuenta que la función '``get_city_buffer`` se utiliza en la consulta a continuación.
sv: Nästa steg är att hitta de delar av vattenvägarna som ligger i stadens buffertzon. Det är dessa vattenvägar som kommer att påverka staden när det regnar runt dem. Detta görs med hjälp av ``ST_Intersects``. Observera att funktionen ``get_city_buffer`` används i frågan nedan.

source: Output shows the distinct component numbers which lie in the buffer zone of the city. That is, the rivers that lie within the city.
sv: Output visar de distinkta komponentnummer som ligger i stadens buffertzon. Det vill säga de floder som ligger inom staden.

source: Exercise 9: Get the rain zones
sv: Övning 9: Få fram regnzonerna

source: In this excercise the area , where if it rains, the city would be affected, is calculated. This area is called ``rain zone`` in the excercise
sv: I den här övningen beräknas det område där staden skulle påverkas om det regnar. Detta område kallas ``regnzon`` i övningen

source: Create a Buffer around the river components.
sv: Skapa en buffert runt flodkomponenterna.

source: Add columns named ``rain_zone`` in waterways_ways
sv: Lägg till kolumner med namnet ``rain_zone`` i waterways_ways

source: To store buffer geometry of the rain zones.
sv: För att lagra buffertgeometrin för regnzonerna.

source: Find the buffer for every edge that intersects the city buffer area using ``ST_Buffer``
sv: Hitta bufferten för varje kant som korsar stadens buffertområde med hjälp av ``ST_Buffer``

source: and update the ``rain_zone`` column.
sv: och uppdatera kolumnen ``rain_zone``.

source: Adding column to store Buffer geometry
es: Agregar columna para almacenar la geometría de zona límite
sv: Lägga till kolumn för att lagra buffertgeometri

source: Storing Buffer geometry
es: Almacenamiento de la geometría de zona límite
sv: Lagring av buffertgeometri

source: This will give us the requires area, where if it rains, the city will be affected.
es: Esto nos dará la zona requerida, donde si llueve, la ciudad se verá afectada.
sv: Detta kommer att ge oss det nödvändiga området, där staden kommer att påverkas om det regnar.

source: Exercise 10: Create a union of rain zones
sv: Övning 10: Skapa en sammanslagning av regnzoner

source: Multiple polygons that are obtained can also be merged using ``ST_Union``. This will give a single polygon as the output.
es: Los polígonos múltiples que se obtienen también se pueden fusionar usando '``ST_Union``. Esto dará un solo polígono como salida.
sv: Flera polygoner som erhålls kan också slås samman med hjälp av ``ST_Union``. Detta kommer att ge en enda polygon som utdata.

source: When it rains in the vicinity, the city will get affected by the rain.
sv: När det regnar i närområdet kommer staden att påverkas av regnet.

source: Pre-processing waterways data
es: Preprocesamiento de datos de vías navegables

source: Setting the Search Path of Waterways
es: Establecer la ruta de búsqueda de las vías fluviales

source: Exercise 2: Inspecting the schemas
es: Ejercicio 2: Inspección de los esquemas

source: Inspect the schemas by displaying all the present schemas using the following command
es: Inspeccione los esquemas mostrando todos los esquemas actuales mediante el siguiente comando

source: The schema names are ``waterway`` and ``public``. The owner depends on who has the rights to the database.
es: Los nombres de esquema son `waterway`` and ``public``. El propietario depende de quién tenga los derechos de la base de datos.

source: Exercise 3: Inspecting the search path
es: Ejercicio 3: Inspeccionar la ruta de búsqueda

source: Display the current search path using the following query.
es: Mostrar la ruta de búsqueda actual mediante la siguiente consulta.

source: This is the current search path. Tables cannot be accessed using this.
es: Esta es la ruta de búsqueda actual. No se puede acceder a las tablas mediante esta opción.

source: Exercise 4: Fixing the search path
es: Ejercicio 4: Arreglar la ruta de búsqueda

source: In this case, search path of roads table is set to ``waterways`` schema. Following query is used to fix the search path
es: En este caso, la ruta de búsqueda de la tabla de carreteras se establece en el esquema ``waterways`` . La siguiente consulta se utiliza para corregir la ruta de búsqueda

source: Exercise 5: Enumerating tables
es: Ejercicio 5: Enumerar tablas

source: Finally, ``\dt`` is used to verify if the Schema have bees changed correctly.
es: Finalmente, `\dt`` se utiliza para verificar si el esquema se ha cambiado correctamente.

source: Exercise 6: Counting the number of Waterways
es: Ejercicio 6: Contar el número de vías navegables

source: Exercise 7: Removing the Rivers which are in swamps
es: Ejercicio 7: Eliminar los ríos que están en pantanos

source: This exercise focusses only the areas in the mainland, where if it rains the city is affected. Hence, the rivers which are there in the swamp area have to be removed from the ``waterways_ways`` table.
es: Este ejercicio se centra solo en las zonas del continente, donde si llueve la ciudad se ve afectada. Por lo tanto, los ríos que están allí en el área del pantano tienen que ser eliminados de la tabla ``waterways_ways`` .

source: pgr_connectedComponents for preprocessing waterways
es: ``pgr_connectedComponents`` para el preprocesamiento de vías navegables

source: For the next step ``pgr_connectedComponents`` will be used. It is used to find the connected components of an undirected graph using a Depth First Search-based approach.
es: Para el siguiente paso se utilizará ``pgr_connectedComponents``. Se utiliza para encontrar los componentes conectados de un grafo no dirigido utilizando un enfoque basado en la búsqueda en profundidad.

source: Signatures
es: Firmas

source: `pgr_connectedComponents Documentation <https://docs.pgrouting.org/3.1/en/pgr_connectedComponents.html>`__ can be found at this link for more information.
es: Para más información la documentation de `pgr_connectedComponents <https://docs.pgrouting.org/3.1/en/pgr_connectedComponents.html>`__ puede se emcotrada en esta liga..

source: Exercise 8: Get the Connected Components of Waterways
es: Ejercicio 8: Obtener los componentes conectados de las vías fluviales

source: pgRouting function ``pgr_connectedComponents`` is used to complete this task. A sub-query is created to find out all the connected components. After that, the ``component`` column is updated using the results obtained from the sub-query. This helps in storing the component id in the ``waterways_ways_vertices_pgr`` table. Next query uses this output and stores the component id in the waterways_ways (edges) table. Follow the steps given below to complete this task.
es: La función pgRouting ``pgr_connectedComponents`` se utiliza para completar esta tarea. Se crea una subconsulta para averiguar todos los componentes conectados. Después de eso, la columna ``component`` se actualiza utilizando los resultados obtenidos de la subconsulta. Esto ayuda a almacenar el identificador del componente en la tabla ``waterways_ways_vertices_pgr``. La siguiente consulta utiliza este resultado y almacena el identificador del componente en la tabla ``waterways_ways`` (bordes). Siga los pasos que se indican a continuación para completar esta tarea.

source: Add a column named ``component`` to store component number.
es: Agregue una columna denominada '``component`` para almacenar el número de componente.

source: Get the Connected Components of Waterways
es: Obtener los componentes conectados de las vías fluviales

source: With component id stored in both vertex and edge table of waterways, lets proceed to next step.
es: Con el identificador del componente almacenado tanto en elas tablas de vertices y de segmentos de las vías fluviales, se procede al siguiente paso.

source: Exercise 9: Creating buffer around the city
es: Ejercicio 9: Crear una zona límite alrededor de la ciudad

source: Create a buffer around the city to define an area, inside which the intersection of rivers would be found. ``ST_Buffer`` is used to create this buffer. Follow the steps given below to complete this task.
es: Crear una zona límite alrededor de la ciudad para definir un área, dentro de la cual se encontraría la intersección de los ríos. ``ST_Buffer`` se utiliza para crear este búfer. Siga los pasos que se indican a continuación para completar esta tarea.

source: Displaying the results of Buffer operation
es: Visualización de los resultados de la operación de búfer

source: Exercise 10: Creating a function that gets the city buffer
es: Ejercicio 10: Crear una función que obtenga la zona límite de la ciudad

source: Exercise 11: Finding the components intersecting the buffer
es: Ejercicio 11: Encontrar los componentes que intersectan la zona limitada
