Repository: pgRouting/workshop
Catalog: locale/*/LC_MESSAGES/un_sdg/sdg11-cities.po
Languages: es, sv

source: Output shows the distinct component numbers which lie in the buffer zone of the city. Next step is to get all the edges that have those components.
es: Los resultados muestran los distintos números de componentes que se encuentran dentro de la zona límite de la ciudad. El siguiente paso es obtener todos los bordes que tienen esos componentes.

source: Exercise 12: Get the rain zones
es: Ejercicio 12: Obtener las zonas de lluvia

source: This is the final step of the exercise. In this, the area where if it rains, the city would be affected, also can be called as ``rain zone`` is being found. For this, create a Buffer around the river components. First, add columns named ``rain_zone`` in waterways_ways to store buffer geometry of the rain zones. Then, find the buffer for every edge which intersects the buffer area using ``ST_Buffer`` and update the ``rain_zone`` column. Follow the steps given below to complete this task.
es: Este es el paso final del ejercicio. En esta, se está encontrando la zona donde si llueve, la ciudad se vería afectada, también se puede llamar como ''zona de lluvia''. Para esto, crear una zona límite alrededor de los componentes del río. Primero, agregue columnas llamadas ``rain_zone`` en ``waterways_ways`` para almacenar la geometría de las zonas de lluvia. Luego, buscar la zona para cada segmento que intersecta el área de la zona límite ``ST_Buffer`` y actualizar la columna ``rain_zone``. Siguir los pasos que se indican a continuación para completar esta tarea.

source: Exercise 13: Create a union of rain zones
es: Ejercicio 13: Crear una unión de zonas de lluvia
