Repository: pgRouting/workshop
Catalog: locale/*/LC_MESSAGES/un_sdg/sdg3-health.po
Languages: es, sv

source: `pgr_drivingDistance Documentation <https://docs.pgrouting.org/3.1/en/pgr_drivingDistance>`__ can be found at this link for more information.
es: Para más información la documentation de `pgr_drivingDistance Documentation <https://docs.pgrouting.org/3.1/en/pgr_drivingDistance>`__ puede se emcotrada en esta liga..
sv: `pgr_drivingDistance Documentation <https://docs.pgrouting.org/3.1/en/pgr_drivingDistance>`__ finns på denna länk för mer information.

source: Exercise 13: Find the closest road vertex
sv: Övning 13: Hitta närmaste vägkorsning

source: There are multiple road vertices near the hospital. Create a function to find the geographically closest road vertex. ``closest_vertex`` function takes geometry of other table as input and gives the gid of the closest vertex as output by comparing ``geom`` of both the tables.
es: Hay múltiples vértices de camonos cerca del hospital. Crear una función para encontrar el vértice del camino geográficamente más cercano. La función ``closest_vertex`` toma la geometría de otra tabla como entrada y da el vértice del vértice más cercano como salida comparando ``geom`` de ambas tablas.
sv: Det finns flera vägkorsningar nära sjukhuset. Skapa en funktion för att hitta det geografiskt närmaste vägvertexet. funktionen ``closest_vertex`` tar geometri från en annan tabell som indata och ger gid för det närmaste toppunktet som utdata genom att jämföra ``geom`` i båda tabellerna.

source: The following query creates a function to find the closest road vertex.
es: La siguiente consulta crea una función para encontrar el vértice de camino más cercano.
sv: Följande fråga skapar en funktion för att hitta det närmaste vägmärket.

source: Testing the function
sv: Testa funktionen

source: Exercise 14: Finding the served roads using pgr_drivingDistance
sv: Övning 14: Hitta de vägar som betjänas med hjälp av pgr_drivingDistance

source: Find the roads within 10 minutes walking distance from the hospitals. Use ``1 m/s`` as walking speed.
sv: Hitta de vägar som ligger inom 10 minuters gångavstånd från sjukhusen. Använd ``1 m/s`` som gånghastighet.

source: Solution
sv: Lösning

source: In this exercise, the roads served are calculated based on a walking time of ``1 m/s``, by using ``pgrdrivingDistance`` function from pgRouting extension.
sv: I den här övningen beräknas de vägar som trafikeras baserat på en gångtid på ``1 m/s``, med hjälp av funktionen ``pgrdrivingDistance`` från tillägget pgRouting.

source: Time in minutes is considered as ``cost``.
sv: Tid i minuter betraktas som "kostnad".

source: the graph is undirected.
sv: grafen är oriktad.

source: Preparing a query
sv: Förbereda en förfrågan

source: For the following query,
es: Para la siguiente consulta,
sv: För följande fråga,

source: The prepared statement is used.
sv: Det förberedda uttalandet används.

source: Pedestrian speed is set to be ``1 m/s``.
sv: Fotgängarens hastighet är inställd på "1 m/s".

source: As ``time`` = ``distance/speed``, ``length_m`` / ``1 m/s`` / ``60`` gives the time in minutes.
sv: Eftersom ``time`` = ``distance/speed`` ger ``length_m`` / ``1 m/s`` / ``60`` tiden i minuter.

source: ``tag_id = '318'`` as 318 is the value for hospital in the configuration table of the buildings.
sv: ``tag_id = '318'`` eftersom 318 är värdet för sjukhus i konfigurationstabellen för byggnaderna.

source: ``10`` for 10 minutes, which is a threshold for ``agg_cost``
sv: ``10`` i 10 minuter, vilket är ett tröskelvärde för ``agg_cost``

source: Following figure shows the visualised output of the above query. The lines highlighted by red colour show the area from where the hospital can be reached within 10 minutes of walking at the speed of ``1 m/s``.
sv: Följande figur visar det visualiserade resultatet av ovanstående fråga. De linjer som är markerade med röd färg visar det område från vilket sjukhuset kan nås inom 10 minuters promenad med en hastighet av ``1 m/s``.

source: It is noticable from the output figure that some of the roads which are near to the hospital are not highlighted. For example, to roads in the north of the hospital. This is because the only one edge per road vertex was selected by the query.
sv: Det framgår av utdatafiguren att vissa av de vägar som ligger nära sjukhuset inte är markerade. Det gäller till exempel vägar norr om sjukhuset. Detta beror på att endast en kant per vägvertex valdes av frågan.

source: Exercise 15: Generalising the served roads
sv: Övning 15: Generalisering av de trafikerade vägarna

source: The edges which are near to to hospital should also be selected in the roads served as the hospital also serves those buildings. The following query takes the query from previous section as a ``subquery`` and selects all the edges from ``roads_ways`` that have the same ``source`` and ``target`` to that of ``subquery`` (Line 14).
es: Los segmentos que están cerca del hospital también deben seleccionarse en las carreteras atendidas, ya que el hospital también sirve a esos edificios. La siguiente consulta toma la consulta de la sección anterior como una ''subconsulta'' y selecciona todas las aristas de ``roads_ways`` que tienen el mismo '`source`` y ``target`` a la de ''subconsulta'' (Línea 14).
sv: De kanter som ligger nära sjukhuset bör också väljas i de vägar som betjänas eftersom sjukhuset också betjänar dessa byggnader. Följande fråga tar frågan från föregående avsnitt som en ``underfråga`` och väljer alla kanter från ``roads_ways`` som har samma ``källa`` och ``mål`` som den i ``underfrågan`` (rad 14).

source: Following figure shows the visualised output of the above query. Lines highlighted in ``yellow`` show the `generalised the roads served`. This gives a better estimate of the areas from where the hospital can be reached by a particular speed.
es: La siguiente figura muestra el resultado visualizado de la consulta anterior. Las líneas resaltadas en "amarillo" muestran el "generalizado de las carreteras servidas". Esto da una mejor estimación de las áreas desde donde se puede llegar al hospital a una velocidad particular.
sv: Följande figur visar det visualiserade resultatet av ovanstående fråga. Linjer markerade i ``yellow`` visar `generaliserade vägar som betjänas`. Detta ger en bättre uppskattning av de områden varifrån sjukhuset kan nås med en viss hastighet.

source: Calculating the total population served by the hospital
es: Cálculo de la población total atendida por el hospital
sv: Beräkning av den totala befolkning som betjänas av sjukhuset

source: Now the next step is to estimate the dependant population. Official source of population is Census conducted by the government. But for this exercise, population will be estimated from the ``area`` as well as the ``category`` of the building. This area will be stored in the nearest roads. Following steps explain this process in detail.
sv: Nu är nästa steg att uppskatta den beroende befolkningen. Den officiella källan till befolkningen är folkräkningen som genomförs av regeringen. Men för denna övning kommer befolkningen att uppskattas från byggnadens "område" och "kategori". Detta område kommer att lagras i de närmaste vägarna. Följande steg förklarar denna process i detalj.

source: Exercise 16: Finding the nearest roads of the buildings
sv: Övning 16: Hitta de närmaste vägarna till byggnaderna

source: To store the population of buildings in the roads, nearest road to a building is to be found. Follow the steps given below to complete this task.
es: Para almacenar la población de edificios en las carreteras, se encuentra la carretera más cercana a un edificio. Siga los pasos que se indican a continuación para completar esta tarea.
sv: För att lagra befolkningen av byggnader i vägarna måste närmaste väg till en byggnad hittas. Följ stegen nedan för att slutföra denna uppgift.

source: Create Function for finding the closest edge.
es: Crear función para encontrar el segmento más cercano.
sv: Skapa funktion för att hitta den närmaste kanten.

source: Add a column in ``buildings_ways`` for storing the id of closest edge
es: Agregue una columna en ``buildings_ways`` para almacenar el identificador del borde más cercano
sv: Lägg till en kolumn i ``buildings_ways`` för att lagra id för närmaste kant

source: Store the edge id of the closest edge in the new column of ``buildings_ways``
es: Almacene el identificador de borde del borde más cercano en la nueva columna de ``buildings_ways``
sv: Spara kant-ID för den närmaste kanten i den nya kolumnen i ``buildings_ways``

source: Exercise 17: Storing the population in the roads
sv: Övning 17: Lagring av befolkningen i vägarna

source: After finding the nearest road, the sum of population of all the nearest buildings is stored in the population column of the roads table. Following image shows the visualised output where the blue colour labels shows the population stored in roads.
es: Después de encontrar la carretera más cercana, la suma de la población de todos los edificios más cercanos se almacena en la columna de población de la tabla de carreteras. La siguiente imagen muestra la salida visualizada donde las etiquetas de color azul muestran la población almacenada en las carreteras.
sv: När den närmaste vägen har hittats lagras summan av befolkningen i alla de närmaste byggnaderna i kolumnen population i tabellen roads. Följande bild visar den visualiserade utdata där de blå färgmarkeringarna visar den befolkning som lagras i vägar.

source: Add a column in ``roads_ways`` for storing population
es: Agregue una columna en ``roads_ways`` para almacenar la población
sv: Lägg till en kolumn i ``roads_ways`` för lagring av befolkning

source: Update the roads with the sum of population of buildings closest to it
es: Actualizar los caminos con la suma de población de edificios más cercanos a ellos
sv: Uppdatera vägarna med summan av invånarantalet i de byggnader som ligger närmast

source: Verify is the population is stored using the following query.
es: Comprobar si la población se almacenó mediante la siguiente consulta.
sv: Kontrollera att populationen är lagrad med hjälp av följande fråga.

source: Exercise 18: Find total population served by the hospital
sv: Övning 18: Hitta den totala befolkning som betjänas av sjukhuset

source: Final step is to find the total population served by the hospital based on travel time.
sv: Det sista steget är att ta fram den totala befolkning som betjänas av sjukhuset baserat på restiden.

source: Pre-processing roads and buildings data
es: Preprocesamiento de datos de caminos y edificios

source: Inspecting the database structure
es: Inspección de la estructura de la base de datos

source: The output of the postgresql command is:
es: El resultado del comando postgresql es:

source: The schema names are ``buildings`` , ``roads`` and ``public``. The owner depends on who has the rights to the database.
es: Los nombres de los esquemas son `buildings`` , ``roads`` and ``public``. El propietario depende de quién tiene los derechos de la base de datos.

source: This is the current search path. Tables cannot be accessed using this.
es: Esta es la ruta de búsqueda actual. No se puede acceder a las tablas mediante esta opción.

source: In this case, search path of roads table is search path to ``roads`` and ``buildings`` schemas. Following query is used to fix the search path
es: En este caso, la ruta de búsqueda de la tabla de carreteras es la ruta de búsqueda a los esquemas `roads`` y ``buildings`` La siguiente consulta se utiliza para corregir la ruta de búsqueda

source: Finally, ``\dt`` is used to verify if the Schema have bees changed correctly.
es: Finalmente, `\dt`` se utiliza para verificar si el esquema se ha cambiado correctamente.

source: Exercise 5: Counting the number of Roads and Buildings
es: Ejercicio 5: Contar el número de carreteras y edificios

source: The importance of counting the information on this workshop is to make sure that the same data is used and consequently the results are same. Also, some of the rows can be seen to understand the structure of the table and how the data is stored in it.
es: La importancia de contar la información en este taller es asegurarse de que se utilizan los mismos datos y, en consecuencia, los resultados son los mismos. Además, algunas de las filas se pueden ver para comprender la estructura de la tabla y cómo se almacenan los datos en ella.

source: The table ``buildings_ways`` contains the buildings in edge form. They have to be converted into polygons to get the area.
es: La tabla `buildings_ways`` contiene los edificios en forma de aristas. Tienen que ser convertidos a polígonos para obtener el área.

source: Exercise 6: Add a spatial column to the table
es: Ejercicio 6: Añadir una columna espacial a la tabla

source: Exercise 7: Removing the polygons with less than 4 points
es: Ejercicio 7: Extracción de los polígonos con menos de 4 puntos

source: Exercise 8: Creating the polygons
es: Ejercicio 8: Creación de los polígonos

source: ``ST_MakePolygons`` is used to make the polygons. This step stores the geom of polygons in the ``poly_geom`` column which was created earlier.
es: ``ST_MakePolygons`` se utiliza para hacer los polígonos. Este paso almacena la geometría de los polígonos en la columna ``poly_geom`` que se creó anteriormente.

source: Exercise 9: Calculating the area
es: Ejercicio 9: Cálculo del área

source: For the next step ``pgr_connectedComponents`` will be used. It is used to find the connected components of an undirected graph using a Depth First Search-based approach.
es: Para el siguiente paso se utilizará ``pgr_connectedComponents``. Se utiliza para encontrar los componentes conectados de un grafo no dirigido utilizando un enfoque basado en la búsqueda en profundidad.

source: **Signatures**
es: **Firmas**

source: `pgr_connectedComponents Documentation <https://docs.pgrouting.org/3.1/en/pgr_connectedComponents.html>`__ can be found at this link for more information.
es: Para más información la documentation de `pgr_connectedComponents <https://docs.pgrouting.org/3.1/en/pgr_connectedComponents.html>`__ puede se emcotrada en esta liga..

source: Exercise 10: Find the Component ID for Road vertices
es: Ejercicio 10: Buscar el identificador de componente para los vértices de carretera

source: First step in Preprocessing Roads is to find the connected component ID for Road vertices. Follow the steps given below to complete this task.
es: El primer paso en preprocesamiento de carreteras es encontrar el identificador de componente conectado para los vértices de carretera. Siga los pasos que se indican a continuación para completar esta tarea.

source: Add a column named ``component`` to store component number.
es: Agregue una columna denominada '``component`` para almacenar el número de componente.

source: Update the ``component`` column in ``roads_ways_vertices_pgr`` with the component number
es: Actualice la columna ``component`` en ``roads_ways_vertices_pgr`` con el número de componente

source: This will store the component number of each edge in the table. Now, the completely connected network of roads should have the maximum count in the ``component`` table.
es: Esto almacenará el número del componente de cada segmento en la tabla. Ahora, la red de carreteras completamente conectada debería tener el recuento máximo en la tabla ``component``.

source: Exercise 11: Finding the components which are to be removed
es: Ejercicio 11: Encontrar los componentes que deben eliminarse

source: This query selects all the components which are not equal to the component number with maximum count using a subquery which groups the rows in ``roads_ways_vertices_pgr`` by the component.
es: Esta consulta selecciona todos los componentes que no son iguales al número de componente con el recuento máximo mediante una subconsulta que agrupa las filas en ``roads_ways_vertices_pgr`` por componentes.

source: Exercise 12: Finding the road vertices of these components
es: Ejercicio 12: Encontrar los vértices de estos componentes

source: Find the road vertices of these components which belong to those components which are to be removed. The following query selects all the road vertices which have the component number from Exercise 11.
es: Encontar los vértices de los componentes que pertenecen al conjunto de componentes que se van a eliminar. La siguiente consulta selecciona todos los vértices de carretera que tienen el número de componente del ejercicio 11.

source: Exercise 13: Removing the unwanted edges and vertices
es: Ejercicio 13: Eliminación de las aristas y vértices no deseados

source: Removing the unwanted edges
es: Eliminación de los segmentos no deseados

source: In ``roads_ways`` table (edge table) ``source`` and ``target`` have the ``id`` of the vertices from where the edge starts and ends. To delete all the disconnected edges the following query takes the output from the query of Step 4 and deletes all the edges having the same ``source`` as the ``id``.
es: En la tabla '`roads_ways`` (tabla de segmentos) ``source`` y ``target`` tienen el ``id`` de los vértices desde donde comienza y termina lel segmento. Para eliminar todas las aristas desconectadas, la siguiente consulta toma el resultado de la consulta del paso 4 y elimina todas las aristas que tienen el mismo `source`` como el ``id``.

source: Removing unused vertices
es: Eliminación de vértices no utilizados

source: The following query uses the output of Step 4 to remove the vertices of the disconnected edges.
es: La siguiente consulta utiliza el resultado del paso 4 para eliminar los vértices de los segmentos desconectados.

source: Finding the roads served by the hospitals
es: Encontrar los caminos atendidos por los hospitales

source: Exercise 14: Finding the closest road vertex
es: Ejercicio 14: Encontrar el vértice de la carretera más cercano

source: Using defaults
es: Uso de valores predeterminados

source: Single Vertex
es: Vértice Único

source: Multiple Vertices
es: Múltiples Vértices

source: Exercise 15: Finding the served roads using pgr_drivingDistance
es: Ejercicio 15: Encontrar las carreteras servidas usando pgr_drivingDistance

source: In this exercise, the roads served based on travel-time are calculated. This can be calculated using ``pgrdrivingDistance`` function of pgRouting. Time in minutes is considered as ``cost``. The ``agg_cost`` column would show the total time required to reach the hospital.
es: En este ejercicio, se calculan los segmentos atendidas en función del tiempo de viaje. Esto se puede calcular utilizando la función ``pgrdrivingDistance`` de pgRouting. El tiempo en minutos se considera como ``costo`` La columna ``agg_cost`` mostrara el tiempo total requerido para llegar al hospital.

source: In line 3, Pedestrian speed is assumed to be as ``1 m/s``. As ``time`` = ``distance/speed``, ``length_m`` / ``1 m/s`` / ``60`` gives the time in minutes
es: En la línea 3, se supone que la velocidad de los peatones es de ``1 m/s`` Como ``tiempo`` = ``distancia/velocidad``, ``length_m`` / ``1 m/s`` / ``60`` da el tiempo en minutos

source: In line 8, ``10`` is written for 10 minutes which is a threshold for ``agg_cost``
es: En la línea 8, ``10`` se escribe durante 10 minutos, que es un umbral para ``agg_cost``

source: In line 8, ``FALSE`` is written as the query is for undirected graph
es: En la línea 8, ``FALSE`` se escribe como la consulta es para el grafo no dirigido

source: ``LIMIT 10`` displays the first 10 rows of the output.
es: ``LIMIT 10`` muestra las primeras 10 filas de la salida.

source: Exercise 16: Generalising the served roads
es: Ejercicio 16: Generalización de las carreteras servidas

source: Exercise 17: Estimating the population of buildings
es: Ejercicio 17: Estimación de la población de edificios

source: Population of an building can be estimated by its area and its category. Buildings of OpenStreetMap data are classified into various categories. For this exercise, the buildings are classified into the following classes:
es: La población de un edificio se puede estimar por su área y su categoría. Los edificios de datos de OpenStreetMap se clasifican en varias categorías. Para este ejercicio, los edificios se clasifican en las siguientes clases:

source: Negligible: People do not live in these places. But the default is 1 because of homeless people.
es: Insignificante: La gente no vive en estos lugares. Pero el valor predeterminado es 1 debido a las personas sin hogar.

source: Very Sparse: People do not live in these places. But the default is 2 because there may be people guarding the place.
es: Muy escaso: La gente no vive en estos lugares. Pero el valor predeterminado es 2 porque puede haber personas vigilando el lugar.

source: Sparse: Buildings with low population density. Also, considering the universities and college because the students live there.
es: Escaso: Edificios con baja densidad de población. Además, teniendo en cuenta las universidades y el colegio porque los estudiantes viven allí.

source: Moderate: A family unit housing kind of location.
es: Moderado: Un tipo de ubicación de vivienda de unidad familiar.

source: Dense: A medium sized residential building.
es: Denso: Un edificio residencial de tamaño mediano.

source: Very Dense: A large sized residential building.
es: Muy denso: Un edificio residencial de gran tamaño.

source: Exercise 18: Finding the nearest roads to store the population
es: Ejercicio 18: Encontrar las carreteras más cercanas para almacenar a la población

source: Exercise 19: Storing the population in the roads
es: Ejercicio 19: Almacenar la población en las carreteras

source: Exercise 20: Finding total population
es: Ejercicio 20: Encontrar la población total
