Repository: pgRouting/workshop
Catalog: locale/*/LC_MESSAGES/un_sdg/sdg3-health.po
Languages: es, sv

source: Good Health and Well Being
es: Buena salud y bienestar
sv: God hälsa och välbefinnande

source: `Good Health and Well Being` is the 3rd Sustainable Development Goal which aspires to ensure health and well-being for all, including a bold commitment to end the epidemics like AIDS, tuberculosis, malaria and other communicable diseases by 2030. It also aims to achieve universal health coverage, and provide access to safe and effective medicines and vaccines for all. Supporting research and development for vaccines is an essential part of this process as well as expanding access to affordable medicines. Hospitals are a very important part of a well functioning health infrastructure. An appropriate planning is required for optimal distribution of the population of an area to its hospitals. Hence, it is very important to estimate the number of dependant people living near the hospital for better planning which would ultimately help in achieving universal coverage of health services. This chapter will focus on solving one such problem.
sv: "God hälsa och välbefinnande" är det tredje målet för hållbar utveckling som syftar till att säkerställa hälsa och välbefinnande för alla, inklusive ett djärvt åtagande att få slut på epidemier som aids, tuberkulos, malaria och andra smittsamma sjukdomar senast 2030. Det syftar också till att uppnå allmän hälso- och sjukvårdstäckning och ge alla tillgång till säkra och effektiva läkemedel och vacciner. Att stödja forskning och utveckling av vacciner är en viktig del av denna process, liksom att utöka tillgången till prisvärda läkemedel. Sjukhus är en mycket viktig del av en välfungerande infrastruktur för hälso- och sjukvård. Det krävs en lämplig planering för att befolkningen i ett område ska kunna fördelas optimalt till sjukhusen. Därför är det mycket viktigt att uppskatta antalet beroende personer som bor nära sjukhuset för bättre planering, vilket i slutändan skulle bidra till att uppnå allmän täckning av hälso- och sjukvårdstjänster. I detta kapitel fokuserar vi på att lösa ett sådant problem.

source: Sustainable Development Goal 3: Good Health and Well Being
es: Objetivo de Desarrollo Sostenible 3: Buena Salud y Bienestar
sv: Mål 3 för hållbar utveckling: God hälsa och välbefinnande

source: `Image Source <https://sdgs.un.org/goals/goal3>`__
es: 'Fuente de la imagen <https://sdgs.un.org/goals/goal3>`__
sv: `Bildkälla <https://sdgs.un.org/goals/goal3>`__

source: Chapter Contents
es: Contenido del Capítulo
sv: Kapitelinnehåll

source: Problem: Estimation of Population Served by Hospitals
es: Problema: Estimación de la población atendida por los hospitales
sv: Problem: Uppskattning av antalet invånare som betjänas av sjukhus

source: **Problem Statement**
es: **Declaración del problema**
sv: **Problemformulering**

source: To determine the population served by a hospital based on travel time
es: Determinar la población atendida por un hospital en función del tiempo de viaje
sv: För att fastställa den befolkning som betjänas av ett sjukhus baserat på restid

source: **Core Idea**
es: **Idea central**
sv: **Kärnidé**

source: Population residing along the roads which reach to a hospital within a particular time is dependant on that hospital.
es: La población que reside a lo largo de las carreteras que llegan a un hospital dentro de un tiempo determinado depende de ese hospital.
sv: Befolkningen som bor längs de vägar som når ett sjukhus inom en viss tid är beroende av det sjukhuset.

source: **Approach**
es: **Enfoque**
sv: **Tillvägagångssätt**

source: To prepare a dataset with:
es: Para preparar un conjunto de datos con:
sv: För att förbereda en dataset med:

source: Edges: Roads
es: Segmentos: Carreteras
sv: Kanter: Vägar

source: Polygons: Buildings with population
es: Polígonos: Edificios con población
sv: Polygoner: Byggnader med befolkning

source: Find the travel-time based the roads served
es: Encuentre el tiempo de viaje basado en los caminos atendidos
sv: Hitta restiden baserat på de vägar som trafikeras

source: Estimate the population of the buildings
es: Estimación de la población de edificios
sv: Uppskatta antalet invånare i byggnaderna

source: Find the nearest road to the buildings
es: Encontrar el camino más cercano a los edificios
sv: Hitta närmaste väg till byggnaderna

source: Store the sum of population of nearest buildings in roads table
es: Almacenar la suma de la población de los edificios más cercanos en la tabla de carreteras
sv: Spara summan av befolkningen i de närmaste byggnaderna i vägtabellen

source: Find the sum of population on all the roads in the roads served
es: Encontar la suma de la población en todas los segmentos de los caminos atendidos
sv: Hitta summan av befolkningen på alla vägar i de vägar som betjänas

source: PostreSQL basics
sv: Grunderna i PostreSQL

source: Preparing work area
sv: Förbereda arbetsområdet

source: The ``search_path`` is a variable that determines the order in which database schemas are searched for objects.
sv: Search_path är en variabel som bestämmer i vilken ordning databasscheman ska genomsökas efter objekt.

source: By setting the ``search_path`` to appropriate values, prepending the schema name to tables can be avoided.
sv: Genom att ställa in ``search_path`` till lämpliga värden kan man undvika att tabellerna får schemanamnet före.

source: Exercise 1: Inspecting schemas
es: Ejercicio 1: Inspección de los esquemas
sv: Övning 1: Inspektera scheman

source: Inspect the schemas by displaying all the present schemas using the following command
es: Inspeccione los esquemas mostrando todos los esquemas actuales mediante el siguiente comando
sv: Inspektera schemana genom att visa alla aktuella scheman med följande kommando

source: The schema names are ``buildings``, ``roads`` and ``public``. The owner depends on who has the rights to the database.
sv: Schemanamnen är ``buildings``, ``roads`` och ``public``. Ägaren beror på vem som har rättigheter till databasen.

source: Exercise 2: Inspecting the search path
es: Ejercicio 2: Inspeccionar la ruta de búsqueda
sv: Övning 2: Inspektera sökvägen

source: Display the current search path using the following query.
es: Mostrar la ruta de búsqueda actual mediante la siguiente consulta.
sv: Visa den aktuella sökvägen med hjälp av följande fråga.

source: This is the current search path. Tables in other schemas cannot be accessed with this path.
sv: Detta är den aktuella sökvägen. Tabeller i andra scheman kan inte nås med den här sökvägen.

source: Exercise 3: Fixing the search path
es: Ejercicio 3: Arreglar la ruta de búsqueda
sv: Övning 3: Fixa sökvägen

source: In this case, the search path needs to include ``roads`` and ``buildings`` schemas. The following query is used to adjust the search path.
sv: I det här fallet måste sökvägen inkludera schemana ``roads`` och ``buildings``. Följande fråga används för att justera sökvägen.

source: Checking the search path again
sv: Kontrollerar sökvägen igen

source: Exercise 4: Enumerating tables
es: Ejercicio 4: Enumerar tablas
sv: Övning 4: Uppräkning av tabeller

source: With ``\dt`` the tables are listed showing the schema and the owner
sv: Med ``\dt`` listas tabellerna med schema och ägare

source: Preparing roads and buildings data
sv: Förbereda data om vägar och byggnader

source: First step is to prepare the data obtained from :doc:`data`.
sv: Första steget är att förbereda data som hämtats från :doc:`data`.

source: This section will work the graph and data that is going to be used for processing. While building the graph, the data has to be inspected to determine if there is any invalid data. This is a very important step to make sure that the data is of required quality. pgRouting can also be used to do some Data Adjustments.
sv: I detta avsnitt behandlas grafen och data som ska användas för bearbetning. När grafen byggs upp måste data inspekteras för att avgöra om det finns några ogiltiga data. Detta är ett mycket viktigt steg för att säkerställa att data håller erforderlig kvalitet. pgRouting kan också användas för att göra vissa datajusteringar.

source: Exercise 5: Counting the number of roads and buildings
sv: Övning 5: Räkna antalet vägar och byggnader

source: The importance of counting the information on this workshop is to make sure that the same data is used and consequently the results are same. Also, some of the rows can be seen to understand the structure of the table and how the data is stored in it.
sv: Vikten av att räkna informationen i denna workshop är att säkerställa att samma data används och att resultaten följaktligen blir desamma. Dessutom kan man se några av raderna för att förstå tabellens struktur och hur uppgifterna lagras i den.

source: Following image shows the roads and buildings visualised.
es: La siguiente imagen muestra las carreteras y edificios visualizados.
sv: Följande bild visar de vägar och byggnader som visualiserats.

source: Preprocessing Buildings
es: Preprocesamiento de edificios
sv: Förbehandling av byggnader

source: The table ``buildings_ways`` contains the buildings in ``LINGSTING`` type. They have to be converted into polygons to get the area, as the area is going to be used to get an estimate of the population living in the building.
sv: Tabellen ``buildings_ways`` innehåller byggnader av typen ``LINGSTING``. De måste omvandlas till polygoner för att få fram arean, eftersom arean kommer att användas för att få en uppskattning av befolkningen som bor i byggnaden.

source: Exercise 6: Removing columns
sv: Övning 6: Ta bort kolumner

source: Columns can be deleted from a table. In this case instead of creating a view, columns that are not related to a **buidling** concept are dropped from ``buildings_ways``.
sv: Kolumner kan tas bort från en tabell. I det här fallet, istället för att skapa en vy, tas kolumner som inte är relaterade till ett **building**-koncept bort från ``buildings_ways``.

source: Exercise 7: Add a spatial column to the table
sv: Övning 7: Lägg till en rumslig kolumn i tabellen

source: Add a spatial column named ``poly_geom`` to the table ``buildings_ways`` to store the Polygon Geometry
es: Agregue una columna espacial denominada ``poly_geom`` a la tabla ``buildings_ways`` para almacenar la geometría del polígono
sv: Lägg till en rumslig kolumn med namnet ``poly_geom`` i tabellen ``buildings_ways`` för att lagra polygongeometrin

source: Inspecting the table:
sv: Inspektion av bordet:

source: Exercise 8: Removing the polygons with less than 4 points
sv: Övning 8: Ta bort polygoner med mindre än 4 punkter

source: ``ST_NumPoints`` is used to find the number of points on a geometry. Also, polygons with less than 3 points/vertices are not considered valid polygons in PostgreSQL. Hence, the buildings having less than 3 vertices need to be cleaned up. Follow the steps given below to complete this task.
es: ``ST_NumPoints`` se utiliza para encontrar el número de puntos en una geometría. Además, los polígonos con menos de 3 puntos/vértices no se consideran polígonos válidos en PostgreSQL. Por lo tanto, los edificios que tienen menos de 3 vértices deben eliminarse. Siguir los pasos que se indican a continuación para completar esta tarea.
sv: `` ST_NumPoints`` används för att hitta antalet punkter på en geometri. Dessutom anses polygoner med mindre än 3 punkter / vertikaler inte vara giltiga polygoner i PostgreSQL. Därför måste byggnaderna som har mindre än 3 vertikaler rensas upp. Följ stegen nedan för att slutföra denna uppgift.

source: Exercise 9: Creating the polygons
sv: Övning 9: Skapa polygoner

source: ``ST_MakePolygons`` is used to make the polygons. This step stores the geometry of polygons in the ``poly_geom`` column which was created earlier.
sv: ``ST_MakePolygons`` används för att skapa polygonerna. I detta steg lagras polygonernas geometri i kolumnen ``poly_geom`` som skapades tidigare.

source: Exercise 10: Calculating the area
sv: Övning 10: Beräkning av area

source: After getting the polygon geometry, next step is to find the area of the polygons. Follow the steps given below to complete this task.
es: Después de obtener la geometría del polígono, el siguiente paso es encontrar el área de los polígonos. Siga los pasos que se indican a continuación para completar esta tarea.
sv: Efter att ha fått polygongeometrin är nästa steg att hitta polygonernas area. Följ stegen nedan för att slutföra denna uppgift.

source: Adding a column for storing the area
es: Agregar una columna para almacenar el área
sv: Lägga till en kolumn för lagring av området

source: Storing the area in the new column
es: Almacenamiento del área en la nueva columna
sv: Lagring av området i den nya kolumnen

source: ``ST_Area`` is used to calculate area of polygons. Area is stored in the new column
es: ``ST_Area`` se utiliza para calcular el área de los polígonos. El área se almacena en la nueva columna
sv: ``ST_Area`` används för att beräkna arean av polygoner. Arean lagras i den nya kolumnen

source: Exercise 11: Estimating the population
sv: Övning 11: Uppskattning av populationen

source: Due to the lack of census data, this exercise will fill up and estimate of the population living on the buildings, based on the area of the building and the kind of use the building gets.
sv: Eftersom det inte finns några folkräkningsuppgifter kommer vi i denna övning att göra en uppskattning av den befolkning som bor i byggnaderna, baserat på byggnadens yta och hur den används.

source: Buildings of OpenStreetMap data are classified into various categories.
sv: Byggnader i OpenStreetMap-data klassificeras i olika kategorier.

source: For this exercise, the population will be set as follows:
sv: För denna övning kommer populationen att fastställas på följande sätt:

source: Negligible:
sv: Försumbar:

source: People do not live in these places.
sv: Människor bor inte på dessa platser.

source: Population: 1 person
sv: Befolkning: 1 person

source: There may be people guarding the place.
sv: Det kan finnas folk som vaktar platsen.

source: Very Sparse:
sv: Mycket gles:

source: Population: At least 2 persons.
sv: Antal invånare: Minst 2 personer.

source: Because there may be people guarding the place.
sv: För att det kan finnas folk som vaktar platsen.

source: Sparse:
sv: Gles:

source: Buildings with low population density, like ``university``.
sv: Byggnader med låg befolkningstäthet, som "universitet".

source: Population: At least 3 persons.
sv: Antal invånare: Minst 3 personer.

source: Students might live there.
sv: Studenter kan bo där.

source: Moderate:
sv: Moderera:

source: Location where people might be living temporarly, like ``hotel`` and ``hospital``.
sv: Plats där människor kan bo tillfälligt, som ``hotel`` och ``hospital``.

source: Population: At least 5 persons.
sv: Antal invånare: Minst 5 personer.

source: Dense:
sv: Tät:

source: A medium sized residential building.
sv: Ett medelstort bostadshus.

source: Population: At least 7 persons.
sv: Antal invånare: Minst 7 personer.

source: Very Dense:
sv: Mycket tät:

source: A large sized residential building, like ``apartments``.
sv: Ett stort bostadshus, som ``apartments``.

source: Population: At least 10 persons.
sv: Antal invånare: Minst 10 personer.

source: Reference: :ref:`un_sdg/data:Appendix`
sv: Referens: :ref:`un_sdg/data:Appendix`

source: This class-specific factor is multiplied with the area of each building to get the population. Follow the steps given below to complete this task.
es: Este factor específico de la clase se multiplica con el área de cada edificio para obtener la población. Siga los pasos que se indican a continuación para completar esta tarea.
sv: Denna klassspecifika faktor multipliceras med ytan för varje byggnad för att få fram befolkningen. Följ stegen nedan för att slutföra den här uppgiften.

source: Create a function to find population using class-specific factor and area.
es: Cree una función para encontrar la población utilizando el factor y el área específicos de la clase.
sv: Skapa en funktion för att beräkna befolkningsmängd med hjälp av klassspecifik faktor och area.

source: All these are estimations based on this particular area. More complicated functions can be done that consider height of the apartments but the design of a function is going to depend on the availability of the data. For example, using census data can achieve more accurate estimation.
es: Todas estas son estimaciones basadas en esta área en particular. Se pueden hacer funciones más complicadas que consideren la altura de los apartamentos pero el diseño de una función va a depender de la disponibilidad de los datos. Por ejemplo, el uso de datos del censo puede lograr una estimación más precisa.
sv: Allt detta är uppskattningar baserade på just detta område. Mer komplicerade funktioner kan göras som tar hänsyn till lägenheternas höjd, men utformningen av en funktion kommer att bero på tillgången till data. Om man till exempel använder folkräkningsdata kan man få en mer exakt uppskattning.

source: Add a column for storing the population in the ``buildings_ways``
es: Agregue una columna para almacenar la población en ``buildings_ways``
sv: Lägg till en kolumn för att lagra befolkningen i ``buildings_ways``

source: 3. Use the ``population`` function to store the population in the new column created in the ``building_ways``.
es: 3. Utilice la función ``population`` para almacenar la población en la nueva columna creada en ``building_ways``.
sv: 3. Använd funktionen ``population`` för att lagra befolkningen i den nya kolumnen som skapats i ``building_ways``.

source: Preprocessing Roads
es: Preprocesamiento de carreteras
sv: Förbehandling av vägar

source: pgRouting algorithms are only useful when the road network belongs to a single graph (or all the roads are connected to each other). Hence, the disconnected roads have to be removed from their network to get appropriate results. This image gives an example of the disconnected edges.
es: Los algoritmos de pgRouting solo son útiles cuando la red de carreteras pertenece a un solo grafo (o todas las carreteras están conectadas entre sí). Por lo tanto, las carreteras desconectadas deben eliminarse de su red para obtener resultados adecuados. Esta imagen da un ejemplo de los bordes desconectados.
sv: pgRouting-algoritmer är endast användbara när vägnätet tillhör en enda graf (eller när alla vägar är anslutna till varandra). Därför måste de frånkopplade vägarna tas bort från deras nätverk för att få lämpliga resultat. Den här bilden ger ett exempel på de frånkopplade kanterna.

source: For example, in the above figure roads with label ``119`` are disconnected from the network. Hence they will have same connected component number. But the count of this number will be less count of fully connected network. All the edges with the component number with count less than maximum count will be removed
es: Por ejemplo, en la figura anterior, las carreteras con la etiqueta '``119`` están desconectadas de la red. Por lo tanto, tendrán el mismo número de componente conectado. Pero el recuento de este número será menor número de red totalmente conectada. Se eliminarán todas las aristas con el número de componente con un recuento inferior al máximo
sv: I figuren ovan är t.ex. vägar med beteckningen ``119`` frånkopplade från nätverket. Därför kommer de att ha samma nummer för anslutna komponenter. Men antalet av detta nummer kommer att vara mindre än antalet i ett helt anslutet nätverk. Alla kanter med komponentnummer som är mindre än det maximala antalet kommer att tas bort

source: Follow the steps given below to complete this task.
es: Siga los pasos que se indican a continuación para completar esta tarea.
sv: Följ stegen nedan för att slutföra denna uppgift.

source: Exercise 12: Remove disconnected components
sv: Övning 12: Demontera bortkopplade komponenter

source: To remove the disconnected components on the road network, the following pgRouting functions, discussed on :doc:`../basic/graphs`, will be used:
sv: För att ta bort de frånkopplade komponenterna i vägnätet används följande pgRouting-funktioner, som diskuteras i :doc:`../basic/graphs`:

source: Create a vertices table.
sv: Skapa en vertices-tabell.

source: Fill up the ``x``, ``y`` and ``geom`` columns.
sv: Fyll i kolumnerna ``x``, ``y`` och ``geom``.

source: Add a ``component`` column on the edges and vertices tables.
sv: Lägg till en ``component``-kolumn i tabellerna edges och vertices.

source: Fill up the ``component`` column on the vertices table.
sv: Fyll i kolumnen ``component`` i tabellen över vertikaler.

source: Fill up the ``component`` column on the edges table.
sv: Fyll i kolumnen ``component`` i tabellen över kanter.

source: Get the component number with the most number of edges.
sv: Hämta komponentnumret med flest antal kanter.

source: Delete edges not belonging to the most connected component.
sv: Ta bort kanter som inte hör till den mest anslutna komponenten.

source: Delete vertices not belonging to the most connected component.
sv: Ta bort hörn som inte hör till den mest anslutna komponenten.

source: Find the roads served by the hospitals
sv: Hitta de vägar som betjänas av sjukhusen

source: After pre-processing the data, next step is to find the area served by the hospital. This area can be computed from the entrance of the hospital or from any point on road near the hospital. In this exercise it is computed from closest road vertex. ``pgr_drivingDistance`` will be used to find the roads served. The steps to be followed are:
es: Después de preprocesar los datos, el siguiente paso es encontrar el área atendida por el hospital. Esta área se puede calcular desde la entrada del hospital o desde cualquier punto de la carretera cerca del hospital. En este ejercicio se calcula a partir del vértice de carretera más cercano. ``pgr_drivingDistance`` se utilizará para encontrar las carreteras atendidas. Los pasos a seguir son:
sv: Efter förbehandling av data är nästa steg att hitta det område som betjänas av sjukhuset. Detta område kan beräknas från sjukhusets entré eller från vilken punkt som helst på vägen nära sjukhuset. I den här övningen beräknas det från närmaste vägvertex. ``pgr_drivingDistance`` kommer att användas för att hitta de vägar som betjänas. De steg som ska följas är:

source: Finding the closest road vertex
es: Encontrar el vértice de camino más cercano
sv: Hitta närmaste vägkorsning

source: Finding the roads served
es: Encontrar los caminos atendidos
sv: Hitta de vägar som trafikeras

source: Generalising the roads served
es: Generalización de los caminos atendidos
sv: Generalisering av de vägar som trafikeras

source: For the next step ``pgr_drivingDistance`` will be used. This returns the driving distance from a start node. It uses the Dijkstra algorithm to extract all the nodes that have costs less than or equal to the value distance. The edges that are extracted conform to the corresponding spanning tree.
es: Para el siguiente paso se utilizará ``pgr_drivingDistance``. Esto devuelve la distancia de conducción desde un nodo de inicio. Utiliza el algoritmo de Dijkstra para extraer todos los nodos que tienen costos menores o iguales a la distancia de valor. Los segmentos que se extraen se ajustan al árbol de expansión correspondiente.
sv: För nästa steg kommer ``pgr_drivingDistance`` att användas. Detta returnerar köravståndet från en startnod. Den använder Dijkstra-algoritmen för att extrahera alla noder som har kostnader som är mindre än eller lika med värdeavståndet. De kanter som extraheras överensstämmer med motsvarande spänningsträd.

source: Signatures
es: Firmas
sv: Underskrifter
