Repository: pgRouting/workshop
Catalog: locale/*/LC_MESSAGES/un_sdg/sdg7-energy.po
Languages: es, sv

source: Affordable and Clean Energy
es: Energía asequible y limpia
sv: Prisvärd och ren energi

source: `Affordable and Clean Energy` is the 7th Sustainable Development Goal 11. It aspires to ensure access to `affordable, reliable, sustainable` and `modern` energy for all. Today renewable energy is making impressive gains in the electricity sector. As more and more new settlements are built, there would be new electricity distribution network developed. Electricity Distribution is very expensive infrastructure. Finding the optimal path for laying this infrastructure is very crucial to maintain the affordability of electricity for everyone. This exercise focusses on finding this optimal path/network for laying the electricity distribution equipment.
es: 'Energía asequible y limpia' es el 7º Objetivo de Desarrollo Sostenible 11. Aspira a garantizar el acceso a una energía "asequible, fiable, sostenible" y "moderna" para todos. Hoy en día, la energía renovable está logrando ganancias impresionantes en el sector eléctrico. A medida que se construyan más y más nuevos asentamientos, se desarrollará una nueva red de distribución de electricidad. La distribución de electricidad es una infraestructura muy costosa. Encontrar el camino óptimo para colocar esta infraestructura es crucial para mantener la asequibilidad de la electricidad para todos. Este ejercicio se centra en encontrar esta ruta / red óptima para colocar el equipo de distribución de electricidad.
sv: `Ren energi för alla` är det sjunde målet för hållbar utveckling, mål 11. Det syftar till att säkerställa tillgång till `prisvärd, tillförlitlig, hållbar` och `modern` energi för alla. Idag gör förnybar energi imponerande framsteg inom elsektorn. I takt med att fler och fler nya bosättningar byggs kommer nya eldistributionsnät att utvecklas. Eldistribution är en mycket dyrbar infrastruktur. Att hitta den optimala vägen för att lägga denna infrastruktur är mycket viktigt för att upprätthålla överkomliga priser på el för alla. Den här övningen fokuserar på att hitta den optimala vägen/det optimala nätverket för att anlägga utrustningen för eldistribution.

source: Sustainable Development Goal 7: Affordable and Clean Energy
es: Objetivo de Desarrollo Sostenible 7: Energía asequible y limpia
sv: Mål 7 för hållbar utveckling: Hållbar energi för alla

source: `Image Source <https://sdgs.un.org/goals/goal7>`__
es: 'Fuente de la imagen <https://sdgs.un.org/goals/goal7>`__
sv: `Bildkälla <https://sdgs.un.org/goals/goal7>`__

source: Chapter Contents
es: Contenido del Capítulo
sv: Kapitelinnehåll

source: Problem: Optimising the Electricity Distribution Network
es: Problema: Optimización de la red de distribución eléctrica
sv: Problem: Optimering av eldistributionsnätet

source: **Problem Statement**
es: **Declaración del problema**
sv: **Problemformulering**

source: To determine the least length of the path for laying the electricity distribution equipment such that every building is served
es: Determinar la menor longitud del camino para la colocación de equipo de distribución de electricidad de tal manera que cada edificio sea atendido
sv: Att bestämma den minsta längden på vägen för att lägga elfördelningsutrustningen så att varje byggnad betjänas

source: **Core Idea**
es: **Idea central**
sv: **Kärnidé**

source: Electricity lines may not be there on every road of the city. In a complex road network of a city, the network can be optimised for less length such that Electricity lines reach every locality of the city. Less length leads to enhanced cost-effectiveness resulting in affordable electricity.
es: Es posible que las líneas eléctricas no estén en todas las carreteras de la ciudad. En una red de carreteras compleja de una ciudad, la red se puede optimizar para una longitud menor, de modo que las líneas eléctricas lleguen a todas las localidades de la ciudad. Menor longitud conduce a una mayor rentabilidad, lo que resulta en electricidad asequible.
sv: Det är inte säkert att det finns elledningar på alla gator i staden. I ett komplext vägnät i en stad kan nätet optimeras för att bli mindre långt, så att elledningarna når alla platser i staden. Mindre längd leder till ökad kostnadseffektivitet, vilket resulterar i prisvärd el.

source: **Approach**
es: **Enfoque**
sv: **Tillvägagångssätt**

source: Extract connected components of roads
es: Extraer componentes conectados de carreteras
sv: Extrahera anslutna komponenter av vägar

source: Use pgRouting to find the minimum spanning tree
es: Usar pgRouting para encontrar el árbol de expansión mínimo
sv: Använd pgRouting för att hitta det minsta spannande trädet

source: Compare the total length of roads and minimum spanning tree
es: Comparar la longitud total de las carreteras y el árbol de expansión mínimo
sv: Jämför den totala längden på vägar och minsta spännvidden på träd

source: Pre-processing roads data
es: Preprocesamiento de datos de carreteras
sv: Förbehandling av vägdata

source: First step is to pre-process the data obtained from :ref:`un_sdg/data:Data for Sustainable Development Goals`. This section will work the graph that is going to be used for processing. While building the graph, the data has to be inspected to determine if there is any invalid data. This is a very important step to make sure that the data is of required quality. pgRouting can also be used to do some Data Adjustments. This will be discussed in further sections.
es: El primer paso es preprocesar los datos obtenidos de :ref:`un_sdg/data:Datos para los Objetivos de Desarrollo Sostenible`. En esta sección se trabajará el gráfico que se va a utilizar para el procesamiento. Al construir el gráfico, los datos deben inspeccionarse para determinar si hay datos no válidos. Este es un paso muy importante para asegurarse de que los datos sean de la calidad requerida. pgRouting también se puede utilizar para realizar algunos ajustes de datos. Esto se discutirá en secciones posteriores.

source: Setting the Search Path of Roads
es: Establecer la ruta de búsqueda de carreteras
sv: Ställa in sökvägen för vägar

source: First step in pre processing is to set the search path for ``Roads`` data. Search path is a list of schemas helps the system determine how a particular table is to be imported.
es: El primer paso en el preprocesamiento es establecer la ruta de búsqueda para los datos de ``Carreteras``. La ruta de búsqueda es una lista de esquemas que ayuda al sistema a determinar cómo se va a importar una tabla en particular.
sv: Första steget i förbehandlingen är att ställa in sökvägen för ``Roads``-data. Sökvägen är en lista med scheman som hjälper systemet att avgöra hur en viss tabell ska importeras.

source: Exercise 1: Inspecting the current schemas
es: Ejercicio 1: Inspección de los esquemas actuales

source: Inspect the schemas by displaying all the present schemas using the following command
es: Inspeccione los esquemas mostrando todos los esquemas actuales mediante el siguiente comando

source: The schema names are ``roads`` and ``public``. The owner depends on who has the rights to the database.
es: Los nombres de esquema son ``roads`` and ``public``. El propietario depende de quién tiene los derechos de la base de datos.

source: Exercise 2: Inspecting the current search path
es: Ejercicio 2: Inspeccion de la ruta de búsqueda actual

source: Display the current search path using the following query.
es: Mostrar la ruta de búsqueda actual mediante la siguiente consulta.

source: This is the current search path. Tables cannot be accessed using this.
es: Esta es la ruta de búsqueda actual. No se puede acceder a las tablas mediante esta opción.

source: Exercise 3: Fixing the current search path
es: Ejercicio 3: Arreglo de la ruta de búsqueda

source: In this case, search path of roads table is set to ``roads`` schema. Following query is used to fix the search path
es: En este caso, la tabla de rutas de búsqueda de carreteras se establece en el esquema '``roads`` . La siguiente consulta se utiliza para corregir la ruta de búsqueda

source: Exercise 4: Enumerating the tables
es: Ejercicio 4: Enumerar las tablas

source: Finally, ``\dt`` is used to verify if the Schema have bees changed correctly.
es: Finalmente, `\dt`` se utiliza para verificar si el esquema se ha cambiado correctamente.

source: Exercise 5: Counting the number of Roads
es: Ejercicio 5: Contar el número de carreteras

source: The importance of counting the information on this workshop is to make sure that the same data is used and consequently the results are same. Also, some of the rows can be seen to understand the structure of the table and how the data is stored in it.
es: La importancia de contar la información en este taller es asegurarse de que se utilizan los mismos datos y, en consecuencia, los resultados son los mismos. Además, algunas de las filas se pueden ver para comprender la estructura de la tabla y cómo se almacenan los datos en ella.

source: pgr_connectedComponents for preprocessing roads
es: ``pgr_connectedComponents`` para el preprocesamiento de carreteras

source: For the next step ``pgr_connectedComponents`` will be used. It is used to find the connected components of an undirected graph using a Depth First Search-based approach.
es: Para el siguiente paso se utilizará ``pgr_connectedComponents``. Se utiliza para encontrar los componentes conectados de un grafo no dirigido utilizando un enfoque basado en la búsqueda en profundidad.

source: **Signatures**
es: **Firmas**

source: `pgr_connectedComponents Documentation <https://docs.pgrouting.org/3.1/en/pgr_connectedComponents.html>`__ can be found at this link for more information.
es: Para más información la documentation de `pgr_connectedComponents <https://docs.pgrouting.org/3.1/en/pgr_connectedComponents.html>`__ puede se emcotrada en esta liga..

source: Follow the steps given below to complete this task.
es: Siga los pasos que se indican a continuación para completar esta tarea.

source: Exercise 6: Find the Component ID for Road vertices
es: Ejercicio 6: Buscar el identificador de componente para los vértices de carretera

source: First step in Preprocessing Roads is to find the connected component ID for Road vertices. Follow the steps given below to complete this task.
es: El primer paso en preprocesamiento de carreteras es encontrar el identificador de componente conectado para los vértices de carretera. Siga los pasos que se indican a continuación para completar esta tarea.

source: Add a column named ``component`` to store component number.
es: Agregue una columna denominada '``component`` para almacenar el número de componente.

source: Update the ``component`` column in ``roads_ways_vertices_pgr`` ith the component number
es: Actualice la columna '`component`` en ``roads_ways_vertices_pgr`` en el número de componente

source: This will store the component number of each edge in the table. Now, the completely connected network of roads should have the maximum count in the ``component`` table.
es: Esto almacenará el número del componente de cada segmento en la tabla. Ahora, la red de carreteras completamente conectada debería tener el recuento máximo en la tabla ``component``.

source: Exercise 7: Finding the components which are to be removed
es: Ejercicio 7: Encontrar los componentes que deben eliminarse

source: This query selects all the components which are not equal to the component number with maximum count using a subquery which groups the rows in ``roads_ways_vertices_pgr`` by the component.
es: Esta consulta selecciona todos los componentes que no son iguales al número de componente con el recuento máximo mediante una subconsulta que agrupa las filas en ``roads_ways_vertices_pgr`` por componentes.

source: Exercise 8: Finding the road vertices of these components
es: Ejercicio 8: Encontrar los vértices de la carretera de estos componentes

source: Find the road vertices if these components which belong to those components which are to be removed. The following query selects all the road vertices which have the component number from Exercise 7.
es: Encontar los vértices de la carretera si estos componentes pertenecen a los componentes que se van a eliminar. La siguiente consulta selecciona todos los vértices de carretera que tienen el número de componente del ejercicio 7.

source: Exercise 9: Removing the unwanted edges and vertices
es: Ejercicio 9: Eliminación de las aristas y vértices no deseados

source: Removing the unwanted edges
es: Eliminación de los segmentos no deseados

source: In ``roads_ways`` table (edge table) ``source`` and ``target`` have the ``id`` of the vertices from where the edge starts and ends. To delete all the disconnected edges the following query takes the output from the query of Step 4 and deletes all the edges having the same ``source`` as the ``id``.
es: En la tabla '`roads_ways`` (tabla de segmentos) ``source`` y ``target`` tienen el ``id`` de los vértices desde donde comienza y termina lel segmento. Para eliminar todas las aristas desconectadas, la siguiente consulta toma el resultado de la consulta del paso 4 y elimina todas las aristas que tienen el mismo `source`` como el ``id``.

source: Removing unused vertices
es: Eliminación de vértices no utilizados

source: The following query uses the output of Step 4 to remove the vertices of the disconnected edges.
es: La siguiente consulta utiliza el resultado del paso 4 para eliminar los vértices de los segmentos desconectados.

source: For the next step ``pgr_kruskalDFS`` will be used. Kruskal algorithm is used for getting the Minimum Spanning Tree with Depth First Search ordering. A minimum spanning tree (MST) is a subset of edges of a connected undirected graph that connects all the vertices together, without any cycles such that sum of edge weights is as small as possible.
es: Para el siguiente paso se utilizará ``pgr_kruskalDFS``. El algoritmo de Kruskal se utiliza para obtener el árbol de expansión mínimo con el orden de búsqueda de profundidad primero. Un árbol de expansión mínimo (MST) es un subconjunto de aristas de un grafo conectado no dirigido que conecta todos los vértices juntos, sin ningún ciclo, tal que la suma de los pesos de las aristas sea lo más pequeña posible.
sv: För nästa steg kommer ``pgr_kruskalDFS`` att användas. Kruskal-algoritmen används för att få fram det minsta spännviddsträdet med djup först-sökordning. Ett minsta spännträd (MST) är en delmängd av kanter i ett anslutet oriktat diagram som ansluter alla hörn tillsammans, utan några cykler så att summan av kantvikter är så liten som möjligt.

source: Signatures
es: Firmas
sv: Underskrifter

source: Single vertex
es: Un solo vértice

source: Multiple vertices
es: Múltiples vértices

source: `pgr_kruskalDFS Documentation <https://docs.pgrouting.org/3.1/en/pgr_kruskalDFS.html>`__ can be found at this link for more information.
es: Para más información la documentation de `pgr_kruskalDFS <https://docs.pgrouting.org/3.1/en/pgr_kruskalDFS.html>`__ puede se emcotrada en esta liga..
sv: `pgr_kruskalDFS Dokumentation <https://docs.pgrouting.org/3.1/en/pgr_kruskalDFS.html>`__ finns på denna länk för mer information.

source: Exercise 10: Find the minimum spanning tree
es: Ejercicio 10: Encontrar el árbol de expansión mínimo

source: The road network has a minimum spanning forest which is a union of the minimum spanning trees for its connected components. This minimum spanning forest is the optimal network of electricity distribution components.
es: La red de carreteras tiene un bosque de expansión mínimo que es una unión de los árboles de expansión mínimos para sus componentes conectados. Este bosque de expansión mínimo es la red óptima de componentes de distribución de electricidad.
sv: Vägnätet har en skog med minsta spann som är en förening av de träd med minsta spann som finns för dess anslutna komponenter. Denna skog med minsta spännvidd är det optimala nätverket av komponenter för eldistribution.

source: To complete this task, execute the query below.
es: Para completar esta tarea, ejecute la consulta siguiente.
sv: För att slutföra denna uppgift, kör nedanstående fråga.

source: The following query will give the results with the source vertex, target vertex, edge id, aggregate cost.
es: La siguiente consulta dará los resultados con el vértice de origen, el vértice de destino, el identificador del segmento, y el costo agregado.
sv: Följande fråga kommer att ge resultaten med källvertex, målvertex, kant-ID, aggregerad kostnad.

source: ``LIMIT 10`` displays the first 10 rows of the output.
es: ``LIMIT 10`` muestra las primeras 10 filas de la salida.

source: Comparison between Total and Optimal lengths
es: Comparación entre longitudes totales y óptimas
sv: Jämförelse mellan totala och optimala längder

source: Total lengths of the network and the minimum spanning tree can be compared to see the difference between both. To do the same, follow the steps below:
es: Las longitudes totales de la red y el árbol de expansión mínimo se pueden comparar para ver la diferencia entre ambos. Para hacerlo, siga los pasos a continuación:
sv: Nätverkets totala längd och det minsta spännviddsträdet kan jämföras för att se skillnaden mellan de båda. Följ stegen nedan för att göra samma sak:

source: Exercise 11: Compute total length of material required in km
es: Ejercicio 11: Calcular la longitud total del material requerido en km

source: Compute the total length of the minimum spanning tree which is an estimate of the total length of material required.
es: Calcular la longitud total del árbol de expansión mínimo, que es una estimación de la longitud total del material requerido.
sv: Beräkna den totala längden på det minsta spännviddsträdet, vilket är en uppskattning av den totala längden på det material som krävs.

source: ``(length_m)/1000`` is used to fine the length in kilometres
es: '``(length_m)/1000`` se utiliza para encontrar la longitud en kilómetros

source: Exercise 12: Compute total length of roads
es: Ejercicio 12: Calcular la longitud total de las carreteras

source: Compute the total length of the road network of the given area..
es: Calcular la longitud total de la red de carreteras del área dada.
sv: Beräkna den totala längden på vägnätet i det givna området...

source: For this area we are getting following outputs:
es: Para esta área estamos obteniendo los siguientes resultados:

source: Total Road Length: ``55.68 km``
es: Longitud total de la carretera: ``55.68 km``

source: Optimal Network Length: ``29.89 km``
es: Longitud óptima de la red: '``29.89 km``

source: Length of minimum spanning tree is about half of the length of total road network.
es: La longitud del árbol de expansión mínima es aproximadamente la mitad de la longitud de la red total de carreteras.
sv: Längden på det minsta spännviddiga trädet är ungefär hälften av längden på det totala vägnätet.

source: Further possible extensions to the exercise
es: Otras posibles extensiones al ejercicio
sv: Ytterligare möjliga utvidgningar av övningen

source: Finding the optimal network of roads such that it reaches every building
es: Encontrar la red óptima de carreteras de tal manera que llegue a todos los edificios

source: Finding the optimal number and locations of Electricity Transformers
es: Encontrar el número y la ubicación óptimos de los transformadores de electricidad

source: First step is to pre-process the data obtained from :doc:`data`. This section will work the graph that is going to be used for processing. While building the graph, the data has to be inspected to determine if there is any invalid data. This is a very important step to make sure that the data is of required quality. pgRouting can also be used to do some Data Adjustments. This will be discussed in further sections.
sv: Första steget är att förbehandla data som hämtats från :doc:`data`. I det här avsnittet beskrivs den graf som ska användas för bearbetningen. När grafen byggs upp måste data inspekteras för att avgöra om det finns några ogiltiga data. Detta är ett mycket viktigt steg för att säkerställa att data håller den kvalitet som krävs. pgRouting kan också användas för att göra vissa datajusteringar. Detta kommer att diskuteras i ytterligare avsnitt.

source: Exercise 1: Set the seach path
sv: Övning 1: Ange sökväg för sökning

source: In this case, search path of roads table is search path to ``roads`` and ``buildings`` schemas. Following query is used to adjust the search path.
sv: I det här fallet är sökvägen för tabellen roads sökvägen till schemana ``roads`` och ``buildings``. Följande fråga används för att justera sökvägen.

source: Checking the search path again
sv: Kontrollerar sökvägen igen

source: Exercise 2: Remove disconnected components
sv: Övning 2: Demontera bortkopplade komponenter

source: To remove the disconnected components on the road network, the following pgRouting functions, discussed on :doc:`../basic/graphs`, will be used:
sv: För att ta bort de frånkopplade komponenterna i vägnätet används följande pgRouting-funktioner, som diskuteras i :doc:`../basic/graphs`:

source: Create a vertices table.
sv: Skapa en vertices-tabell.

source: Fill up the ``x``, ``y`` and ``geom`` columns.
sv: Fyll i kolumnerna ``x``, ``y`` och ``geom``.

source: Add a ``component`` column on the edges and vertices tables.
sv: Lägg till en ``component``-kolumn i tabellerna edges och vertices.

source: Fill up the ``component`` column on the vertices table.
sv: Fyll i kolumnen ``component`` i tabellen över vertikaler.

source: Fill up the ``component`` column on the edges table.
sv: Fyll i kolumnen ``component`` i tabellen över kanter.

source: Get the component number with the most number of edges.
sv: Hämta komponentnumret med flest antal kanter.

source: Delete edges not belonging to the most connected component.
sv: Ta bort kanter som inte hör till den mest anslutna komponenten.

source: Delete vertices not belonging to the most connected component.
sv: Ta bort hörn som inte hör till den mest anslutna komponenten.

source: Exercise 3: Find the minimum spanning tree
sv: Övning 3: Hitta det minsta spännviddsträdet

source: Exercise 4: Compute total length of material required in km
sv: Övning 4: Beräkna den totala längden på det material som krävs i km

source: Exercise 5: Compute total length of roads
sv: Övning 5: Beräkna vägarnas totala längd

source: -For this area we are getting following outputs: - -* Total Road Length: ``55.68 km`` -* Optimal Network Length: ``29.89 km``
sv: -För detta område får vi följande utdata: - -* Total väglängd: 55,68 km -* Optimal nätverkslängd: 29,89 km

source: Find the optimal network of roads such that it reaches every building
sv: Hitta det optimala vägnätet så att det når fram till varje byggnad

source: Find the optimal number and locations of Electricity Transformers
sv: Hitta det optimala antalet och den optimala placeringen av eltransformatorer
