Repository: pgRouting/workshop
Catalog: locale/*/LC_MESSAGES/appendix/appendix-3.po
Languages: es

source: Appendix: osm2pgrouting Import Tool
es: Apéndice: Herramienta de Importación osm2pgrouting

source: **osm2pgrouting** is a command line tool that allows to import OpenStreetMap data into a pgRouting database. It builds the routing network topology automatically and creates tables for feature types and road classes.
es: **osm2pgrouting** es una herramienta de línea de comandos que permite importar datos de OpenStreetMap a una base de datos pgRouting. Crea automáticamente la topología de red de ruteo y crea tablas para atributos de tipos y clases de caminos.

source: Website: |osm2pgrouting-web|
es: Sitio web: |osm2pgrouting-web|

source: Documentation: |osm2pgrouting-wiki|
es: Documentación: |osm2pgrouting-wiki|

source: There are some limitations, especially regarding the network size. The way to handle large data sets is to current version of osm2pgrouting needs to load all data into memory, which makes it fast but also requires a lot or memory for large datasets. An alternative tool to osm2pgrouting without the network size limitation is **osm2po** (https://osm2po.de). It's available under "Freeware License".
es: Hay algunas limitaciones, especialmente con respecto al tamaño de la red. La forma de manejar conjuntos de datos grandes es la versión actual de osm2pgrouting necesita cargar todos los datos en la memoria, lo que lo hace rápido, pero también requiere mucha memoria para grandes conjuntos de datos. Una herramienta alternativa a osm2pgrouting sin la limitación del tamaño de la red es **osm2po** (https://osm2po.de). Está disponible en "Freeware License".

source: Raw OpenStreetMap data contains much more features and information than needed for routing. Also the format is not suitable for pgRouting out-of-the-box. An ``.osm`` XML file consists of three major feature types:
es: Los datos sin procesar de OpenStreetMap contienen muchas más características e información de la necesaria para el enrutamiento. Además, el formato no es adecuado para usar automáticamente en pgRouting. Un archivo XML ``.osm`` consta de tres tipos de atributos principales:

source: nodes
es: nodos

source: ways
es: caminos

source: relations
es: relaciones

source: Version and Help Options
es: Versión y opciones de ayuda

source: This workshop use the osm2pgrouting version |osm2pgrouting-ver|
es: Este taller utiliza la versión osm2pgrouting |osm2pgrouting-ver|

source: An osm file example looks like this:
es: Un ejemplo de archivo osm tiene este aspecto:

source: The detailed description of all possible OpenStretMap types and classes are described as `map features <https://wiki.openstreetmap.org/wiki/Map_features>`__
es: La descripción detallada de todos los tipos y clases de OpenStretMap posibles se describen como `características del mapa <https://wiki.openstreetmap.org/wiki/Map_features>`__

source: When using osm2pgrouting, we take only nodes and ways of types and classes specified in a ``mapconfig.xml`` file that will be imported into the routing database:
es: Cuando se utiliza osm2pgrouting, solo tomamos nodos y caminos y las clases especificados en un archivo ``mapconfig.xml`` que se importará a la base de datos de ruteo:

source: The default ``mapconfig.xml`` is installed in ``/usr/share/osm2pgrouting/``.
es: Por defecto, ``mapconfig.xml`` es instalado en ``/usr/share/osm2pgrouting/``.

source: osm2pgrouting creates more tables and imports more attributes than we will use in this workshop.
es: osm2pgrouting crea más tablas e importa más atributos de los que usaremos en este taller.

source: See the description of the tables the |osm2pgrouting-wiki|
es: Vea la descripción de las tablas |osm2pgrouting-wiki|
