Repository: pgRouting/workshop
Catalog: locale/*/LC_MESSAGES/appendix/appendix-2.po
Languages: es

source: Appendix: Installation
es: Apéndice: Instalación

source: For this workshop you need:
es: Para este taller necesitas:

source: Linux operating system like Ubuntu
es: Sistema operativo de Linux como Ubuntu

source: An editor like Gedit, Medit or similar
es: Un editor como Gedit, Medit o similar

source: `Geoserver <https://live.osgeo.org/en/quickstart/geoserver_quickstart.html>`__ for the routing application
es: `Geoserver <https://live.osgeo.org/en/quickstart/geoserver_quickstart.html>`__ para la aplicación de ruteo

source: Internet connection
es: Conexión a Internet

source: `Install pgRouting on a Windows computer <https://postgis.net/windows_downloads/>`__.
es: `Instalar pgRouting en un equipo Windows <https://postgis.net/windows_downloads/>`__.

source: The following reference is a quick summary of how to install it on your own computer running Ubuntu 14.04 or later.
es: La siguiente referencia es un resumen de cómo instalarlo en su computadora ejecutando Ubuntu 14.04 o posterior.

source: pgRouting on Ubuntu can be installed using packages from a `PostgreSQL repository <https://apt.postgresql.org/pub/repos/apt/>`__:
es: pgRouting en Ubuntu se puede instalar utilizando paquetes de un `repositorio de PostgreSQL <https://apt.postgresql.org/pub/repos/apt/>`__:

source: Using a terminal window:
es: Usando una ventana de terminal:

source: This will also install all required packages such as PostgreSQL and PostGIS if not installed yet.
es: Esto también instalará todos los paquetes necesarios como PostgreSQL y PostGIS si todavía no están instalados.

source: To be up-to-date with changes and improvements
es: Para estar al día con los cambios y mejoras

source: To avoid permission denied errors for local users you can set connection method to ``trust`` in ``/etc/postgresql/<version>/main/pg_hba.conf`` and restart PostgreSQL server with ``sudo service postgresql restart``.
es: Para evitar errores de permiso denegado para los usuarios locales, se puede ajustar el método de conexión a ``trust`` en ``/etc/postgresql/<version>/main/pg_hba.conf`` y reiniciar el servidor PostgreSQL con ``sudo service postgresql restart``.

source: Following the example with PostgreSQL 10:
es: Siguiendo el ejemplo con 10 PostgreSQL:
